{"http://mmajunkie.com/2018/04/ufc-223-statement-conor-mcgregor-bus-attack-consequences-new-york": [{"author": "MMAjunkie Staff", "description": "The UFC has issued a formal statement on the events that took place at a media day today in support of UFC 223.", "publishedAt": "2018-04-06T02:34:17Z", "source": "Mmajunkie.com", "text": "[By MMAjunkie StaffApril 5, 2018 10:30 pmFollow@MMAjunkie!function(d,s,id){var js,fjs=d.getElementsByTagName(s)[0],p=/^http:/.test(d.location)?'http':'https';if(!d.getElementById(id)){js=d.createElement(s);js.id=id;js.src=p+'://platform.twitter.com/widgets.js';fjs.parentNode.insertBefore(js,fjs);}}(document, 'script', 'twitter-wjs');, By: MMAjunkie Staff| April 5, 2018 10:30 pmFollow @MMAjunkie!function(d,s,id){var js,fjs=d.getElementsByTagName(s)[0],p=/^http:/.test(d.location)?'http':'https';if(!d.getElementById(id)){js=d.createElement(s);js.id=id;js.src=p+'://platform.twitter.com/widgets.js';fjs.parentNode.insertBefore(js,fjs);}}(document, 'script', 'twitter-wjs');, The UFC has issued a formal statement on the events that took place at a media day today in support of UFC 223. Following a media event for the card at Barclays Center in Brooklyn, N.Y. lightweight champion Conor McGregor (21-3 MMA, 9-1 UFC) came into the building along with members of his team and ultimately attacked a bus containing fighters from UFC 223 and their teams, witness videos showed. The attack on the bus included a broken window after McGregor threw a dolly, and the fallout from the whole thing has taken three fights off the card. McGregor teammate Artem Lobov (13-14-1 MMA, 2-4 UFC) was removed from his featherweight fight against Alex Caceres (13-11 MMA, 8-9 UFC) for his participation in the attack. Michael Chiesa (14-3 MMA, 7-3 UFC) was sent to the hospital for cuts, and ultimately his fight against Anthony Pettis (20-7 MMA, 7-6 UFC) was nixed by the New York State Atletic Commission. And Ray Borg (11-3 MMA, 5-3 UFC) will miss his flyweight fight against Brandon Moreno (14-4 MMA, 3-1 UFC) after glass shards got in his eye from the broken window. The UFC said there will be consequences for McGregor and Lobov for their roles, and said they are not welcome at Barclays Center this weekend. The UFCs full statement:, During todays media event at Barclays Center to promote UFC 223: Khabib vs. Holloway, Conor McGregor and Artem Lobov entered the building accompanied by over a dozen individuals. The group, which included McGregor and Lobov, vandalized the vehicle that contained a number of athletes competing at the event taking place this weekend. NYPD was immediately alerted and is currently in the process of investigating the situation. UFC is working very closely with the New York Athletic Commission, Barclays Center security and law enforcement authorities. All parties are working together to ensure the highest standard of proper safety precautions are implemented to protect the fans and athletes. The organization deems todays disruption completely unacceptable and is currently working on the consequences that will follow. Immediately, Lobov has been removed from this weekends card and individuals involved in the incident are not welcome at tomorrows ceremonial weigh-in or Saturdays event at Barclays Center. The current UFC 223 lineup includes:, MAIN CARD (Pay-per-view, 10 p.m. ET), PRELIMINARY CARD (FS1, 8 p.m. ET), PRELIMINARY CARD (UFC Fight Pass, 6:30 p.m. ET), For more onUFC 223, check out theUFC Rumorssection of the site. Alex Caceres, Anthony Pettis, Artem Lobov, Brandon Moreno, Conor McGregor, Michael Chiesa, Ray Borg, Featured, News, UFC, Ray Borg's UFC 223 fight scrapped with eye issue reportedlyfrom Conor McGregor bus attack, Conor McGregor teammate Artem Lobov pulled from UFC 223 in wake of melee, Conor McGregor's chaotic arrival after UFC 223 media day causes damage, injury to Michael Chiesa, Videos April 5, 2018 10:00 pm Mike Bohn and Ken Hathaway Joanna Jedrzejczyk is doing everything in her power to fizzle concerns about her UFC 223 weight cut. UFC April 5, 2018 9:45 pm MMAjunkie Staff The Ray Borg vs. Brandon Moreno fight is the latest UFC 223 casualty to come from Conor McGregors bus attack in Brooklyn today. UFC April 5, 2018 9:30 pm Mike Bohn Michael Chiesa is off Saturdays UFC 223 card after he suffered multiple cuts from todays attack by Conor McGregor and his team. UFC April 5, 2018 9:00 pm Dan Tom MMAjunkie Radio co-host Dan Tom provides a breakdown of all of UFC 223s top bouts. Take a look at the three fights that open the main card. 1 2 3 4, UFC April 5, 2018 8:00 pm Steven Marrocco, The Blue Corner A UFC executives recounting of Conor McGregors bus melee was a bit dramatic. Videos April 5, 2018 7:00 pm Steven Marrocco and John Morgan UFC 223 headliner Khabib Nurmagomedov believes featherweight champ Max Holloway has one competitive round in him. UFC April 5, 2018 6:00 pm Steven Marrocco The New York Police Department wants to question Conor McGregor after the UFC star attacked a bus carrying fighters today in Brooklyn. Videos April 5, 2018 5:45 pm MMAjunkie Staff Rose Namajunas shocked plenty when she knocked out Joanna Jedrzejczyk to win the womens strawweight title at UFC 217, but can she do it again? UFC April 5, 2018 5:30 pm Fernanda Prates, The Blue Corner Michael Chiesa can be heard asking if hes cut bad moment after Conor McGregor breaks a window by throwing a dolly. UFC April 5, 2018 5:15 pm Ben Fowlkes Will the UFC 223 main event really determine the worlds best lightweight, or is it just a fun backup plan with a shiny gold belt? All that and more in this weeks Twitter Mailbag. Thanks for signing up.You'll be waking up a little more awesome tomorrow. Something went wrong. Sign up for our newsletter and get every update delivered to your inbox. Thanks for signing up.You'll be waking up a little more awesome tomorrow. Something went wrong. Powered by WordPress.com VIP More Information]", "title": "UFC issues statement in wake of Conor McGregor bus attack, says consequences will follow  MMAjunkie", "urlToImage": "https://usatmmajunkie.files.wordpress.com/2017/10/conor-mcgregor-ufc-fight-night-118-5.jpg?w=1000&h=576&crop=1"}], "http://www.bbc.com/news/world-us-canada-43663447": [{"author": "https://www.facebook.com/bbcnews", "description": "Saudi Arabia’s Crown Prince Mohammed bin Salman was given a king’s welcome in Hollywood this week.", "publishedAt": "2018-04-05T22:18:00Z", "source": "Bbc.com", "text": "[, Share this with, Email, Facebook, Messenger, Messenger, Twitter, Pinterest, WhatsApp, LinkedIn, Copy this link, These are external links and will open in a new window, Saudi Arabia's Crown Prince Mohammed bin Salman was given a king's welcome in Hollywood this week. The conservative kingdom's plan to open up cinemas and Western entertainment after a 35-year ban had Hollywood's top executives jockeying to make deals with the billionaire crown prince. Mohammed bin Salman, or MBS as he's also known, dined at media mogul Rupert Murdoch's house along with studio heads and actor Dwayne The Rock Johnson. In a Facebook post about the dinner, The Rock said he was humbled to discover he has so many young fans in Saudi Arabia. I look forward to my first visit soon to Saudi Arabia, Johnson wrote. I'll be sure to bring my finest tequila to share with the his Royal Highness and family. Tequila and The Rock in Saudi Arabia? Alcohol is banned in Saudi Arabia and punishable by lashes. But the times they are a-changing. That's how it looked at the Four Seasons in Beverly Hills. The prince's vast entourage took over the entire hotel where everything from the music to the menus had a Saudi flare this week. They also hosted a summit there on the future of entertainment in Saudi Arabia. It was packed with hundreds of Hollywood insiders. While a handful of activists demonstrated throughout the prince's trip to protest the Saudi-led bombing of Yemen and the way women are treated in Saudi Arabia, Hollywood was shown a slick, modern version of the country ready for change under the direction of the 32-year-old crown prince. As a result, Saudis can expect to see some Hollywood blockbusters at a cinema near them soon. AMC, the biggest movie chain in the US, plans to open 30 cinemas in the kingdom - the first one later this month. Saudis can also expect to see Disney on Ice and Cirque du Soleil coming soon. Rick Licht, the CEO of Hero Ventures, attended the summit carrying Thor's hammer from the Avengers movie. His company is bringing the travelling theme park, The Marvel Experience, to Saudi Arabia before the end of the year. Our hosts today have been absolutely spectacular and I hope we're going to be able to do this for many years to come over there, Mr Licht said. In a slick promotional video, The General Entertainment Authority of Saudi Arabia used change as a theme - and highlighted the fact that nearly 70% of Saudi Arabia's 32 million people are under the age of 30. And they're hungry for entertainment. But not everyone was impressed with the royal treatment given to the Saudi delegation. Feminist peace activists from Code Pink demonstrated outside many of the prince's meetings to tell people about the Saudi-led bombing of Yemen, which has killed 10,000 people and displaced about two million other people. Outside the Rand Corporation, one protester carried a sign saying bin Salman is no Prince Charming. Many activists noted that Hollywood is already battling its own problems with sexism and it shouldn't be making deals with a country so restrictive to women. Oscar-nominated actress Shohreh Aghdashloo says she's hopeful the young prince could end the war in Yemen and help mend ties between Saudi Arabia and its most bitter enemy - her native Iran. Saudi Arabia and Iran are engaged in a rivalry for power and influence in the Middle East - and Yemen is home to the most destructive of their proxy wars. Hollywood loves princes and princesses. Hollywood creates princes and princesses, says Ms Aghdashloo. But I wish the prince would have started with Yemen and not Hollywood, she adds. Most probably Hollywood is probably overwhelmed with his presence because they know they can do a lot together with his power, with his money, with his ambition, she said over coffee at Jerry's Deli in Los Angeles. If he says that he is going to open theatres in Saudi Arabia and if he does so then we are halfway through. Bringing awareness to people will make them become more aware of their situation and be more willing to make their place a better world to live in. Art can save lives. Young Saudis in Los Angeles were also optimistic about the crown prince's modernisation. Women in the kingdom are now allowed to drive and some can now leave their home without a male chaperone. The country is also opening up to tourist visas - although women under 25 who want to travel to Saudi Arabia will require a male chaperone. At a technology event hosted by the prince's foundation, young Saudi women in LA said his reforms have already greatly changed their future. One student, who did not want to be identified, said no when asked if she wanted to see more rights for women in Saudi Arabia. It's already happened. Most of the things we want are already in place, she said. It's a great step for women. Driving, all the new regulations for women. It's a great opportunity for us. First Saudi cinemas in decades to reopen, Who is Saudi Crown Prince Mohammed. Moscow's UN ambassador accuses the UK of inventing a fake story over the Salisbury spy poisoning. ]", "title": "Saudi Prince Charming Mohammed bin Salman comes to Hollywood - BBC News", "urlToImage": "https://ichef-1.bbci.co.uk/news/1024/branded_news/34DC/production/_100723531_img_0611.jpg"}], "http://www.espn.com/mlb/story/_/id/23043677/new-york-mets-prospect-tim-tebow-makes-double-debut-binghamton-rumble-ponies": [{"author": null, "description": "Playing his first game in Double-A ball, New York Mets minor leaguer Tim Tebow hit a three-run homer on the first pitch he saw as a member of the Binghamton Rumble Ponies on Thursday night.", "publishedAt": "2018-04-05T23:58:35Z", "source": "Espn.com", "text": "[In his first at-bat with the Binghamton Rumble Ponies, Tim Tebow whacks a home run over the wall in right-center field. (0:26), BINGHAMTON, N.Y. -- Tim Tebow sure knows how to rise to the occasion. Playing his first game in Double-A ball, the New York Mets' unique minor leaguer hit a three-run homer on the first pitch he saw. The ex-football star drew a huge ovation after connecting on a frigid Thursday night for the Binghamton Rumble Ponies, who beat Portland 6-0 in their Eastern League opener. Editor's PicksPhils fans boo manager Kapler at home openerPhillies fans booed manager Gabe Kapler when he was introduced Thursday at the team's home opener. Kapler has been scrutinized for the management of his pitching staff, especially the bullpen.Bird's eye? Eagle lands on Mariners' PaxtonMariners starter James Paxton kept his cool when a bald eagle landed on his shoulder during the national anthem on Thursday at Target Field in Minneapolis. I'm not gonna outrun an eagle, so just thought, we'll see what happens, he said.Beltre passes Carew atop Latin-born hit listRangers third baseman Adrian Beltre, a native of the Dominican Republic, surpassed Rod Carew on Thursday to become the career leader in hits among Latin American-born players.2 Related, Phillies fans booed manager Gabe Kapler when he was introduced Thursday at the team's home opener. Kapler has been scrutinized for the management of his pitching staff, especially the bullpen. Mariners starter James Paxton kept his cool when a bald eagle landed on his shoulder during the national anthem on Thursday at Target Field in Minneapolis. I'm not gonna outrun an eagle, so just thought, we'll see what happens, he said. Rangers third baseman Adrian Beltre, a native of the Dominican Republic, surpassed Rod Carew on Thursday to become the career leader in hits among Latin American-born players. It's pretty special and it feels really good, a smiling Tebow said afterward. It's a great day and it was a fun day, but it's just one day. We've got to be focused on the next day. Tebow has made that impression before. He also homered last April in his first at-bat with the Class A Columbia Fireflies of the South Atlantic League. This time, the former Heisman Trophy winner at Florida and NFL quarterback sent a liner far over the fence down the right-field line as the announced crowd of 5,247 at NYSEG Stadium stood and cheered the 30-year-old outfielder. The lefty-swinging Tebow capped a five-run first inning against righty Teddy Stankiewicz, a second-round draft pick by Boston in 2013. The Sea Dogs are a Red Sox affiliate. Tebow finished 1 for 4. He grounded into a force play in the third inning, grounded out to shortstop in the fifth, and struck out swinging in the seventh. I'm trying to improve every single day, so to get off to a good start definitely gives you confidence, Tebow said. But baseball's a game where it's never too high, it's never too low. It's just one at-bat, just one pitch. You've got to stay focused. Tomorrow will be another day where I have to improve. I've got to get back in the cage and work ... on all the things that I've been working on to try to improve. The frigid temperatures sent many fans home after Tebow's third at-bat, apparently satisfied they got what they came to see. Jeff Kellam and wife Joan, regulars from nearby Owego, stayed put until the end. I was pretty cynical, he said. There was a picture in the paper this morning of Tim Tebow and two other unidentified players. I thought, this is going to be kind of hard for the rest of the guys. The guy that got a two-run homer (Peter Alonso) -- nobody's going to talk about that tomorrow. I just want to be fair to the other players that have worked their way here, maybe even harder than he has. Tebow's performance came far from the warmth of Florida where he became a household name on the gridiron. His Double-A debut came as snowflakes wafted through the evening air and temperatures hovered in the 30s. All of the field-level box seats at NYSEG Stadium were sold on the blustery night, and although plenty of seats were empty, Tebow's arrival lured Mets chief operating officer Jeff Wilpon north from New York City to take a closer look at the organization's most unusual prospect. He's another ballplayer. I understand all the excitement because it's Tim Tebow, Wilpon said. We look forward to having him perform and move up the system, which he's doing. That's why he's here -- moving up the chain. He did well last year in A ball. Now, he's got to prove himself here and probably have to go to Triple-A at some point. He's a hard worker. He'll do whatever he has to do to succeed. Tebow, who was not on the Mets' 40-man major league roster, was re-assigned to the Rumble Ponies after going 1 for 18 (.056) with 11 strikeouts in seven big league exhibition games. He was hampered by a left ankle sprain and had been used solely as a designated hitter or pinch hitter. Tebow started in left field against Portland and batted seventh. He was greeted with a nice round of applause at pregame introductions. The only glitch in his debut came when he ran into a chain-link fence chasing a fly ball in foul territory along the left field line in the third inning Thursday night, but he quickly shook it off. When Tebow batted in the fifth, he worked the count full and the crowd began to chant his last name before he grounded out. Any time you have support, our entire team is feeling really good, Tebow said. It's something our team really fed off. Tebow split last season, his first in the minor leagues, between a pair of Class A teams -- Columbia, and St. Lucie in the Florida State League. He hit a combined .226 with eight homers and 52 RBI in 126 games. Early in spring training, Mets general manager Sandy Alderson said he thought Tebow had the talent to make it to the big leagues. Alderson said the experiment wouldn't last forever, but he remained optimistic because Tebow had made meaningful progress. Joe Pochkar, a season ticket-holder from nearby Endwell, called Tebow's arrival a win-win for an area along New York's Southern Tier that's been among the slowest regions of the state to recover from the financial crash a decade ago. He works very hard at his craft, and his passion and work ethic rub off on other players, he said. It's more than just the ability. So he hits a buck seventy-five, if he gets all the other players with his passion and attitude and desire, it's fantastic. A lot of people rag on him for doing what he's doing. This guy's positive, he's a nice guy, good for the community, Pochkar said. He's 30. He took a long time off. Double-A separates the men from the boys. We'll see. Binghamton's unusual nickname comes from an area that bills itself as the Carousel Capital of the World. George F. Johnson of Endicott Johnson Shoe Co. fame donated several carousels to the area, and the ponies from a handful of carousels that still remain entertain kids today. We use cookies to offer an improved online experience. By clicking OK without changing your settings you are giving your consent to receive cookies.]", "title": "New York Mets prospect Tim Tebow makes Double-A debut with Binghamton Rumble Ponies", "urlToImage": "http://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2018%2F0405%2Fr352164_1296x729_16%2D9.jpg"}], "http://www.latimes.com/local/lanow/la-me-ln-earthquake-channel-islands-20180405-story.html": [{"author": "Joseph Serna, Rong-Gong Lin II", "description": "A magnitude 5.3 earthquake was recorded at the Channel Islands Thursday afternoon, the U.S. Geological Survey said.", "publishedAt": "2018-04-05T20:28:18Z", "source": "Latimes.com", "text": "[Southern California was rattled Thursday by a magnitude 5.3 earthquake that struck near the Channel Islands. The quake was the strongest in Southern California in several years, jangling some nerves but causing no major damage because it occurred offshore in the Pacific Ocean and not on land. The quake did cause some minor landslides and earth movement on Santa Cruz Island, which was close to the epicenter, and rattled a bald eagle whose livestreamed reaction to the temblor went viral. A 5.3 could be damaging if it was right under our feet, said John Vidale, director of the Southern California Earthquake Center at USC. It's right on the edge of being an earthquake that could be dangerous. It's a reminder that we need to be ready in the future. The temblor occurred just before 12:30 p.m. and was centered south of Santa Cruz Island. It was felt as far away as Bakersfield, Palmdale and the city of Orange, according to witnesses and the U.S. Geological Survey. Earthquake early-warning system gave heads-up before 5.3 magnitude temblor hit L.A. area The L.A. area feels an earthquake of this magnitude on average about once a year, Vidale said. There is a 1-in-20 chance that Thursday's quake will lead to a larger one in the next few weeks, he said. But, more than likely, smaller aftershocks that may not even be felt will follow, he said. The quake was too small and too far away from the coast to trigger any tsunami concerns. It would never make a wave that you could see, Vidale said. But it was large enough to activate the state's developing earthquake early-warning system. Vidale said he and colleagues at USC heard beeping 10 to 15 seconds before the quake's shaking reached their campus. We all felt it pretty well. It was small and distinct, he said. We heard the warning go off and then we heard the shaking. The early-warning system is under development by the USGS and is available only to a limited array of testers, but it is expected that more people will be eligible to test the system later this year. It works on a simple principle: The shaking from an earthquake travels at the speed of sound through rock which is slower than the speed of today's communications systems. For example, it would take more than a minute for a magnitude 7.8 earthquake that starts at the Salton Sea and travels up the state's longest fault, the San Andreas, to shake Los Angeles, 150 miles away. An early-warning system would give L.A. residents crucial seconds, and perhaps even more than a minute, to prepare. It got a significant boost in the federal budget signed into law in March, defying an earlier proposal by President Trump to end federal funding for the program. As part of the $1.3-trillion budget bill approved by Congress and signed by Trump, officials approved $22.9 million for the project. That more than doubles the $10.2 million it got in the previous year's budget. The USGS has said it planned to begin issuing limited public alerts from the system by the end of this year, as long as funding wasn't cut. Southern California is one area where the network of seismic sensors is dense enough at present to begin early warnings. That was the first earthquake Ive felt since I got access to the @EarlyWarningLab beta app. I had 34 seconds warningenough time to drop, cover, and hold on, which I would have done if I knew shaking was going to be strong. pic.twitter.com/Bx4Sn2imUW, Earthquake that rattled L.A. area was strongest in years The temblor was located near the East Santa Cruz Basin fault zone, said Caltech seismologist Egill Hauksson, and seismologist Lucy Jones said on Twitter that the fault system moves Southern California around a bend of the San Andreas fault. Earthquakes happen out there now and again. There's a major offshore fault system, Hauksson said. When asked why some people felt the earthquake but others nearby didn't, Hauksson said where a person is matters a lot. People in high rises probably felt it pretty well, he said. People on softer soils might also feel stronger shaking. Among those creatures startled by the quake were the feathered inhabitants of a bald eagle's nest high above Santa Cruz Island. A National Park Service live web camera trained on the nest shows a parent eagle and three chicks as their tree begins shaking. The parent flies off as the chicks look around bewildered. The parent eagle returns moments later, after the shaking. WATCH: Eagle and chicks on Santa Cruz Island react to 5.3 Channel Islands earthquake https://t.co/Tm7D67mSgP pic.twitter.com/AwvVf6823b, The last quake to be felt this widely in the L.A. area was a magnitude 4.4 in Encino in 2014. That quake also shook a wide area and was the largest in the Los Angeles area in four years. It was noted by seismologists as the strongest to hit directly under the Santa Monica Mountains in 80 years. The last time an area earthquake produced more energy than Thursday's temblor was in 2012, when a magnitude 5.4 earthquake struck the border town of Brawley in Imperial County. Local officials reported 20 mobile homes shifted from their foundations and cosmetic damage to downtown buildings. The epicenter of Thursday's quake was south of the Channel Islands. A magnitude 4.8 quake in the same area rattled the region in 2013, but that epicenter was much closer to the coast, three miles away from Isla Vista, and produced moderate shaking, enough to knock down a few photo frames. A park service spokeswoman told KEYT that Thursday's quake sent some bricks toppling off a chimney from a historic ranch property built in the 1860s on one of the islands. The Santa Barbara area is home to a number of earthquake faults, the largest of which is the Santa Ynez fault, which is 80 miles long and runs just north of the city. That fault is believed to be capable of triggering an earthquake as powerful as magnitude 7.5. Get ready for a major quake. What to do before and during a big one The great Santa Barbara quake of 1925, recorded at a magnitude 6.8, destroyed much of the city's downtown on State Street, damaged rail lines, caused extensive landslides and was felt as far away as Orange County. It killed 13 people. Since the Easter Sunday earthquake of 2010 that hit along the California-Mexico border, there have been 14 earthquakes of magnitude 5 or greater in Southern California. Hauksson estimated that perhaps about half of them were felt in Los Angeles. Seismologist Lucy Jones said she received a complaint Thursday about her calling earthquake activity like this normal. Some people on Twitter asked her what the larger meaning was behind the earthquake. But there isn't any larger meaning nor a clue of when the next big earthquake will come or where it will hit, she said. There's a human need for creating patterns, Jones said. It doesn't make us safer or less safe. It's a reminder of our reality. Earthquake activity in the Channel Islands shouldn't be all that surprising. After all, earthquakes created the Channel Islands. In fact, mountains throughout California are generally creations of earthquakes, Jones said. Earthquakes pushed up the Santa Ynez Mountains in Santa Barbara and Ventura counties. The Santa Monica and Hollywood faults were responsible for creating the Santa Monica Mountains. The Sierra Madre fault is pushing up the San Gabriels. The Chino Hills were thrust upward by the Chino Hills fault. If you see mountains in California, that means something is moving up those mountains faster than erosion is wearing them down, Jones said in an interview. Basically, when you see mountains, think earthquakes in California. Staff writer James Queally contributed to this report. joseph.serna@latimes.com, Twitter: @JosephSerna, ron.lin@latimes.com, Twitter: @ronlin, UPDATES:, 6:10 p.m.: This article was updated with additional information about the early-warning system and seismic history. 3:50 p.m.: This article was updated with reports of a damaged chimney on a historic property near the quake epicenter. 3:15 p.m.: This article was updated with details on a bald eagle nest on Santa Cruz Island. 2:20 p.m.: This article was updated with reports that there was no damage in Los Angeles. 1:45 p.m.: This article was updated with comments from seismologists and the Los Angeles Fire Department. 1:05 p.m.: This article was updated with comments from John Vidale, director of the Southern California Earthquake Center, and information on past Southern California earthquakes. 12:50 p.m.: This article was updated with a comment from the Los Angeles Police Department. 12:40 p.m.: This article was updated with an upgrade to the quake's magnitude and comments from the Ventura County Sheriff's Office. This article was originally published at 12:35 p.m.]", "title": "Largest earthquake in several years shakes Southern California, causing landslides on Santa Cruz Island", "urlToImage": "http://www.latimes.com/resizer/WY86nKSPCr5zAw0ihD40jZEt5SA=/1200x0/www.trbimg.com/img-5ac690f1/turbine/la-me-ln-earthquake-channel-islands-20180405"}], "http://www.latimes.com/local/lanow/la-me-ln-ontario-explosion-20180405-story.html": [{"author": "Alene Tchekmedyian", "description": "A man detonated a small explosive device Thursday afternoon at a Sam’s Club in Ontario, authorities said.", "publishedAt": "2018-04-06T01:54:34Z", "source": "Latimes.com", "text": "[A man detonated a small explosive device at a Sam's Club in Ontario Thursday afternoon, triggering an evacuation, authorities said. When officers arrived at the store after reports of a fire, they saw the destructive device inside and a possible suspect fleeing in a vehicle, said Cpl. Eric Quinones with the Ontario Police Department. A witness pointed out the suspect later identified as Fontana resident Hugo Gonzalez, 49 to authorities. Officers tried to stop the man, but he refused to pull over. After a short pursuit, officers detained the man and are now working to determine his involvement in the explosion, Quinones said. Inside the man's car, investigators found materials similar to the bomb-making materials used in the store explosion, Quinones said. He did not have details on what led up to the explosion but said the man acted alone. Investigators are looking at an apartment linked to him on the16500 block of Arrow Boulevard in Fontana. No employees or customers were injured. alene.tchekmedyian@latimes.com, Twitter: @AleneTchek]", "title": "Suspect detonates small bomb at Ontario Sams Club, prompting evacuation", "urlToImage": "http://www.latimes.com/resizer/iYWmU2uLvUXNTa8zwBITcs6kvqo=/1200x0/www.trbimg.com/img-5ac6d344/turbine/la-me-ln-ontario-explosion-20180405"}], "https://abcnews.go.com/Technology/wireStory/latest-youtube-shooter-small-iran-54255597": [{"author": "ABC News", "description": "The Latest on a shooting at YouTube headquarters (all times local): 3 p.m. A California police department whose officers interacted with a woman hours before she shot three people at YouTube's headquarters is refusing to provide reports and body-camera video …", "publishedAt": "2018-04-05T22:06:00Z", "source": "ABC News", "text": "[, The Latest on a shooting at YouTube headquarters (all times local):, 3 p.m. A California police department whose officers interacted with a woman hours before she shot three people at YouTube's headquarters is refusing to provide reports and body-camera video from the encounter. The Mountain View Police Department denied a public records request from The Associated Press on Thursday involving Nasim Aghdam. Senior Deputy City Attorney Leslie Jensen cited an exception for records of ongoing law enforcement investigations but provided no explanation. Aghdam's father reported his daughter missing Monday and her name was entered into a national missing person's database. Officers in Mountain View found her sleeping in her car early Tuesday. Police said they spoke to her for about 20 minutes but she didn't appear to be a threat to herself or others. She opened fire later that day and then killed herself. 1:10 p.m. San Bruno police say the woman who shot three people at YouTube's headquarters before turning the gun on herself legally purchased a pistol from a dealer in San Diego in January. Commander Geoff Caldwell said he didn't know the total number of shots fired but said that Nasim Aghdam had swapped out a magazine and shot from the second magazine when she killed herself. He said police found two magazines at the scene and found no other weapons. He said the 9mm Smith &amp; Wesson handgun was legally purchased Jan. 16 and registered in her name. Police declined to name the firearm retailer or the local gun range where Aghdam practiced shooting before driving to YouTube Tuesday, citing the ongoing investigation. 12:10 p.m. Authorities say relatives of a woman who shot three people at YouTube's headquarters never indicated she was a risk to herself or others when they reported her missing a day before the attack. San Diego sheriff's Lt. Karen Stubkjaer says Thursday that Nasim Aghdam's father never told deputies that she was in any danger when they took a report from him Monday. She says Aghdam was entered into a national missing person's database. A deputy contacted the family several hours after the report was taken but they provided no additional information. Sheriff's officials declined to provide further details about what was reported. Aghdam's name was removed from the database after officers in Mountain View near San Francisco found her sleeping in her car early Tuesday. She opened fire later that day and then killed herself. 8:55 a.m. Authorities say the victim most seriously wounded in a shooting at YouTube headquarters is improving. Zuckerberg San Francisco General Hospital said Thursday that a 36-year-old man remains hospitalized but has been upgraded to fair condition. Three people were taken to the hospital with gunshot wounds. A 32-year-old woman and a 27-year-old woman were both released. Authorities say that Nasim Aghdam was angry about the policies and practices of the company and carried out an attack Tuesday at YouTube headquarters in San Bruno, south of San Francisco. She then fatally shot herself. 7:10 a.m. The woman who wounded three in a shooting at YouTube headquarters had a tiny social media presence in her native Iran, where her death was reported briefly by state television. Nasim Aghdam (na-SEEM AG-dahm) ran a Farsi-language channel on the messaging app Telegram, with content unlikely to be popular with the state or public. The channel has about 6,000 followers, which is small in a country where some 40 million people are believed to use the service. People in Iran expressed pity and shock that Aghdam, who was upset at what she called restrictive YouTube policies, would resort to shooting others. 12:05 a.m. Police say the videos posted by the woman who wounded three people in a shooting at YouTube headquarters are central to the motive. Police and relatives say Nasim Aghdam (na-SEEM AG-dahm) was angry with YouTube's policies. Aghdam used the name Nasime Sabz online, and a website in that name decried YouTube's policies and said the company was trying to suppress content creators. YouTube had no comment about any actions related to Aghdam's videos. Aghdam was prolific at producing videos and posting them online. Many of them were bizarre such as a clip in which she removes a revealing purple dress to expose fake breasts with the message, Don't Trust Your Eyes. In others, she exercises, promotes animal rights and explains the vegan diet, often in elaborate costumes or carrying a rabbit.]", "title": "The Latest Police wont release video of YouTube shooter - ABC News", "urlToImage": "https://s.abcnews.com/images/Technology/WireAP_a2bd07dc8c0b4feb9e46035d92e4a4d8_16x9_992.jpg"}], "https://nesn.com/2018/04/how-receiver-jordan-matthews-should-fit-into-patriots-starting-offense/": [{"author": "Doug Kyed", "description": "Stop us if you’ve heard this one before: The New England Patriots reportedly are buying low on a low-risk, high-reward free agent. This time it’s wide receiver Jordan Matthews, who&#821…", "publishedAt": "2018-04-06T01:11:00Z", "source": "Nesn.com", "text": "[Photo via Rich Barnes/USA TODAY Sports Images, Stop us if youve heard this one before: The New England Patriots reportedly are buying low on a low-risk, high-reward free agent.This time its wide receiver Jordan Matthews, whos coming off an injury-riddled 25-catch, 282-yard, 1-touchdown season with the Buffalo Bills.That wasnt his M.O. in three seasons with the Philadelphia Eagles, however. Matthews, 25, caught 225 passes for 2,673 yards with 19 touchdowns in three seasons with the Eagles after being selected in the second round of the 2014 NFL Draft. He caught 65 percent of his targets in that time frame as he did most of his work out of the slot.Matthews lined up inside 73.1 percent of the time in 2017, 67.1 percent in 2016, 92.7 percent in 2015 and 92.4 percent in 2014. The Patriots typically prefer smaller slot players Matthews is 6-foot-3, 212 pounds but they also need a replacement for Danny Amendola.And while Matthews is bigger than Amendola, Edelman, Wes Welker and Troy Brown, he does have the quickness needed to work from inside. He ran a 4.46-second 40-yard dash coming out of Vanderbilt with a 6.95-second 3-cone and 4.18-second short shuttle.And the Patriots could choose to switch Matthews position, too. Hogan was a slot receiver before joining the Patriots. Brandon LaFell, another former big target in the Patriots offense, was a slot receiver with the Carolina Panthers before moving outside in New England. The Patriots traded outside receiver Brandin Cooks on Wednesday.Julian Edelman will take on the inside role in certain situations, but hes just as much a Z outside receiver as he is a slot. Chris Hogan will continue to man the X receiver role in the Patriots offense. The Patriots will hold a competition between Matthews, Cordarrelle Patterson, Phillip Dorsett, Kenny Britt, Malcolm Mitchell, Riley McCarron and Cody Hollister for the No. 3 role behind Edelman and Hogan. What role Edelman plays in three-receiver sets will be dictated by who wins that competition.Matthews immediately becomes the odds-on favorite to win it based on his skill and experience. Mitchell is coming off a lost season due to knee injuries, Dorsett never fully caught on in 2017, Britt is a bit of wildcard and Patterson has been a role player on offense throughout his pro career. McCarron and Hollister were on the practice squad last season. The Patriots were smart to add another receiver into the competition given the lack of certainty behind Edelman, whos coming off a torn ACL, and Hogan, who also dealt with injuries last season.Matthews is no lock to regain his 2014 through 2016 form. He had knee, ankle and thumb injuries himself in 2017. But he provides tons of upside and could even enter the conversation to replace Hogan as the Patriots No. 2 with a solid training camp.Matthews isnt Cooks. He doesnt have his deep speed or playmaking ability, but hes a receiver who fits the Patriots offense. The Patriots have had success bringing in bigger slot receivers and having them line up all over the offense. And Matthews comes in with a better pedigree than Hogan or LaFell.Share this:Share on Facebook (Opens in new window)Click to share on Twitter (Opens in new window)Click to share on WhatsApp (Opens in new window)Click to share on Reddit (Opens in new window)Click to email (Opens in new window)Have a question for Doug Kyed? Send it to him via Twitter at @DougKyed. (function() { var zergnet = document.createElement('script'); zergnet.type = 'text/javascript'; zergnet.async = true; zergnet.src = (document.location.protocol == https: ? https: : http:) + \\/\\/www.zergnet.com\\/zerg.js?id=59884; var znscr = document.getElementsByTagName('script')[0]; znscr.parentNode.insertBefore(zergnet, znscr); })();.widget.widget_media_image { overflow: hidden; }.widget.widget_media_image img { height: auto; max-width: 100%; } TMZDana White Says Conor McGregor Is 'Going to Jail,' Fighting Future in JeopardyJeremy Lane DUI Video Shows NFL Player Yelling In Pain Steve Aoki's Nuts Get Slapped By UFC Legend Ken ShamrockConor McGregor Injures UFC Fighter In Bus Attack, Warrant Out for His ArrestLonzo Ball Says Girlfriend Denise Garcia is Having a Baby Girlgoogletag.cmd.push(function() { googletag.display( gpt-ad-desktop-rect-mid-1 ); }); (adsbygoogle = window.adsbygoogle || []).push({}); This time its wide receiver Jordan Matthews, whos coming off an injury-riddled 25-catch, 282-yard, 1-touchdown season with the Buffalo Bills.That wasnt his M.O. in three seasons with the Philadelphia Eagles, however. Matthews, 25, caught 225 passes for 2,673 yards with 19 touchdowns in three seasons with the Eagles after being selected in the second round of the 2014 NFL Draft. He caught 65 percent of his targets in that time frame as he did most of his work out of the slot.Matthews lined up inside 73.1 percent of the time in 2017, 67.1 percent in 2016, 92.7 percent in 2015 and 92.4 percent in 2014. The Patriots typically prefer smaller slot players Matthews is 6-foot-3, 212 pounds but they also need a replacement for Danny Amendola.And while Matthews is bigger than Amendola, Edelman, Wes Welker and Troy Brown, he does have the quickness needed to work from inside. He ran a 4.46-second 40-yard dash coming out of Vanderbilt with a 6.95-second 3-cone and 4.18-second short shuttle.And the Patriots could choose to switch Matthews position, too. Hogan was a slot receiver before joining the Patriots. Brandon LaFell, another former big target in the Patriots offense, was a slot receiver with the Carolina Panthers before moving outside in New England. The Patriots traded outside receiver Brandin Cooks on Wednesday.Julian Edelman will take on the inside role in certain situations, but hes just as much a Z outside receiver as he is a slot. Chris Hogan will continue to man the X receiver role in the Patriots offense. The Patriots will hold a competition between Matthews, Cordarrelle Patterson, Phillip Dorsett, Kenny Britt, Malcolm Mitchell, Riley McCarron and Cody Hollister for the No. 3 role behind Edelman and Hogan. What role Edelman plays in three-receiver sets will be dictated by who wins that competition.Matthews immediately becomes the odds-on favorite to win it based on his skill and experience. Mitchell is coming off a lost season due to knee injuries, Dorsett never fully caught on in 2017, Britt is a bit of wildcard and Patterson has been a role player on offense throughout his pro career. McCarron and Hollister were on the practice squad last season. The Patriots were smart to add another receiver into the competition given the lack of certainty behind Edelman, whos coming off a torn ACL, and Hogan, who also dealt with injuries last season.Matthews is no lock to regain his 2014 through 2016 form. He had knee, ankle and thumb injuries himself in 2017. But he provides tons of upside and could even enter the conversation to replace Hogan as the Patriots No. 2 with a solid training camp.Matthews isnt Cooks. He doesnt have his deep speed or playmaking ability, but hes a receiver who fits the Patriots offense. The Patriots have had success bringing in bigger slot receivers and having them line up all over the offense. And Matthews comes in with a better pedigree than Hogan or LaFell.Share this:Share on Facebook (Opens in new window)Click to share on Twitter (Opens in new window)Click to share on WhatsApp (Opens in new window)Click to share on Reddit (Opens in new window)Click to email (Opens in new window)Have a question for Doug Kyed? Send it to him via Twitter at @DougKyed. (function() { var zergnet = document.createElement('script'); zergnet.type = 'text/javascript'; zergnet.async = true; zergnet.src = (document.location.protocol == https: ? https: : http:) + \\/\\/www.zergnet.com\\/zerg.js?id=59884; var znscr = document.getElementsByTagName('script')[0]; znscr.parentNode.insertBefore(zergnet, znscr); })();.widget.widget_media_image { overflow: hidden; }.widget.widget_media_image img { height: auto; max-width: 100%; } TMZDana White Says Conor McGregor Is 'Going to Jail,' Fighting Future in JeopardyJeremy Lane DUI Video Shows NFL Player Yelling In Pain Steve Aoki's Nuts Get Slapped By UFC Legend Ken ShamrockConor McGregor Injures UFC Fighter In Bus Attack, Warrant Out for His ArrestLonzo Ball Says Girlfriend Denise Garcia is Having a Baby Girlgoogletag.cmd.push(function() { googletag.display( gpt-ad-desktop-rect-mid-1 ); }); (adsbygoogle = window.adsbygoogle || []).push({}); That wasnt his M.O. in three seasons with the Philadelphia Eagles, however. Matthews, 25, caught 225 passes for 2,673 yards with 19 touchdowns in three seasons with the Eagles after being selected in the second round of the 2014 NFL Draft. He caught 65 percent of his targets in that time frame as he did most of his work out of the slot.Matthews lined up inside 73.1 percent of the time in 2017, 67.1 percent in 2016, 92.7 percent in 2015 and 92.4 percent in 2014. The Patriots typically prefer smaller slot players Matthews is 6-foot-3, 212 pounds but they also need a replacement for Danny Amendola.And while Matthews is bigger than Amendola, Edelman, Wes Welker and Troy Brown, he does have the quickness needed to work from inside. He ran a 4.46-second 40-yard dash coming out of Vanderbilt with a 6.95-second 3-cone and 4.18-second short shuttle.And the Patriots could choose to switch Matthews position, too. Hogan was a slot receiver before joining the Patriots. Brandon LaFell, another former big target in the Patriots offense, was a slot receiver with the Carolina Panthers before moving outside in New England. The Patriots traded outside receiver Brandin Cooks on Wednesday.Julian Edelman will take on the inside role in certain situations, but hes just as much a Z outside receiver as he is a slot. Chris Hogan will continue to man the X receiver role in the Patriots offense. The Patriots will hold a competition between Matthews, Cordarrelle Patterson, Phillip Dorsett, Kenny Britt, Malcolm Mitchell, Riley McCarron and Cody Hollister for the No. 3 role behind Edelman and Hogan. What role Edelman plays in three-receiver sets will be dictated by who wins that competition.Matthews immediately becomes the odds-on favorite to win it based on his skill and experience. Mitchell is coming off a lost season due to knee injuries, Dorsett never fully caught on in 2017, Britt is a bit of wildcard and Patterson has been a role player on offense throughout his pro career. McCarron and Hollister were on the practice squad last season. The Patriots were smart to add another receiver into the competition given the lack of certainty behind Edelman, whos coming off a torn ACL, and Hogan, who also dealt with injuries last season.Matthews is no lock to regain his 2014 through 2016 form. He had knee, ankle and thumb injuries himself in 2017. But he provides tons of upside and could even enter the conversation to replace Hogan as the Patriots No. 2 with a solid training camp.Matthews isnt Cooks. He doesnt have his deep speed or playmaking ability, but hes a receiver who fits the Patriots offense. The Patriots have had success bringing in bigger slot receivers and having them line up all over the offense. And Matthews comes in with a better pedigree than Hogan or LaFell.Share this:Share on Facebook (Opens in new window)Click to share on Twitter (Opens in new window)Click to share on WhatsApp (Opens in new window)Click to share on Reddit (Opens in new window)Click to email (Opens in new window)Have a question for Doug Kyed? Send it to him via Twitter at @DougKyed. (function() { var zergnet = document.createElement('script'); zergnet.type = 'text/javascript'; zergnet.async = true; zergnet.src = (document.location.protocol == https: ? https: : http:) + \\/\\/www.zergnet.com\\/zerg.js?id=59884; var znscr = document.getElementsByTagName('script')[0]; znscr.parentNode.insertBefore(zergnet, znscr); })();.widget.widget_media_image { overflow: hidden; }.widget.widget_media_image img { height: auto; max-width: 100%; } TMZDana White Says Conor McGregor Is 'Going to Jail,' Fighting Future in JeopardyJeremy Lane DUI Video Shows NFL Player Yelling In Pain Steve Aoki's Nuts Get Slapped By UFC Legend Ken ShamrockConor McGregor Injures UFC Fighter In Bus Attack, Warrant Out for His ArrestLonzo Ball Says Girlfriend Denise Garcia is Having a Baby Girlgoogletag.cmd.push(function() { googletag.display( gpt-ad-desktop-rect-mid-1 ); }); (adsbygoogle = window.adsbygoogle || []).push({}); Matthews lined up inside 73.1 percent of the time in 2017, 67.1 percent in 2016, 92.7 percent in 2015 and 92.4 percent in 2014. The Patriots typically prefer smaller slot players Matthews is 6-foot-3, 212 pounds but they also need a replacement for Danny Amendola.And while Matthews is bigger than Amendola, Edelman, Wes Welker and Troy Brown, he does have the quickness needed to work from inside. He ran a 4.46-second 40-yard dash coming out of Vanderbilt with a 6.95-second 3-cone and 4.18-second short shuttle.And the Patriots could choose to switch Matthews position, too. Hogan was a slot receiver before joining the Patriots. Brandon LaFell, another former big target in the Patriots offense, was a slot receiver with the Carolina Panthers before moving outside in New England. The Patriots traded outside receiver Brandin Cooks on Wednesday.Julian Edelman will take on the inside role in certain situations, but hes just as much a Z outside receiver as he is a slot. Chris Hogan will continue to man the X receiver role in the Patriots offense. The Patriots will hold a competition between Matthews, Cordarrelle Patterson, Phillip Dorsett, Kenny Britt, Malcolm Mitchell, Riley McCarron and Cody Hollister for the No. 3 role behind Edelman and Hogan. What role Edelman plays in three-receiver sets will be dictated by who wins that competition.Matthews immediately becomes the odds-on favorite to win it based on his skill and experience. Mitchell is coming off a lost season due to knee injuries, Dorsett never fully caught on in 2017, Britt is a bit of wildcard and Patterson has been a role player on offense throughout his pro career. McCarron and Hollister were on the practice squad last season. The Patriots were smart to add another receiver into the competition given the lack of certainty behind Edelman, whos coming off a torn ACL, and Hogan, who also dealt with injuries last season.Matthews is no lock to regain his 2014 through 2016 form. He had knee, ankle and thumb injuries himself in 2017. But he provides tons of upside and could even enter the conversation to replace Hogan as the Patriots No. 2 with a solid training camp.Matthews isnt Cooks. He doesnt have his deep speed or playmaking ability, but hes a receiver who fits the Patriots offense. The Patriots have had success bringing in bigger slot receivers and having them line up all over the offense. And Matthews comes in with a better pedigree than Hogan or LaFell.Share this:Share on Facebook (Opens in new window)Click to share on Twitter (Opens in new window)Click to share on WhatsApp (Opens in new window)Click to share on Reddit (Opens in new window)Click to email (Opens in new window)Have a question for Doug Kyed? Send it to him via Twitter at @DougKyed. (function() { var zergnet = document.createElement('script'); zergnet.type = 'text/javascript'; zergnet.async = true; zergnet.src = (document.location.protocol == https: ? https: : http:) + \\/\\/www.zergnet.com\\/zerg.js?id=59884; var znscr = document.getElementsByTagName('script')[0]; znscr.parentNode.insertBefore(zergnet, znscr); })();.widget.widget_media_image { overflow: hidden; }.widget.widget_media_image img { height: auto; max-width: 100%; } TMZDana White Says Conor McGregor Is 'Going to Jail,' Fighting Future in JeopardyJeremy Lane DUI Video Shows NFL Player Yelling In Pain Steve Aoki's Nuts Get Slapped By UFC Legend Ken ShamrockConor McGregor Injures UFC Fighter In Bus Attack, Warrant Out for His ArrestLonzo Ball Says Girlfriend Denise Garcia is Having a Baby Girlgoogletag.cmd.push(function() { googletag.display( gpt-ad-desktop-rect-mid-1 ); }); (adsbygoogle = window.adsbygoogle || []).push({}); And while Matthews is bigger than Amendola, Edelman, Wes Welker and Troy Brown, he does have the quickness needed to work from inside. He ran a 4.46-second 40-yard dash coming out of Vanderbilt with a 6.95-second 3-cone and 4.18-second short shuttle. And the Patriots could choose to switch Matthews position, too. Hogan was a slot receiver before joining the Patriots. Brandon LaFell, another former big target in the Patriots offense, was a slot receiver with the Carolina Panthers before moving outside in New England. The Patriots traded outside receiver Brandin Cooks on Wednesday.Julian Edelman will take on the inside role in certain situations, but hes just as much a Z outside receiver as he is a slot. Chris Hogan will continue to man the X receiver role in the Patriots offense. The Patriots will hold a competition between Matthews, Cordarrelle Patterson, Phillip Dorsett, Kenny Britt, Malcolm Mitchell, Riley McCarron and Cody Hollister for the No. 3 role behind Edelman and Hogan. What role Edelman plays in three-receiver sets will be dictated by who wins that competition.Matthews immediately becomes the odds-on favorite to win it based on his skill and experience. Mitchell is coming off a lost season due to knee injuries, Dorsett never fully caught on in 2017, Britt is a bit of wildcard and Patterson has been a role player on offense throughout his pro career. McCarron and Hollister were on the practice squad last season. The Patriots were smart to add another receiver into the competition given the lack of certainty behind Edelman, whos coming off a torn ACL, and Hogan, who also dealt with injuries last season.Matthews is no lock to regain his 2014 through 2016 form. He had knee, ankle and thumb injuries himself in 2017. But he provides tons of upside and could even enter the conversation to replace Hogan as the Patriots No. 2 with a solid training camp.Matthews isnt Cooks. He doesnt have his deep speed or playmaking ability, but hes a receiver who fits the Patriots offense. The Patriots have had success bringing in bigger slot receivers and having them line up all over the offense. And Matthews comes in with a better pedigree than Hogan or LaFell.Share this:Share on Facebook (Opens in new window)Click to share on Twitter (Opens in new window)Click to share on WhatsApp (Opens in new window)Click to share on Reddit (Opens in new window)Click to email (Opens in new window)Have a question for Doug Kyed? Send it to him via Twitter at @DougKyed. (function() { var zergnet = document.createElement('script'); zergnet.type = 'text/javascript'; zergnet.async = true; zergnet.src = (document.location.protocol == https: ? https: : http:) + \\/\\/www.zergnet.com\\/zerg.js?id=59884; var znscr = document.getElementsByTagName('script')[0]; znscr.parentNode.insertBefore(zergnet, znscr); })();.widget.widget_media_image { overflow: hidden; }.widget.widget_media_image img { height: auto; max-width: 100%; } TMZDana White Says Conor McGregor Is 'Going to Jail,' Fighting Future in JeopardyJeremy Lane DUI Video Shows NFL Player Yelling In Pain Steve Aoki's Nuts Get Slapped By UFC Legend Ken ShamrockConor McGregor Injures UFC Fighter In Bus Attack, Warrant Out for His ArrestLonzo Ball Says Girlfriend Denise Garcia is Having a Baby Girlgoogletag.cmd.push(function() { googletag.display( gpt-ad-desktop-rect-mid-1 ); }); (adsbygoogle = window.adsbygoogle || []).push({}); Julian Edelman will take on the inside role in certain situations, but hes just as much a Z outside receiver as he is a slot. Chris Hogan will continue to man the X receiver role in the Patriots offense. The Patriots will hold a competition between Matthews, Cordarrelle Patterson, Phillip Dorsett, Kenny Britt, Malcolm Mitchell, Riley McCarron and Cody Hollister for the No. 3 role behind Edelman and Hogan. What role Edelman plays in three-receiver sets will be dictated by who wins that competition.Matthews immediately becomes the odds-on favorite to win it based on his skill and experience. Mitchell is coming off a lost season due to knee injuries, Dorsett never fully caught on in 2017, Britt is a bit of wildcard and Patterson has been a role player on offense throughout his pro career. McCarron and Hollister were on the practice squad last season. The Patriots were smart to add another receiver into the competition given the lack of certainty behind Edelman, whos coming off a torn ACL, and Hogan, who also dealt with injuries last season.Matthews is no lock to regain his 2014 through 2016 form. He had knee, ankle and thumb injuries himself in 2017. But he provides tons of upside and could even enter the conversation to replace Hogan as the Patriots No. 2 with a solid training camp.Matthews isnt Cooks. He doesnt have his deep speed or playmaking ability, but hes a receiver who fits the Patriots offense. The Patriots have had success bringing in bigger slot receivers and having them line up all over the offense. And Matthews comes in with a better pedigree than Hogan or LaFell.Share this:Share on Facebook (Opens in new window)Click to share on Twitter (Opens in new window)Click to share on WhatsApp (Opens in new window)Click to share on Reddit (Opens in new window)Click to email (Opens in new window)Have a question for Doug Kyed? Send it to him via Twitter at @DougKyed. (function() { var zergnet = document.createElement('script'); zergnet.type = 'text/javascript'; zergnet.async = true; zergnet.src = (document.location.protocol == https: ? https: : http:) + \\/\\/www.zergnet.com\\/zerg.js?id=59884; var znscr = document.getElementsByTagName('script')[0]; znscr.parentNode.insertBefore(zergnet, znscr); })();.widget.widget_media_image { overflow: hidden; }.widget.widget_media_image img { height: auto; max-width: 100%; } TMZDana White Says Conor McGregor Is 'Going to Jail,' Fighting Future in JeopardyJeremy Lane DUI Video Shows NFL Player Yelling In Pain Steve Aoki's Nuts Get Slapped By UFC Legend Ken ShamrockConor McGregor Injures UFC Fighter In Bus Attack, Warrant Out for His ArrestLonzo Ball Says Girlfriend Denise Garcia is Having a Baby Girlgoogletag.cmd.push(function() { googletag.display( gpt-ad-desktop-rect-mid-1 ); }); (adsbygoogle = window.adsbygoogle || []).push({}); Matthews immediately becomes the odds-on favorite to win it based on his skill and experience. Mitchell is coming off a lost season due to knee injuries, Dorsett never fully caught on in 2017, Britt is a bit of wildcard and Patterson has been a role player on offense throughout his pro career. McCarron and Hollister were on the practice squad last season. The Patriots were smart to add another receiver into the competition given the lack of certainty behind Edelman, whos coming off a torn ACL, and Hogan, who also dealt with injuries last season.Matthews is no lock to regain his 2014 through 2016 form. He had knee, ankle and thumb injuries himself in 2017. But he provides tons of upside and could even enter the conversation to replace Hogan as the Patriots No. 2 with a solid training camp.Matthews isnt Cooks. He doesnt have his deep speed or playmaking ability, but hes a receiver who fits the Patriots offense. The Patriots have had success bringing in bigger slot receivers and having them line up all over the offense. And Matthews comes in with a better pedigree than Hogan or LaFell.Share this:Share on Facebook (Opens in new window)Click to share on Twitter (Opens in new window)Click to share on WhatsApp (Opens in new window)Click to share on Reddit (Opens in new window)Click to email (Opens in new window)Have a question for Doug Kyed? Send it to him via Twitter at @DougKyed. (function() { var zergnet = document.createElement('script'); zergnet.type = 'text/javascript'; zergnet.async = true; zergnet.src = (document.location.protocol == https: ? https: : http:) + \\/\\/www.zergnet.com\\/zerg.js?id=59884; var znscr = document.getElementsByTagName('script')[0]; znscr.parentNode.insertBefore(zergnet, znscr); })();.widget.widget_media_image { overflow: hidden; }.widget.widget_media_image img { height: auto; max-width: 100%; } TMZDana White Says Conor McGregor Is 'Going to Jail,' Fighting Future in JeopardyJeremy Lane DUI Video Shows NFL Player Yelling In Pain Steve Aoki's Nuts Get Slapped By UFC Legend Ken ShamrockConor McGregor Injures UFC Fighter In Bus Attack, Warrant Out for His ArrestLonzo Ball Says Girlfriend Denise Garcia is Having a Baby Girlgoogletag.cmd.push(function() { googletag.display( gpt-ad-desktop-rect-mid-1 ); }); (adsbygoogle = window.adsbygoogle || []).push({}); Matthews is no lock to regain his 2014 through 2016 form. He had knee, ankle and thumb injuries himself in 2017. But he provides tons of upside and could even enter the conversation to replace Hogan as the Patriots No. 2 with a solid training camp.Matthews isnt Cooks. He doesnt have his deep speed or playmaking ability, but hes a receiver who fits the Patriots offense. The Patriots have had success bringing in bigger slot receivers and having them line up all over the offense. And Matthews comes in with a better pedigree than Hogan or LaFell.Share this:Share on Facebook (Opens in new window)Click to share on Twitter (Opens in new window)Click to share on WhatsApp (Opens in new window)Click to share on Reddit (Opens in new window)Click to email (Opens in new window)Have a question for Doug Kyed? Send it to him via Twitter at @DougKyed. (function() { var zergnet = document.createElement('script'); zergnet.type = 'text/javascript'; zergnet.async = true; zergnet.src = (document.location.protocol == https: ? https: : http:) + \\/\\/www.zergnet.com\\/zerg.js?id=59884; var znscr = document.getElementsByTagName('script')[0]; znscr.parentNode.insertBefore(zergnet, znscr); })();.widget.widget_media_image { overflow: hidden; }.widget.widget_media_image img { height: auto; max-width: 100%; } TMZDana White Says Conor McGregor Is 'Going to Jail,' Fighting Future in JeopardyJeremy Lane DUI Video Shows NFL Player Yelling In Pain Steve Aoki's Nuts Get Slapped By UFC Legend Ken ShamrockConor McGregor Injures UFC Fighter In Bus Attack, Warrant Out for His ArrestLonzo Ball Says Girlfriend Denise Garcia is Having a Baby Girlgoogletag.cmd.push(function() { googletag.display( gpt-ad-desktop-rect-mid-1 ); }); (adsbygoogle = window.adsbygoogle || []).push({}); Matthews isnt Cooks. He doesnt have his deep speed or playmaking ability, but hes a receiver who fits the Patriots offense. The Patriots have had success bringing in bigger slot receivers and having them line up all over the offense. And Matthews comes in with a better pedigree than Hogan or LaFell.Share this:Share on Facebook (Opens in new window)Click to share on Twitter (Opens in new window)Click to share on WhatsApp (Opens in new window)Click to share on Reddit (Opens in new window)Click to email (Opens in new window)Have a question for Doug Kyed? Send it to him via Twitter at @DougKyed. (function() { var zergnet = document.createElement('script'); zergnet.type = 'text/javascript'; zergnet.async = true; zergnet.src = (document.location.protocol == https: ? https: : http:) + \\/\\/www.zergnet.com\\/zerg.js?id=59884; var znscr = document.getElementsByTagName('script')[0]; znscr.parentNode.insertBefore(zergnet, znscr); })();.widget.widget_media_image { overflow: hidden; }.widget.widget_media_image img { height: auto; max-width: 100%; } TMZDana White Says Conor McGregor Is 'Going to Jail,' Fighting Future in JeopardyJeremy Lane DUI Video Shows NFL Player Yelling In Pain Steve Aoki's Nuts Get Slapped By UFC Legend Ken ShamrockConor McGregor Injures UFC Fighter In Bus Attack, Warrant Out for His ArrestLonzo Ball Says Girlfriend Denise Garcia is Having a Baby Girlgoogletag.cmd.push(function() { googletag.display( gpt-ad-desktop-rect-mid-1 ); }); (adsbygoogle = window.adsbygoogle || []).push({}); Have a question for Doug Kyed? Send it to him via Twitter at @DougKyed. 2018 NESN, Powered by WordPress.com VIP, Partner of USATODAY Sports Digital Properties]", "title": "How Receiver Jordan Matthews Should Fit Into Patriots Starting Offense  New England Patriots  NESN.com", "urlToImage": "https://nesncom.files.wordpress.com/2018/04/jordan_matthews.jpg"}], "https://nypost.com/2018/04/05/trumps-greatest-danger-talking-to-mueller/": [{"author": "Rich Lowry", "description": "The chief threat to President Trump at the moment isn’t that he’ll fire Robert Mueller, but that he’ll cooperate too readily. The president’s legal team has been roiled and his White House advisers…", "publishedAt": "2018-04-05T23:39:00Z", "source": "Nypost.com", "text": "[Thanks for contacting us. We've received your submission. Opinion, By Rich Lowry, April 5, 2018 | 7:39pm| Updated April 5, 2018 | 8:44pm, The chief threat to President Trump at the moment isnt that hell fire Robert Mueller, but that hell cooperate too readily. The presidents legal team has been roiled and his White House advisers divided by his determination to sit down for a deposition with Muellers team of prosecutors. Rarely has someone who is supposed to be feeling the legal net closing in been so eager to run toward the netting. Trump lawyer John Dowd reportedly quit over the dispute, and he was right. Trump shouldnt walk into the same room with Mueller. He shouldnt say hello to him. He shouldnt follow him on Instagram or Twitter. He should treat him as an adversary who, even if he isnt conducting the witch hunt that Trump alleges, would certainly be happy to nail him for the slightest misstatement. Mueller was supposed to be conducting a counterintelligence investigation into Russian interference in the election, which immediately also became an investigation of obstruction of justice. The Washington Post reports that Mueller now plans to issue a report on obstruction before he finishes what was his original mission. Trumps attitude should be, Come and get me, copper if you have a case for obstruction, make it, but Im not incurring any additional legal jeopardy by sitting down and talking to you. Its not as though Mueller has been shut out. According to a January breakdown from Dowd, the special counsel has talked to 20 White House employees and received 20,000 pages of documents. In the past, Trump has been careful in his depositions, but since his mode of communication is highly dependent on jaw-dropping hyperbole, gross simplifications and misinformed or misleading assertions, it cant be a good idea to put him under oath. Trumps fearlessness and animal cunning are two of his signature traits, so it makes sense that he sincerely believes he can win the conversation with Muellers lawyers. It also runs counter to the widespread assertion that Trump is acting guilty, when he may well be acting like Donald Trump aggrieved, combative, scornful when hes innocent. How many guilty parties are so insistent on talking to authorities that they lose their lawyers over it. But this is a foolish confidence on Trumps part. Even more-deft talkers have realized the peril. Bill Clinton, a master of distinctions so subtle that sometimes only he understood them, resisted a subpoena in the Paula Jones case all the way to the Supreme Court, and for good reason. Perjury would probably be the closest Mueller could get absent some unforeseen smoking gun to a real unambiguous crime. So far, besides Paul Manafort and 13 Russians who will never see the inside of a courtroom, his operation has been about catching people in lies to the FBI. And with notable aggressiveness. The agents who talked to Michael Flynn didnt think he was being deliberately misleading. Muellers team disagreed and pinned Flynn to the wall. Theres no upside in talking to Mueller. Trump isnt going to explain away everything to his satisfaction such that the special counsel says, Never mind. Trump probably wont even speed up Muellers investigation. The special counsel presumably is trying to flip Manafort, and the second trial of the former Trump campaign manager (yes, he faces two) doesnt begin until September. The politics of resisting Mueller are probably insignificant. Trumps base is going to stick with him, and its doubtful that the Mueller investigation is much of a voting issue (anyone opposing Trump because of his conduct in the Mueller probe almost certainly already opposes him for other reasons). Not sitting down will inevitably cause a court fight over a subpoena. Success for Trump wouldnt be guaranteed, but he might win on the basis of executive privilege. To overcome such a claim, Mueller would need to show that Trumps testimony is necessary to the investigation of a crime, when Trump so far as we know hasnt bribed anyone or suborned perjury but simply exercised his lawful powers, e.g. fired the FBI director. Has he exercised those powers in a corrupt and abusive manner? If so, as David Rivkin and Lee Casey argue in The Wall Street Journal, thats a matter for the political process, specifically for Congress to consider under its impeachment power, rather than for the criminal justice system. When Muellers report becomes public in some form or other, Trump will have plenty of opportunity to forcefully rebut it in the court of public opinion. Until then, he shouldnt voluntarily subject himself to a process suited to create an impeachable offense where there wasnt one before. But what do I know? If Trumps going to throw caution to the wind, go all the way. Insist the deposition be broadcast on live TV for everyone to see for themselves and make up their minds in real time. And if it doesnt go well fire Mueller in front of the cameras from an impressive mahogany conference table. Would there be any more appropriate way for all this to end. Read Next, Beware: Cuomo's Penn Station power play is still a live th... Read Next, Beware: Cuomo's Penn Station power play is still a live th... Share Selection, 102,526, 100,287, 72,907, Post Digital Network, 2018 NYP Holdings, Inc. All Rights Reserved | Terms of Use | Privacy | Your Ad Choices | Sitemap, News Corp. is a network of leading companies in the world of diversified media, news, and information services. Get our top stories delivered to your inbox, By clicking above you agree to our Terms of Use and Privacy Policy. Don't miss out on our other great newsletters]", "title": "Trumps greatest danger Talking to Mueller", "urlToImage": "https://thenypost.files.wordpress.com/2018/04/trump-robert-mueller.jpg?quality=90&strip=all&w=1200"}], "https://sports.yahoo.com/sergio-garcia-tin-cup-moment-kept-hitting-good-shots-220531431.html": [{"author": null, "description": "The crowd was gasping in shock and then horror and then regaling each other with stories of having done the same thing that one time at some muni back home.", "publishedAt": "2018-04-05T22:19:36Z", "source": "Yahoo.com", "text": "[AUGUSTA, Ga. Sergio Garcia had gone from defending Masters champion to someone about to post a score that would cause shame for the lowliest of Sunday duffer. He was knocking shot after shot onto the green of the 15th hole here in the Masters only to see them spin back, sometimes swiftly, sometimes slowly, and roll back toward and into the front pond. One went in. Then another. Then another. Then another. Then another still. Five shots. Five in a row. Five Callaway Chrome Soft Xs finding a watery grave. Five in the drink by a major champion at a major championship. Four of Sergio Garcias five shots into the water. pic.twitter.com/NzAubcBZ7c, Nick Bromberg (@NickBromberg) April 5, 2018, I dont know, Garcia said after the round, where a 13 on No. 15 doomed him to a 9-over-par 81 and a lot of work to do to avoid missing the cut on Friday. I dont know what to tell you. Its one of those things. I felt like I hit a lot of good shots and unfortunately the ball just didnt want to stop. The crowd was gasping in shock and then horror and then regaling each other with stories of having done the same thing that one time at some muni back home. Garcia was going through golfing hell, but there was a kinship among the masses. Hes Tin Cupping it, one fan said, referencing the immortal Roy Tin Cup McAvoy of the 1995 movie (played by Kevin Costner) who, with a chance to win the U.S. Open, kept finding water and rather than smartly laying up kept shooting the same shot. He posted an unapologetic 12 to lose the tournament. It wasnt quite like that. Garcia wasnt being headstrong or using the wrong club. If anything, the shots were pretty good, each one finding the green with a pin up front only to roll off down the hill and into the water. Oh man, I just wanted one of those to stay up for him, said amateur Doc Redman, who was playing with him. That was pretty much everyones sentiment. That included the guys halfway back up the fairway, where the group behind Garcias was backed up, waiting and watching. Actually, only Bubba Watson was really watching. Jason Day was so focused on his game he wasnt paying attention, but as the delay went on, Watson approached Day. Bubba came up and told me [Garcia] was going for his 10th shot or something like that, Day said. Day looked like he didnt believe it but when the next shot hit the water and the crowd reacted as youd suspect it might, he started watching the train wreck. They didnt know how many had gone in. They didnt know the score. They didnt know if he was setting any records he would tie the highest score ever recorded on a hole at the Masters but fell short of John Dalys epic seven at the 2011 Australian Open. In the moment, no one knew much of anything. There was concern whether Garcia would run out of golf balls and what exactly that might mean. A DQ? Even the players werent sure. Actually, USGA rules state a player can borrow balls if needed, or the rules official will get you the type and brand you need. Still, that would have been embarrassing. It isnt known exactly how many balls Garcia had, but other golfers and caddies that were asked said its standard to bring 6-12 for a round, not just for water but in case they wear out. [I bring] anywhere from six to nine, Day said. He was probably getting close there. A pro golfers bag doesnt contain one of those golf ball retrievers, so fishing one back out would have been a challenge. There also isnt a collection of water balls at the bottom of the bag, waiting years to come out. Well, not normally. I bring a ton, Watson said. I had 13 balls in my bag today just in case something like that happens. Ill take the ones that hit off the cart path, well, they dont have cart paths here, but Ill take those and put them in the bag. Bubba Watson brings scuffed-up water balls with him. You always gotta have a water ball, Watson said. For Sergio, it didnt get to that. Although anything felt possible as the balls kept getting wet. The first shot was a 6-iron from 206 out that almost stuck. I thought it was perfect, Garcia said. Straight at the flag. I dont know, if it carries probably 2 more feet its probably good. And it probably carries a foot less, it probably doesnt go off the green and probably stays on the fringe. But unfortunately I flew it on the perfect spot for it to come back. From there, his penalty shots couldnt stay on the green. I kept hitting good shots with the sand wedge, Garcia said. The ball just wouldnt stop. The problem was the front pin, which rested atop a false front that drains into the pond. There was no good place to hit the ball. That false edge is pretty significant, Tiger Woods said. Its a very difficult pin. Tell it to Sergio, who came here looking to repeat as Masters champion and found himself the star of a golfing horror show. It may perfectly reflect his roller-coaster career champion one round, punch line the next. His 13 was even a conundrum for the people who run the hand-operated scoreboards here. They didnt have a 13 to post, so they made a new one by handwriting 13. Sergio just shrugged like Sergio does. He was sticking with his story that he played well and it just didnt work out. Its the first time in my career where I made a 13 without missing a shot, Garcia said. Tin Cup McAvoy couldnt have said it any better. More from Yahoo Sports: Player breaks up no-hitter by breaking unwritten rule Freakishly strong athlete has NFL teams attention Jeff Passan: Rockies stars deal shows how much MLB has changed ESPN cuts to commercial at worst possible time ]", "title": "Garcia struggles to explain five straight shots in water at Masters", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/uHuj8nl1Vp5Xvj2hBz2jEQ--~B/aD0yNzM3O3c9Mzk2NDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en/homerun/feed_manager_auto_publish_494/d3fc1c1235a42af6d6673bc9ce74390e"}], "https://www.cnn.com/2018/04/05/politics/epa-pruitt-staff-spending/index.html": [{"author": "Jeremy Diamond and Eli Watkins, CNN", "description": "Several Environmental Protection Agency officials were reassigned or demoted or themselves requested new positions after raising concerns about agency head Scott Pruitt, the New York Times reported Thursday.", "publishedAt": "2018-04-06T02:09:37Z", "source": "CNN", "text": "[By Jeremy Diamond and Eli Watkins, CNN, Updated 10:10 PM ET, Thu April 5, 2018 Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds. Washington (CNN)Multiple senior officials at the Environmental Protection Agency were sidelined or demoted after they pushed back on or raised concerns about Administrator Scott Pruitt's pricey travel, office spending and management of the agency, two sources with direct knowledge of the matter told CNN. CNN's Sophie Tatum contributed to this report.]", "title": "EPA officials jobs changed after raising concerns about Pruitt - CNNPolitics", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/180403112308-01-pruitt-12-07-2017-super-tease.jpg"}], "https://www.npr.org/sections/thetwo-way/2018/04/05/599711119/nyc-police-fatally-shoot-unarmed-black-man-believing-he-had-a-gun": [{"author": "James Doubek", "description": "Officers shot and killed Saheed Vassell, 34, after mistaking a pipe in his hand for a gun. On Thursday, after a wave of protest, police released materials showing the moments before the confrontation.", "publishedAt": "2018-04-05T23:17:24Z", "source": "Npr.org", "text": "[ James Doubek Colin Dwyer A resident pins the Jamaican national flag at a makeshift community memorial for Saheed Vassell on Thursday. Bebeto Matthews/AP hide caption, A resident pins the Jamaican national flag at a makeshift community memorial for Saheed Vassell on Thursday. Updated at 7:15 p.m. ET, Roughly one day after New York City police officers shot and killed a mentally ill black man the department has released video clips and transcripts of the 911 calls received in the moments leading up to the confrontation. The four officers had opened fire Wednesday afternoon on Saheed Vassell, 34, after mistaking a metal pipe in his hand for a firearm. In the video, pulled from security camera footage in Brooklyn's Crown Heights neighborhood, Vassell appears to pull the pipe on several passersby, pointing it at them in gestures reminiscent of aiming a handgun. The transcripts displayed show several callers referring to a possible gun in his hand. There's a guy walking around the street, reads one transcript, he looks like he's crazy but he's pointing something at people that looks like a gun and he's popping it as if like if he's pulling the trigger. Five officers responded to the calls around 4:40 p.m. NYPD Chief of Department Terence Monahan told reporters. Monahan said four of the officers opened fire after Vassell took a two-handed shooting stance and pointed an object at the approaching officers. Monahan said they fired 10 times, while Vassell was struck a total of nine times, according to New York City's chief medical examiner Thursday. It was only after Vassell hit the ground that police say they discovered he had been holding a metal pipe with a showerhead, not a weapon. In the hours after the shooting, anger and sadness swept through Crown Heights, the neighborhood where he spent most of his life and where residents say he was a well-known and well-liked figure. Man, that's our boy, David Bailey told NPR's Joel Rose. We know this man for like, ever since. He comes to hang out in the barbershop, you know what I mean. Bailey and others said Vassell's struggles with mental illness were also well-known, even among local police: It's visible. You could see it, Bailey added. Listen, Ray Charles could see that man was crazy. A makeshift memorial for Saheed Vassell, 34, stands Thursday in the lobby of the apartment building that neighbors identified as his father's residence. Joel Rose/NPR hide caption, A makeshift memorial for Saheed Vassell, 34, stands Thursday in the lobby of the apartment building that neighbors identified as his father's residence. Vassell's father, Eric, told The New York Times that his son had been hospitalized multiple times in recent years with bipolar disorder. In comments to the New York Daily News, he said his son had refused treatment and had not taken medication for the condition in years. We were always worried for him, he told the Daily News. We would say, 'Should anything happen to him, we just have to do what we can do.' Monahan, however, disputed the notion that officers could have known about Vassell's mental illness. This was not an emotionally disturbed call, he told reporters. That was a call of a man pointing what 911 callers and people felt was a gun at people on the street. When we encounter him, he turns with what appears to be a gun at the officers. An image of the pipe found at the scene of the police shooting, provided by the New York Police Department. New York Police Department hide caption, An image of the pipe found at the scene of the police shooting, provided by the New York Police Department. But some of Vassell's neighbors questioned why police fired so quickly and so many bullets. Witnesses told the Times that the officers appeared to fire almost immediately after they got to the scene, and that they did not hear the officers say anything to the man before firing, while another witness said she heard the officers and the man exchange some words. As many as 200 onlookers gathered at the scene immediately after the shooting, resident Shaya Tenenbaum told The Associated Press, and several of them shouted at police. Protesters carrying Black Lives Matter signs arrived later in the evening, the Times reports. Members of the crowd wept at how the shooting fell on the 50th anniversary of the Rev. Martin Luther King Jr.'s assassination. Vassell's death comes as the police shooting of Stephon Clark, an unarmed black man, has ignited protests in Sacramento, Calif. that have lasted weeks. They need to get it together, a longtime neighbor of Vassell's, named Angie Lewis, told Joel. Stop acting, responding before you find out more. I could see you shot him in his hand, his foot. Ten bullets for what. Residents told news outlets that the younger Vassell was well-known in the neighborhood as mentally ill but generally harmless. All he did was just walk around the neighborhood, 38-year-old Andre Wilson, who said he knew Vassell for 20 years, told the Daily News. He speaks to himself, usually he has an orange Bible or a rosary in his hand. He never had a problem with anyone. Scores of people gathered for a vigil and protest Thursday in Crown Heights, where local media report the rally rippled with chants of no justice, no peace. New York Attorney General Eric Schneiderman has announced his office is opening an investigation into the incident, noting that we're committed to conducting an independent, comprehensive, and fair investigation. Mayor Bill de Blasio called the shooting a tragedy in comments to the media. This is someone who had a profound mental health problem was not on medication, hadn't been on medication, de Blasio said. A man like this, if he had gotten the help we needed, hopefully would never have been in a situation where such a horrible painful, tragedy would have occurred. The Two-Way is the place to come for breaking news, analysis and for stories that are just too interesting or too entertaining to pass up. Get in touch with your questions, comments and leads. NPR thanks our sponsors, Become an NPR sponsor]", "title": "NYC Police Release Video, 911 Transcripts After Fatal Shooting Of Black Man  The Two-Way  NPR", "urlToImage": "https://media.npr.org/assets/img/2018/04/05/ap_18095707234746_wide-78ec6d3c8dda6d7dae810c8dd658d396b480ef7d.jpg?s=1400"}], "https://www.npr.org/sections/thetwo-way/2018/04/05/599846489/cdc-epidemiologist-found-dead-weeks-after-going-missing-drowning-suspected": [{"author": "Amy Held", "description": "The body of Timothy Cunningham was found in a rugged area near his Atlanta home that was difficult to access. While there were no signs of foul play, police say questions remain unanswered.", "publishedAt": "2018-04-05T22:11:00Z", "source": "Npr.org", "text": "[ Amy Held Police said the body of CDC epidemiologist Timothy Cunningham was found along the banks of an Atlanta river seven weeks after he vanished. Foul play is not suspected, but questions remain unanswered. Centers for Disease Control and Prevention hide caption, Timothy Cunningham, a 35-year-old epidemiologist at the Centers For Disease Control and Prevention, vanished after leaving work Feb. 12, complaining he felt unwell; some seven weeks later, his decomposed body was spotted by fishermen in a rugged area along the banks of the Atlanta area's Chattahoochee River, according to officials. We have no indication of foul play, Maj. Michael O'Connor with the Atlanta Police Department said at a press conference Thursday. Fulton County Medical Examiner Jan Gorniak said the cause of death is probably drowning. But tests, including a toxicology screening, are still pending. Gorniak added that the condition of Cunningham's body is consistent with having been in the water since the day he went missing and that there were no signs of trauma or underlying medical conditions. Officials said Cunningham's body was recovered Tuesday evening. Since his disappearance, Cunningham's friends, family and CDC co-workers had been questioned and a $10,000 reward offered. And yet many questions remain unanswered. Police do not know, for example, how Cunningham's body got onto the banks of the river. The area not far from Cunningham's home was inaccessible by walking, police said, noting they struggled to find a place to launch a boat to reach his remains. We do know that he was a jogger and he was wearing his favorite jogging shoes at the time that he was found, O'Connor said. I can't tell you that he was jogging, but those two things together seem to indicate that that's a possibility. O'Connor said three crystals were in his pocket for unknown reasons, although Cunningham was an avid rock collector. In the days after he went missing, Cunningham's case drew intense media scrutiny and speculation about what had happened in what police called unusual circumstances. On the morning he went missing, his supervisor at the CDC talked to him about why he had been passed over for a promotion, police said. When he left work later in the day, it was the last time he was known to have been seen alive. All of his belongings including wallet, keys and passport were found inside his Atlanta home. According to The New York Times, his family said that their last phone conversations with Cunningham had left them worried and that he sounded not like himself. By outward appearances, Cunningham seemed to have a successful career. He received his master's and doctoral degrees from Harvard's school of public health. The Times reports that Cunningham was promoted in July to commander in the uniformed United States Public Health Service. His CDC biography says he was a team lead with the Division of Population Health and had deployed for several public health emergencies including Superstorm Sandy, Ebola, and Zika. Last year, Cunningham was quoted in an NPR report about the death rate declining among black Americans. The major drivers of this are decreases in many of the leading causes of death, such as heart disease, cancer and stroke, Cunningham told NPR's Rob Stein. Cunningham stressed, however, that as a group, black Americans still have an overall life expectancy that is four years shorter than white Americans. Many younger African-Americans in their 20s, 30s and 40s are living and dying with chronic conditions that we more typically see in the older population, Cunningham told Stein. There's still work to do. On Thursday, O'Connor said the circumstances around Cunningham's own death may never be understood. Barring new information coming forward, we may never be able to tell you how he got into the river. The Two-Way is the place to come for breaking news, analysis and for stories that are just too interesting or too entertaining to pass up. Get in touch with your questions, comments and leads. NPR thanks our sponsors, Become an NPR sponsor]", "title": "CDC Epidemiologist Found Dead Weeks After Going Missing, Drowning Suspected  The Two-Way  NPR", "urlToImage": "https://media.npr.org/assets/img/2018/04/05/cunningham-225px_wide-2fa13d0e1399e63cc99b144070caaa02ee6b1e1c.jpg?s=1400"}], "https://www.nytimes.com/2018/04/05/business/trump-trade-war-china.html": [{"author": "Ana Swanson and Keith Bradsher", "description": "President Trump said he would consider imposing tariffs on an additional $100 billion worth of Chinese goods in retaliation for China’s plan to impose its own tariffs on American products.", "publishedAt": "2018-04-06T00:15:59Z", "source": "The New York Times", "text": "[Advertisement, By ANA SWANSON and KEITH BRADSHERAPRIL 5, 2018, WASHINGTON President Trump said Thursday that the United States would consider slapping an additional $100 billion in tariffs on the Chinese, escalating a potentially damaging trade dispute with Beijing. Mr. Trump said in a statement that he was responding to unfair retaliation by China, which published a list on Wednesday of $50 billion in American products that would be hit by tariffs, including soybeans and pork. That move was a direct reaction to the $50 billion in tariffs on Chinese goods that the White House detailed on Tuesday. Rather than remedy its misconduct, China has chosen to harm our farmers and manufacturers, Mr. Trump said, adding that he has instructed the United States trade representative to determine if another $100 billion in tariffs were warranted and, if so, to identify the products upon which to impose such tariffs. The announcement came one day after some of Mr. Trumps advisers tried to calm markets and tamp down fears of a trade war between the worlds two largest economies, saying that the tariff threats were the first step in a negotiation process. Mr. Trump said in his statement that the potential for new tariffs would not preclude discussions with the Chinese to protect the technology and intellectual property of American companies and American people, but any new tariffs are unlikely to make that already tough task easier. Advertisement, The move is a high-stakes gamble aimed at cowing China into backing down and forcing it to make the kinds of changes that the United States is seeking namely reducing the coercive tactics American officials say Beijing uses to try to dominate leading-edge industries like artificial intelligence, robotics and autonomous vehicles. But the move could ultimately bring about the kind of retaliation from Beijing that has spooked stock markets. Advertisement, It also means that the United States would be somewhat more likely to place levies on Chinese products that American households routinely purchase, like furniture, clothing or shoes an outcome the Trump administration said it sought to avoid with its initial round of tariffs. The presidents announcement was immediately criticized by manufacturers, retailers and politicians from states whose economies depend on agriculture. Senator Ben Sasse, Republican of Nebraska, said Mr. Trump was threatening to light American agriculture on fire. Hopefully the president is just blowing off steam again, but if hes even half-serious, this is nuts, Mr. Sasse said. Lets absolutely take on Chinese bad behavior, but with a plan that punishes them instead of us. This is the dumbest possible way to do this. A trade war could derail the current global economic expansion and cripple American businesses that depend on business with China. It could also further complicate geopolitical priorities given the Trump administration has enlisted the help of the Chinese in scheduling historic talks with North Korea next month. In a statement, Robert Lighthizer, the trade adviser who is carrying out an investigation into Chinese practices, described the presidents threat as an appropriate response, saying China should have responded to the initial tariffs levied by the United States by changing its behavior. In the first hint of the Chinese governments response to Mr. Trumps latest action, the Weibo miniblog of the official Xinhua news service said that this move severely violates world trade regulations. Advertisement, Zhu Guangyao, Chinas vice minister of finance, made clear at a news conference on Wednesday afternoon that his country would not back down easily. If anyone wants to fight, well be there with them. If he wants to negotiate, the door is open, Mr. Zhu said. Mr. Trumps effort to raise the stakes on Thursday seemed poised to send financial markets spinning, with futures on the Standard &amp; Poors 500-index down and the yen climbing against the dollar. American companies want a level playing field with their Chinese counterparts. China wants to build its industries into sophisticated global competitors. This week, both countries demonstrated a willingness to escalate trade tensions to defend their positions. Companies potentially caught in the middle of a trade war called on the Trump administration to back down and try to work with the Chinese. The announcement that the administration may issue $100 billion in additional tariffs on Chinese products is irresponsible and destabilizing, said Dean C. Garfield, the chief executive of the Information Technology Industry Council, which represents companies such as Amazon, Apple and IBM. We call on both sides to halt unproductive and escalatory rhetoric, recognizing that these words and actions have global consequences. China experts have questioned whether Mr. Trumps aggressive negotiating style will leave Chinese leaders with enough political room to make concessions to the Americans. Bowing to the presidents demands could be seen internally as weakness, and the changes that the administration wants reducing Chinas dominance in cutting-edge manufacturing and technology is not something Beijing is likely to agree to. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. View all New York Times newsletters. Wang Shouwen, Chinas vice minister of commerce, has repeatedly refused to discuss curbing the Made in China 2025 industrial plan. The Trump administration contends that the program violates international trade rules that prohibit countries from using subsidies to help exporters and discourage imports. Mr. Wang and other officials deny that the program is in violation, but have provided few details on how it might comply. Including this most recent action, the United States would be placing tariffs on a total of $153 billion of Chinese products. The threat of $100 billion in tariffs came on top of the tariffs on $3 billion in Chinese steel and aluminum that he imposed last month and the tariffs on a further $50 billion in Chinese goods that he has threatened to impose in recent days. The total is now so large that China would have trouble finding enough American goods to penalize if it sought to impose a proportional retaliation. China bought only $130.4 billion worth of American goods last year, while the United States bought $505.6 billion worth of Chinese goods. The National Retail Federation blasted the move as a dangerous game of chicken that would put the United States on the losing end of a trading relationship that has benefited American companies and consumers. Advertisement, This is what a trade war looks like, and what we have warned against from the start. We are on a dangerous downward spiral, and American families will be on the losing end, Matthew R. Shay, the president and chief executive of the retail group, said in a statement. We urge the administration to change course and stop playing a game of chicken with the nations economy. The Chinese have tools other than tariffs at their disposal, including limiting the operations of American banks and other service providers in China. The government could also urge the Chinese public not to buy American-brand cars like Chevrolets and Fords, even though those are built almost entirely from Chinese-made parts and assembled in factories in China. The biggest question would be whether China would start retaliating not commercially but through geopolitical actions. While Trump administration trade officials appear to have been operating with considerable autonomy from those responsible for issues like North Korea and Taiwan, policymaking is much more unified in China. That means China could try to raise the temperature in the dispute by installing more military equipment on the artificial islands that it has recently built across the South China Sea, almost to the shores of Indonesia, Malaysia and the Philippines. China could also step up pressure on Taiwan. Beijing leaders are already deeply upset about recent congressional approval of the Taiwan Travel Act, which urged Mr. Trump to send administration officials to the self-governing island. Beijing regards Taiwan as a breakaway province, and has threatened to use force to reunite it. Chinese experts have made clear that they perceive the ever-larger rounds of American tariffs as part of a broad American challenge that goes beyond dollars and cents. It is more than just a trade issue: It involves geopolitical reasons, Wu Xinbo, the chief of the Center for American Studies at Fudan University in Shanghai, said in an interview this week. Trump has mentioned before, if China doesnt agree on economy and trade, the U.S. will reconsider China issues that includes the South China Sea and Taiwan. President Xi Jinping of China is scheduled to give a major speech on Tuesday at the Boao Forum on Chinas Hainan island, which may give more clues to Chinas response. The speech has been billed by other Chinese officials as a moment when Mr. Xi would lay out a blueprint for Chinas economic overhaul and liberalization, a potential peace offering to the Trump administration, said Scott Kennedy, a China expert at the Center for Strategic and International Studies. President Trumps move may throw a small monkey wrench into Xis plans, Mr. Kennedy said. He may now need to couple such a proposal with the warning that China will continue to defend itself against foreign pressure. Ana Swanson reported from Washington, and Keith Bradsher from Shanghai. A version of this article appears in print on April 6, 2018, on Page A1 of the New York edition with the headline: Trump Escalates Fight With China In Tariff Threat. Order Reprints| Today's Paper|Subscribe, Were interested in your feedback on this page. Tell us what you think. Go to Home Page ]", "title": "Trump Doubles Down on Potential Trade War With China - The New York Times", "urlToImage": "https://static01.nyt.com/images/2018/04/06/us/politics/06dc-tariffs-TRUMP/merlin_136439370_4d6d9393-6437-42f3-939a-9689d035d2b6-facebookJumbo.jpg"}], "https://www.nytimes.com/2018/04/05/us/politics/trump-stormy-daniels-hush-money.html": [{"author": "Julie Hirschfeld Davis", "description": "In his first public remarks on the matter, President Trump told reporters that he knew nothing about the $130,000 paid to Stormy Daniels, remarks that could complicate his legal battle against her.", "publishedAt": "2018-04-06T01:09:45Z", "source": "The New York Times", "text": "[Advertisement, By JULIE HIRSCHFELD DAVISAPRIL 5, 2018, President Trump denied knowledge of a $130,000 payment to Stephanie Clifford, a pornographic film actress known as Stormy Daniels. It was the first time he commented publicly on the scandal. WASHINGTON President Trump denied on Thursday knowing of a $130,000 payment his lawyer made to a pornographic film actress who claims to have had a sexual encounter with him, an assertion that threatened to complicate his legal battle against her. Mr. Trump made his first public remarks about the matter aboard Air Force One as he returned to Washington from White Sulphur Springs, W.Va. where he had held a round table on tax cuts. Asked by a reporter if he knew about the payment to the actress, Stormy Daniels, whose given name is Stephanie Clifford, he said, No. Asked why Michael D. Cohen, his personal lawyer, had made the payment, Mr. Trump said: Youll have to ask Michael Cohen. Michael is my attorney, and youll have to ask Michael Cohen. The president said he did not know where the money had come from, and ignored a question about whether he ever set up a fund Mr. Cohen could draw from. Advertisement, Ms. Clifford has said that she was paid $130,000 before the 2016 election to buy her silence. She is now suing Mr. Trump to abrogate a nondisclosure agreement that was supposed to prevent her from discussing the relationship. She claims the agreement is null and void because Mr. Trump never signed it. Advertisement, The presidents comments on Thursday could create a predicament for him and his legal team. Ms. Cliffords case is based on the notion that the confidentiality agreement is invalid because Mr. Trump was not a party to it. By saying he was not aware of the agreement, Mr. Trump appeared to confirm that argument, which would mean neither party is legally bound by it, thus potentially paving the way for Ms. Clifford to break her silence without consequences. Ms. Cliffords pugnacious lawyer, Michael J. Avenatti, quickly issued a statement to respond to Mr. Trumps claim. He said that the presidents professed ignorance of the payment would improve his clients case, suggesting that he would use legal discovery to expose the back and forth around the payment. Our case just got that much better, Mr. Avenatti said in the statement. We very much look forward to testing the truthfulness of Mr. Trumps feigned lack of knowledge concerning the $130,000 as he stated on Air Force One. As history teaches us, it is one thing to deceive the press and quite another to do so under oath, he added. Later, Mr. Avenatti appeared to exult on Twitter about what he suggested were undisciplined comments by Mr. Trump that would give Ms. Clifford the upper hand in the legal dispute. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. View all New York Times newsletters. Good (actually GREAT) things come to those who wait!!! Mr. Avenatti wrote. The strength of our case just went up exponentially. You cant have an agreement when one party claims to know nothing about it. #nodiscipline. Mr. Cohen did not respond on Thursday to requests for comment. Charles Harder, a lawyer representing Mr. Trump in his legal wrangling with Ms. Clifford, also did not respond to requests for comment on the presidents remarks and how they could affect his case. Mr. Trump and a company affiliated with him filed papers in court on Monday seeking to force Ms. Clifford to raise her disputes through private arbitration, not lawsuits. Advertisement, Arbitration would shield the case from public view, sparing Mr. Trump the public spectacle that would attend a lawsuit with a discovery process and a trial. Mr. Avenatti said at the time that he would vigorously oppose the effort to resolve the case privately. In fact, on Thursday night, he said that Mr. Trumps remarks had made him more determined than ever to try to depose the president. If the president didnt know anything about the payment, then he obviously didnt know anything about the agreement, in which case you cant have an agreement, Mr. Avenatti said in an interview on MSNBC. And then there is no such thing as an NDA, he added, referring to a nondisclosure agreement. Now if, on the other hand, what he said on Air Force One is not accurate and I, for one, have serious questions as to its veracity or accuracy theyve got a whole host of problems, Mr. Avenatti said. The president and his lawyers have been working to prevent Ms. Clifford, who sat for a lengthy interview that aired on 60 Minutes last month, from making further public statements. In February, she said that she believed that Mr. Cohen had violated the agreement and that she, as a result, was no longer bound by it. Mr. Cohen secretly obtained a restraining order late that month to prevent her from speaking. Then last month, Mr. Trumps legal team filed a motion asking to move the case from state court to federal court, which may have been an effort to increase the likelihood that it would be resolved in arbitration. Jim Rutenberg contributed reporting from Los Angeles. A version of this article appears in print on April 6, 2018, on Page A15 of the New York edition with the headline: Trump Denies Knowledge Of Payment To Porn Star. Order Reprints| Today's Paper|Subscribe, Were interested in your feedback on this page. Tell us what you think. See More Go to Home Page ]", "title": "Trump Denies Knowing of Any Hush Money Paid to Porn Actress - The New York Times", "urlToImage": "https://static01.nyt.com/images/2018/04/06/us/politics/06dc-stormy/06dc-stormy-facebookJumbo.jpg"}], "https://www.tennessean.com/story/news/crime/2018/04/05/tad-cummins-charged-pleads-guilty-kidnapping/475018002/": [{"author": "Adam Tamburin", "description": "Cummins had originally entered a plea of not guilty in May 2017.", "publishedAt": "2018-04-05T23:39:26Z", "source": "Tennessean.com", "text": "[Hi Already a subscriber. Subscribe today for full access on your desktop, tablet, and mobile device. Already a print edition subscriber, but don't have a login. Manage your account settings. View the E-Newspaper, Manage your Newsletters, View your Insider deals and more, Member ID Card, Chat Support, Chat Support, Support, Support, Log Out, Get the news, Let friends in your social network know what you are reading about, Cummins had originally entered a plea of not guilty in May 2017. A link has been sent to your friend's email address. A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQs, Subscribed, but don't have a login. Booking photo for Tad Cummins after his arrest in California.(Photo: Siskiyou County Sheriff's Office), The chains shackled toTad Cummins'legs rattled as he made his way to the podium. A federal prosecutor had just read a lengthy statement outlining the allegations against him. That hehad fostered a sexual relationship with a 15-year-old student while he was a teacher at a Maury County high school. That he had convinced the girl to run away with him on March 13, 2017, a move that spurred an Amber Alert and a nationwide manhunt. That he had destroyed their phones and stolen out-of-state license plates so he could escape detectionfor 38days before authorities found and arrested him in California. Cummins had faced those allegations before, but he had pleaded not guilty. On Thursday, he reversed course and admitted for the first time in court that they were true. You are pleading guilty because you are in fact guilty? U.S. District Judge Aleta A. Trauger asked. Speaking so softly that many in the audience couldn't hear him, he answered: Yes, ma'am. I cannot sleep or eat, he said from the podium. I cannot be the man that I need to be and not tell the truth. Cumminspleaded guilty to obstructing justice and taking a minor across state lines for sex.The teenage victim and her family watchedfrom back of the courtroom. He faces a mandatory minimum of 10 years behind bars for the latter charge, and will be sentenced later this year. His courtroom admissionwas a subdued end to a dramatic saga that began more than a year ago with an Amber Alert andthe disappearance of a 15-year-old girl from Columbia, Tennessee. The manhunt: Hearing reveals details of Cummins' cross-country flight with student, The teenage girl was reported missing March 13, 2017. The same day, Cummins left a note telling his wife he was leaving town to clear his head he asked her not to call police. In court on Thursday,prosecutorSaraMyers said Cummins had fostered a relationship with the girl for months while she was a student at Culleoka Unit School. In the fall of 2016, she said, Cummins took the girl to church with his family and gave her a Bible as a present. Expert: How young people fall prey to predators, At some point, Myers said, the relationship became sexual. They had been intimate in the closet in Cummins' classroom, Myers said. On Jan. 23, 2017, a 12-year-old student told administrators she saw Cummins kissing the girl in school. He was suspended from the school on Feb. 6, 2017. Then on, March 13, 2017, took his wife's Nissan Rogue, surveillance footage shows. Cummins and the girl drove across the country, regularly staying in hotel rooms with one bed. The girl later told authorities she and Cummins had sex every day as they traveled from state to state. A citizen's tipultimately led law enforcement toa remote forest cabinnear Cecilville, California, where Cummins and the girl had been staying. He was arrested April 20, 2017. Cumminsadmitted to the sexual relationship during an early interview with investigators, although his attorney had fought to block those statements. More: Tad Cummins, charged in kidnapping case, wants to block statements to authorities, But Cummins was contrite in a letter he wrote to his wife from behind bars on July31, 2017. Myers read an excerpt of the letter in court. I am the one to blame for everything, Cummins wrote, although he added that the devil was deeply involved. More: How a Nashville native helped capture Tennessee's most wanted man, Cummins had originally entered a plea of not guilty in May 2017. His decision to reverse coursecame after anunforeseen legal hurdle delayed his trial and brought the case back to square one. Cummins' family had originallycobbled together the money tohire a private attorney, who had argued on his behalf for months. But the lawyerstepped down in Januaryafter trying to talk to the teenage girl at the center of the case. With no money left, Cummins was then assigned a federal public defender. That public defender announced Cummins' plans to change his plea last week. Cummins decided to change his plea after case review, consultation, and personal reflection, federal public defenderDumaka Shabazz wrote in a court filing. He did not have a plea deal with prosecutors. Following the announcement, S. Jason Whatley, the Columbia-based attorney representing the girl,released a statement saying the family is very relieved that Tad Cummins decided to do the right thing by pleading guilty. We see this as one more step toward justice. In a statement, U.S. Attorney Don Cochran of the Middle District of Tennessee said prosecutors wereready and eager to try Mr. Cummins on the charges brought by the grand jury. In view of todays development and Mr. Cummins decision to plead guilty, we are pleased that the victim no longer faces the possibility of enduring a lengthy trial, Cochran said.We now look forward to the sentencing of Mr. Cummins and bringing closure to this case. The case is also the subject of a pending civil lawsuit. The girl's father sued Cummins and Maury County Public Schools, saying the school district ignored signs Cummins had an improper relationship with the girl. Reach Adam Tamburin at 615-726-5986 and atamburin@tennessean.com. Follow him on Twitter @tamburintweets.]", "title": "Tad Cummins pleads guilty in kidnapping case", "urlToImage": "https://www.gannett-cdn.com/-mm-/9e8623d752cb23ab2a374e20d428330d58038970/c=0-92-240-228&r=x1683&c=3200x1680/local/-/media/2017/04/20/TennGroup/Nashville/636283104235919953-Tad-Cummings-Mug-Photo.jpg"}], "https://www.washingtonpost.com/news/capital-weather-gang/wp/2018/04/05/another-busy-atlantic-hurricane-expected-but-not-as-brutal-as-the-last-one/": [{"author": null, "description": "The forecast is for a total of 14 named storms, 7 hurricanes and 3 major hurricanes.", "publishedAt": "2018-04-05T14:26:45Z", "source": "The Washington Post", "text": "[Last years hurricane season was more than twice as active as a typical season, and an onslaught of storms left deep wounds across the Caribbean and southern United States that have not yet healed. But, ready or not, the 2018 Atlantic hurricane season begins on June 1. [2017 review: The Atlantic hurricane season from hell is finally over] As it has done every year since 1984, Colorado State University has releasedits initial predictions for the upcoming season. Its forecast is for a total of 14 named storms,seven hurricanes andthree major hurricanes, which is slightly above the long-term average of 12 named storms,six hurricanes and two major hurricanes. Last year, we saw 17 named storms, 10 hurricanes andsix major hurricanes. These 2018 predictions will be updated on May 31, July 2 andAug. 2. Two primary factors critical for determining how active the upcoming Atlantic hurricane season will be whether El Nio develops and the configuration of North Atlantic sea surface temperatures. WhenEl Nio conditions are present and ocean temperatures in the tropical Pacific are warm, the Atlantic hurricane season tends tobe less active. The reverse is true when La Nia,the opposite phase, prevails and the tropical Pacific waters are cool. Right now, the verdict is still out about which conditions, if any, will take control by the time hurricane season is underway. Similar to what occurred last winter, the tropical eastern and central Pacific cooled to weak La Nia conditions this past winter. These weak La Nia conditions have continued to persist, although there has been rising of sea surface temperatures in the eastern and central tropical Pacific in recent weeks. During the Northern Hemisphere spring, the future state of the El Nio andLa Nia is notoriously difficult to predict a phenomenon known as the springtime predictability barrier. The low-level windsthat force ocean circulation changes that drive El Nio and La Nia events are usually at their weakest during this time, and consequently, small changes in the atmosphere can have significant effects on whether El Nio develops. As a result, computer model forecasts are typically least reliable during the Northern Hemisphere spring. This lack of skill was clearly demonstrated last year, as most of the forecast models called for El Nio to develop by the peak of the Atlantic hurricane season. Instead, we ended up with neutral to weak La Nia conditions, which supported the very active season. The latest suite ofcomputer model guidance indicates a chance for El Nio development by the peak of the Atlantic hurricane season, but the majority of the model guidance calls for neutral conditions, that is, neitherEl Nio or La Nia andsea surface temperatures near their long-term average. At this point, CSU is anticipating that neutral conditions in the tropical Pacific are the most likely scenario for the summer/fall of 2018. In summary, the Pacific Ocean may not give us many predictive clues about the Atlantic hurricane season. Should the forecast forneitherEl Nio or La Niahold true in the Pacific, the configuration of Atlanticsea surface temperaturesbecomes very important for predictinghow active the hurricane season will be. Generally, the presence of warm water in the North Atlantic would tend to portend a busy season. The western North Atlantic Ocean is currently somewhat warmer than normal, while the far North Atlantic and eastern tropical Atlantic are slightly cooler than normal. Overall,sea surface temperatures dropped much faster than normal during this past winter, in large part because of a strong subtropical high pressure that dominated the North Atlantic during January and February, driving stronger winds that caused more mixing and churning up of the sea surface and, thereby, promoting cooling. Consequently,high sea surface temperatures, compared to normal, that dominated the North Atlantic last fall were replaced by cooler watersby late winter/early spring. The currentsea surface temperature pattern is fairly similar to the pattern that prevailed in early April of last season. However, during last spring/summer, the waters warmed much faster than normal across most of the Atlantic, and by the peak of the Atlantic hurricane season, the sea surface temperatures were much warmer than normal across most of the tropical Atlantic, providing increased fuel for the hurricanes that formed last year (most notably, Irma, Jose, and Maria). Several climate models including recent predictions from the National Weather Service Climate Forecast System model indicate that the tropical Atlantic will become warmer than normal by August-October. If this holds true, at least a somewhat active hurricane season would be likely. The skill of Colorado Statesseasonal forecasts improves as the season approaches. Looking at past predictions, the early April forecast has modest skill, while the skill increases considerably by June and especially by August. The modest skill in early April is to be expected, given that much can change in the atmosphere/ocean system between early April and the peak of the Atlantic hurricane season. This was demonstrated clearly last season, where early seasonal forecasts issued by CSU and other agencies predicted a near- or even slightly below-normal season, given the anticipated El Nio conditions. However, by early August, most groups correctly predicted a well above-average Atlantic hurricane season, as El Nio chances diminished and the tropical Atlantic anomalously warmed. As is typically the case with early seasonal outlooks, the primary area of uncertainty lies in whether El Nio develops. Should a significant El Nio develop, Atlantic seasonal hurricane forecasts would likely be reduced. Alternatively, should the tropical Pacific have neutral conditions and the Atlantic were tomarkedly warm, seasonal forecasts would likely increase. Many groups will issue seasonal hurricane forecasts over the next few weeks, and they will be displayed on a seasonal hurricane forecast compilation website jointly developed by the Barcelona Supercomputing Center, XL Catlin and CSU. A more detailed discussion of the 2018 outlook from CSU as well as archives of past outlooks are available here. The 2018 list of storm names will be the same as 2012s, with the exception of Sandy, which was retired and replaced with Sara.]", "title": "Another busy Atlantic hurricane season expected, but unlikely as brutal as the last one - The Washington Post", "urlToImage": "https://www.washingtonpost.com/pbox.php?url=http://www.washingtonpost.com/blogs/capital-weather-gang/files/2018/04/sep8_katia_irma_jose.jpg&w=1484&op=resize&opt=1&filter=antialias&t=20170517"}], "https://www.washingtonpost.com/politics/congress/arrest-warrant-issued-for-former-brazilian-president-lula/2018/04/05/aacae692-3939-11e8-af3c-2123715f78df_story.html": [{"author": null, "description": "A Brazilian judge issued an arrest warrant on Thursday for former President Luiz Inacio Lula da Silva, dealing a major blow to the once wildly popular leader who was trying to mount a political comeback ahead of October’s elections.", "publishedAt": "2018-04-06T01:28:05Z", "source": "The Washington Post", "text": "[SAO PAULO A Brazilian judge issued an arrest warrant on Thursday for former President Luiz Inacio Lula da Silva, dealing a major blow to the once wildly popular leader who was trying to mount a political comeback ahead of Octobers elections. The warrant came several hours after the countrys top body, the Supreme Federal Tribunal, voted 6-5 to deny a request by da Silva to stay out of prison while he appealed a corruption conviction that he contends was simply a way to keep him off the ballot. Federal judge Sergio Moro gave Brazils former president 24 hours to present himself to police in the southern city of Curitiba. In a statement, Moro said he was giving da Silva the opportunity to come in of his own accord because he had been president of the nation. Last year, Moro convicted da Silva of trading favors with a construction company in exchange for the promise of a beachfront apartment. That conviction was upheld by an appeals court in January. The speed with which Moro issued the warrant surprised many, as legal observers said there were technicalities from da Silvas upheld appeal that would not be sorted out until next week. Such technicalities were simply a pathology that should be eliminated from the judicial world, Moro said in his statement. Minutes after Moros issue the warrant, a fight broke out in front of the Lula Institute in Sao Paulo between hecklers and supporters of the former president universally known here as Lula. One heckler was punched in the face and subsequently got hit by a passing vehicle as he was falling. He was taken to nearby hospital and police arrived. Ive never seen this kind of hatred before, said Mariella Sanches, who was selling ice-cream where the fight broke out. Why cant people get along. Da Silvas upcoming arrest will mark a colossal fall from grace for the man who led Latin Americas most populous nation between 2003 and 2010, and left office with approval ratings over 80 percent. Former U.S. President Barack Obama once called da Silva the most popular politician on Earth. Since leaving office, things have steadily gotten worse for da Silva, who has been charged in several corruption cases. He has always maintained his innocence while continuing to campaign across the country the past year. Despite his legal troubles, he still leads preference polls to return to office if by some chance he is allowed to run. Earlier Thursday, the head of Brazils Workers Party warned that jailing da Silva would turn Latin Americas largest nation into a banana republic. His lawyers put out several statements saying they were filing injunctions in hopes of keeping him out of prison. We consider this to be a political imprisonment, an imprisonment that will expose Brazil before the world, said Gleisi Hoffmann, chairwoman of the Workers Party. We will become a banana republic. Hoffmann also insisted that da Silva, 72, would be the partys candidate in October. The ex-president has not spoken since the ruling. Like so much in a nation that has become deeply polarized, the reality that the once popular leader would be jailed was being interpreted differently by supporters and detractors. Brazil scored a goal against impunity and corruption, said Congressman Jair Bolsonaro, a right-leaning former army captain who is second in the polls after da Silva. Mariana Setra, a da Silva supporter in Sao Paulo, called the top courts decision ridiculous. It was applied to only one person, she said. As if Lula were the only thief in this country. Da Silva is the latest of many high-profile people to be ensnared in possibly the largest corruption scandal in Latin American history. Over the last four years, Brazilians have experienced near weekly police operations and arrests of elite, from top politicians to businessmen like former Odebrecht CEO Marcelo Odebrecht. Investigators uncovered a major scheme in which construction companies essentially formed a cartel that doled out inflated contracts from state oil company Petrobras, paying billions in kickbacks to politicians and businessmen. Moro, who oversees cases in the so-Called Operation Car Wash, is hailed as a hero by many Brazilians. Others, particularly on the left, see him as a partisan hit man out to get da Silva and the Workers Party. Still, the list of targets in the scandal include people across the spectrum, including President Michel Temer. Temer took power in 2016 after da Silvas successor and protege, Dilma Rousseff, was impeached and ousted from office. Last year, Temer was twice charged with corruption but remained in office because in both cases Congress, which must vote on criminal cases involving a sitting president, decided to spare him prosecution. Many members of Congress have been charged with corruption or are being investigated. Da Silva was convicted in July of helping a construction company get sweetheart contracts in exchange for the promise of the apartment. He denies any wrongdoing in that case or in several other corruption cases that have yet to be tried. An appeals court upheld the conviction in January, and the three reviewing magistrates even lengthened the sentence to 12 years and one month. Technically, the Supreme Federal Tribunals decision doesnt keep da Silva off the ballot. In August, the countrys top electoral court makes final decisions about candidacies. It was expected to deny da Silvas candidacy under Brazils clean slate law, which disqualifies people who have had criminal convictions upheld. However, da Silva could appeal such a decision, though doing so from jail would be more complicated. Sen. Lindbergh Farias from the Workers Party said vigils would be organized nationwide beginning on Friday. People want to be close to President Lula after this injustice, he said. Whether the Workers Party will be able to mobilize major demonstrations remains to be seen. During the impeachment trials against Rousseff in 2016, many demonstrations were small despite calls by major unions to take to the streets. ___, Peter Prengaman reported from Rio de Janeiro. ___, Peter Prengaman on Twitter: twitter.com/peterprengaman, Mauricio Savarese on Twitter: twitter.com/MSavarese, Copyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.]", "title": "Arrest warrant issued for former Brazilian president Lula - The Washington Post", "urlToImage": "https://www.washingtonpost.com/rf/image_1484w/2010-2019/Wires/Images/2018-04-05/AP/APTOPIX_Brazil_Da_Silva_13085.jpg-bf4bf.jpg?t=20170517"}], "https://www.washingtonpost.com/politics/pawlenty-to-announce-bid-for-minnesota-governor/2018/04/05/c856cdce-38f4-11e8-acd5-35eac230e514_story.html": [{"author": null, "description": "The Republican, making his return to politics after 2012, will seek a third term as leader of the state.", "publishedAt": "2018-04-05T20:15:00Z", "source": "The Washington Post", "text": "[Former Minnesota governor Tim Pawlenty announced Thursday that he will run this year for a third term as leader of the state. I have the strength and experience to solve problems and bring us together, the Republican announced in a video posted to his website. I want to finally put those in the middle ... first. The decision shakes up what is already considered a competitive contest to replace Democratic Gov. Mark Dayton, who is not running for reelection after two terms in office. After mounting an unsuccessful presidential bid in 2012, Pawlenty became the leader of the Financial Services Roundtable, a trade group that represents major banking, insurance and investment companies in Washington. He resigned from that job in February to begin exploring a possible return to politics. Almost from the day he took that job, you could tell that he missed public service, he missed politics, said Vin Weber, a Republican lobbyist who served as co-chair of Pawlentys 2012 presidential campaign. Tim has been moving around Minnesota in both political and donor circles for some time, and the response among Republicans and the business community has been overwhelmingly positive. On March19, Pawlenty announced the formation of a fundraising committee for a possible campaign. He boasted Wednesday on Twitter of eating a pork chop and bowling in McGregor, Minn. before a meeting with local Republican leaders. Pawlenty served as governor from 2003 until 2011, and his reelection in 2006 was the last Republican statewide win in Minnesota. He will face several Republican primary challengers, including Jeff Johnson, the commissioner of Hennepin County, who has dismissed the threat of Pawlentys candidacy and highlighted the former governors ties to Washington lobbyists. If Tims our candidate, no matter how much he talks about the future, this election will be about the past, Johnson said in a Web video this month. [Tim Pawlenty knows Republicans have a brand problem. Heres what he would do about it] To prevail in the primary, Pawlenty will have to find a way to win over supporters of President Trump, who narrowly lost to Hillary Clinton in the state in 2016, with 45percent of the vote. Pawlenty called Trump unsound, uninformed, unhinged and unfit to be president of the United States in October 2016, after The Washington Post reported on an Access Hollywood tape in which Trump could be heard boasting of grabbing women by their genitals. I am withdrawing my support of him, Pawlenty said at the time. In his announcement video, Pawlenty said he would fight against toxic politics, improve educational opportunities, work to lower health-care premiums and prevent undocumented immigrants from getting government benefits. Ill restore common sense to Minnesota government with an open mind and big ideas, he said. There are three Democratic candidates vying for that partys gubernatorial nomination: state Rep. Erin Murphy, state Auditor Rebecca Otto and U.S. Rep. Tim Walz. The states primary will be held Aug.14. Sean Sullivan contributed to this report. Sean Sullivan contributed to this report.]", "title": "Pawlenty announces bid for Minnesota governor - The Washington Post", "urlToImage": "https://www.washingtonpost.com/pbox.php?url=https://www.washingtonpost.com/pb/resources/img/twp-social-share.png&w=1484&op=resize&opt=1&filter=antialias&t=20170517"}], "https://www.washingtonpost.com/world/the_americas/mexican-president-rebukes-trump-over-border-threats/2018/04/05/99b8a49a-3914-11e8-af3c-2123715f78df_story.html": [{"author": "https://www.facebook.com/josh.partlow1", "description": "Peña Nieto gave an unusual national address as Mexican politicians condemned Trump for ordering troops sent to the border.", "publishedAt": "2018-04-05T22:50:08Z", "source": "The Washington Post", "text": "[ VERACRUZ, Mexico Mexican President Enrique Pea Nieto delivered his most direct public rebuke of President Trump on Thursday afternoon, in a national address that characterized Mexico as willing to cooperate with the United States but not at the expense of its sovereignty or dignity. Pea Nieto spoke after Trump signed an order to deploy National Guard troops to halt a drastic surge of illegal activity on the southern border. In the past week, Trump has accused Mexico of doing little to stop illegal migration and expressed alarm about a caravan of hundreds of Central Americans who were crossing this country to highlight the plight of migrants threatening to retaliate against Mexico if it didnt stop the march. Pea Nieto, speaking Thursday from the presidential palace in Mexico City, noted that the Mexican Senate and all four leading candidates in the July 1 presidential race had condemned Trumps comments, adding: As president of Mexico, I agree with those remarks. President Trump: If you wish to reach agreements with Mexico, we stand ready, as we have proved until now, always willing to engage in a dialogue, acting in earnestness, in good faith and in a constructive spirit, Pea Nieto said. If your recent statements are the result of frustration due to domestic policy issues, [due] to your laws or to your Congress, it is to them that you should turn to, not to Mexicans. We will not allow negative rhetoric to define our actions. We will act only in the best interest of Mexicans, he said. The address to the nation was remarkable because Pea Nieto has endured, with diplomatic courtesy and sometimes stony silence, about two years of insults and threats from Trump over Mexican immigrants, the trade relationship, border security and the fight against drug traffickers. The two countries and Canada are locked in tense negotiations over the future of the North American Free Trade Agreement, or NAFTA, which Trump has threatened to rip up if the U.S. government cant win more favorable terms. Trump has also frequently called for construction of a massive wall on the border. In the past few decades, Mexico has become a far more cooperative partner of Washington in fighting drug-trafficking, terror threats and illegal migration. But Mexican politicians have called for reducing bilateral cooperation if Trump militarizes the border. Trumps move comes as Mexico is in the midst of a hotly contested campaign for president. The leading candidate is Andrs Manuel Lpez Obrador a center-left populist. On Wednesday, he responded to Trumps latest moves by declaring that we will not accept the use of force, the militarization of the border. Mexicos Senate on Wednesday unanimously approved a nonbinding resolution that urged the government to end cooperation with the United States on illegal immigration and drug trafficking because of Trumps plans to deploy National Guard troops. Ricardo Anaya, the presidential candidate for a left-right coalition, went further, calling on Mexico to curb its anti-terrorism cooperation until the Guard members are withdrawn. Despite the outcry, some Mexican analysts and border residents said they expected little practical effect. David Cuauhtmoc Galindo, mayor of the border city of Nogales, said Trumps comments generate a certain amount of scandal but no fear in his city. He noted that most of Trumps threats to massively deport undocumented immigrants, expel young dreamers who have had temporary U.S. residency or crack down on work visas had not come to pass. In practice, on all these themes, its the opposite of his speeches, he said. As far as the construction of a wall, here in Nogales, we have a barrier that was built years ago. It wont make a bit of difference. Gabriela Martinez in Mexico City contributed to this report. Gabriela Martinez in Mexico City contributed to this report. Read more The migrant caravan denounced by Trump will end in Mexico City A U.S.-backed plan was supposed to fix Mexicos justice system. Its resulted in chaos. Every year, more stays here: Mexicos drug traffic is hitting home Todays coverage from Post correspondents around the world Like Washington Post World on Facebook and stay updated on foreign news ]", "title": "Mexican president rebukes Trump over border threats - The Washington Post", "urlToImage": "https://www.washingtonpost.com/rf/image_1484w/2010-2019/WashingtonPost/2018/04/05/Foreign/Images/2018-04-05T211916Z_442519649_RC12ABCEE540_RTRMADP_3_USA-IMMIGRATION-MEXICO-PRESIDENT.jpg?t=20170517"}], "https://www.wsj.com/articles/u-s-diplomat-expulsions-deepen-divisions-with-russia-1522924973": [{"author": "Thomas Grove", "description": "U.S. diplomats were leaving Russia hours after the Kremlin failed to garner support for a joint investigation into the use of a Soviet-era nerve agent in the U.K., moves that underscore the deepening divisions between Russia and the West.", "publishedAt": "2018-04-05T10:45:01Z", "source": "The Wall Street Journal", "text": "[]", "title": "U.S. Diplomat Expulsions Deepen Divisions With Russia - WSJ", "urlToImage": "https://si.wsj.net/public/resources/images/BN-YD092_russia_SOC_20180405061914.jpg"}]}