{"http://people.com/crime/father-incest-biological-daughter-kills-3-murder-suicide/": [{"author": null, "description": null, "publishedAt": "2018-04-12T22:22:33Z", "source": "People.com", "text": "[Authorities say Steven Pladl, a42-year-oldaccused of having a child with his 20-year-old daughter, killed their infant son and then her and her adoptive father earlier this week. Finally, he killed himself. The apparent murder-suicide comes only months after the case was first brought to light. In January, Pladl was arrested for allegedly impregnating his biological daughter, Katie Pladl, whom he placed for adoption when she was a baby. They reunited two years ago. According to warrants obtained by PEOPLE, Pladls ex-wife Katies biological mother first notified police of the possible relationship last May. She had read an entry in one of Katies journals in which the girl discussed being pregnant with her biological fathers love child. Steven and his wife placed Katie for adoption when he was 22 and she was 17. The couple stayed together until divorcing lastsummer, according to court records. When Katie turned 18 in 2016, she tracked her birth father down through social media. The ex-wife told police she believed Steven psychologically manipulated Katie. Katie and Steven married in July and in September welcomed a baby boy in Virginia before moving to North Carolina, where they were arrested, according to CBS News.In addition to incest and adultery, Katie and Steven were both charged with contributing to delinquency. Want to keep up with the latest crime coverage?Click here to get breaking crime news, ongoing trial coverage and details of intriguing unsolved cases in the True Crime Newsletter. On Thursday morning, police in Knightdale, North Carolina, responded to a call from Stevens mother requesting a welfare check on her young grandson, Bennett, Police Chief Lawrence Cappssaid at a news conference on Thursday. The night before, Steven had picked Bennett up from his mother, who had custody of the boy, Capps said. The grandma became worried for Bennett after an alarming phone conversation with Steven, though Capps declined to go into detail, citing the ongoing investigation. Upon arrival at the home Katie and Steven had shared before their arrests, authorities discovered their son deceased and alone, Capps said. A cause of death has not been released. Later Thursday, Katie was declared the victim of a double homicide in New Milford, Connecticut, Capps said. She was slain alongside her adoptive dad, 56-year-old Anthony Busco. Authorities believe Steven killed his son before driving to Connecticut to kill Katie, Busco and then himself in Dover, New York, Capps said. According to local reports, all three had been fatally shot. Were trying to make sense of all the factors that led up to this senseless taking of a life, Capps said of the childs death, calling it tragic. In February,Steven posted his court-mandated bondin his incest case but was required to stay in Virginia and away from Katie until trial. However a month later, a judge allowed Steven to amend his bond and travel to North Carolina, according to local station WTVR. Katie was also released in February on the condition that she live with her adoptive parents in New York, WTVR reports. However, she was allowed to travel out of state. With CHRIS HARRIS]", "title": "Man Suspect Kills Biological Daughter in Murder-Suicide  PEOPLE.com", "urlToImage": null}], "http://people.com/tv/khloe-kardashian-forgives-tristan-thompson/": [{"author": "Maria Pasquini", "description": "", "publishedAt": "2018-04-12T22:33:26Z", "source": "People.com", "text": "[Khlo Kardashian has already put Tristan Thompsons alleged infidelity behind her, an insider tells PEOPLE. Khlo is feeling nothing but happiness right now. She is head over heels in love with her little girlshe is just consumed with love. Absolutely nothing else matters, the Kardashian family source says. Although the two days before the 33-year-old welcomed her baby girl were filled with allegations that the 27-year-old NBA power forward had been seen kissing multiple other women, right now the reality star is filled with bliss. RELATED:New Mom Khlo Kardashian Is Already Preparing to Move Back to L.A.: Source, In fact, the new mother is so incredibly happy that she isnt upset about the cheating allegations. Shes so incredibly happy that her baby is here, that she is big and strong and healthy and beautiful, and so right now Khlo truly has no other cares in the world. She isnt even mad at Tristan right now, the source continues. Shes basically already forgiven him, the source adds. She is in a bubble of love and peace and happiness right now, and everything that happened with Tristan is less about cheating and more like, it was just a random drunken hookup that meant nothing and was kissing at most and didnt lead to anything else and was the fault of stupid groupies trying to trap him, and everybody just needs to move on. RELATED: KUWTK Filmed Khlo Kardashian Giving Birth and Dealing with Tristan Thompsons Cheating Scandal, On April 10, videos surfaced of the Cleveland Cavaliers player allegedly getting close to an unidentified woman at the PH-D Lounge in New York City over the previous weekend. In photos and video footage published by theDaily Mailand TMZ, a man who has been identified as the athlete was seen speaking closely with a brunette. The Shade Room later published a video of Thompson and a brunette allegedly entering his hotel at 5 a.m. TMZ also posted footage recorded in October, allegedly depicting Thompson kissing one woman while a different woman groped him at the Darna hookah lounge outside of Washington, D.C. RELATED VIDEO:Tristan Thompson Booed During First Game Since Allegations He Cheated on Pregnant Khlo Kardashian, But for now, none of those allegations matter to the new mother. Explains the source, She loves thisbaby so much, and this baby is one half Tristan, and she loves Tristan. All is forgiven, all is right with the world. For this precise moment, anyway. Well see what the next few weeks bring. But right now? Its nothing but peace and love and joy. And if anyone has a problem with her and Tristan and their baby all being happy together? Honestly, she just does not care at all, the source adds. A family insider previously told PEOPLE they thought Kardashian would likely stay with Thompson and try to make things work. Shes a hopeless romantic and shell try to make this work. She tried forever to make it work withLamar [Odom]. Shes having a child with Tristan, and shes going to try to rebuild this, the source said.]", "title": "Khlo Kardashian Has Already Forgiven Tristan Thompson Source  PEOPLE.com", "urlToImage": "https://peopledotcom.files.wordpress.com/2018/02/khloe-kardashian-tristan-thompson.jpg?crop=271px%2C146px%2C1333px%2C700px&resize=1200%2C630"}], "http://www.businessinsider.com/google-gmail-new-look-design-screenshots-2018-4": [{"author": "Prachi Bhardwaj", "description": "For the first time in years, your Gmail account is going to have a notably new look, and some new nifty features too.", "publishedAt": "2018-04-12T18:17:05Z", "source": "Business Insider", "text": "[performance.mark('first image displayed'); The Verge/Tom Warren For the first time in years, your Gmail account is going to have a notably new look. Google on Wednesday alerted G Suite administrators about upcoming changes to the Gmail web interface that are rolling out to participants of an Early Access Program in the next few weeks. The email was intended to prepare employees tasked with managing companies' G Suite apps Gmail, Calendar, Docs, Sheets, etc. to answer questions about the redesign as it's rolled out to personal accounts, meaning we could expect it to look noticeably different. We can see how different the fresh, clean look is, thanks to screenshots obtained by The Verge and Android Authority and shared with Business Insider. Perhaps the biggest change to Gmail will be plugins to other Google apps such as Calendar, which would save users the hassle of clicking back and forth between screens. Clicking on one of the icons in the thin vertical bar in the top right corner appears to pull the respective app in, while still giving the user a clear view of the whole inbox, as seen above. The bar looks as if it has icons for the Calendar, the note-taking app Google Keep, and Google's new Tasks app. The Verge/Tom Warren As you can see, the Compose Email screenshot will have a Smart Reply option something users of the Gmail app will be familiar with, since it launched on mobile last year. It's a time-saving feature that suggests short responses by scanning your emails, and then lets you send them with one tap (as a user of the Gmail app, I can vouch for the fact that it's eerily accurate with its prepopulated responses). Gmail's mobile-app users will also be familiar with the new ability to snooze emails on the web interface. This gives you the ability to remove an email from your inbox until a later, more relevant date. It looks like you can choose from one of their preselected choices (e.g. tomorrow at 8:00 a.m.) or specify the date yourself. For those who don't like change, the good news is that Google is allowing Gmail users to choose from three different layouts, including a Compact layout that is closer to the current look, according to The Verge. G Suite administrators are being encouraged to turn the Early Access Program on and share feedback once The Keyword or the G Suite Updates blog let them know it's available. The redesign is expected to roll out to all Gmail users in the coming weeks. The sidebar on the right shows you what plugins can be accessed from your inbox. Before the update, the layouts were Comfortable View, Cozy View, and Compact View, which can be found under the settings gear. ]", "title": "    New Gmail web design starts rolling out from Google PHOTOS - Business Insider", "urlToImage": "https://amp.businessinsider.com/images/5acf8c47146e7122008b46e6-750-375.jpg"}], "http://www.latimes.com/socal/daily-pilot/news/tn-wknd-et-holocaust-remembrance-20180412-story.html": [{"author": "Lou Ponsi", "description": "Clifford Lester's portraits will be part of the third annual Yom HaShoah event at Cypress College on April 17 which will recognize Holocaust survivors and veterans involved in liberating concentration camps in Germany.", "publishedAt": "2018-04-12T23:01:42Z", "source": "Latimes.com", "text": "[Photographer Clifford Lester has devoted more than a decade to telling the stories of Holocaust survivors through his craft. Lester, 62, has photographed close to 100 survivors, with 32 of the portraits lining walls along a long hallway in the student center at Cypress College, where he has been a photography instructor for 16 years. Lester's portraits, lit only by windows, capture the emotions of his subjects during their most intimate, introspective moments. The expressions are profound. Every wrinkle, blemish and age spot are seen. The subjects' often-horrific testimonies are etched in text boxes alongside each portrait. Every one of their stories are so unique, even though you can (say) they sort of went through similar things, Lester said. I go there with a sincere interest with what they have to say and we're just talking as I'm photographing them. His portraits will appear in a slideshow at Cypress College theater for the third annual Yom HaShoah event on April 17, where Holocaust survivors will share testimonies and World War II veterans involved in liberating the concentration and death camps in Germany will be recognized. Both of Lester's parents are Holocaust survivors. In November 1938, Lester's father, Harry, witnessed the violent pillaging of Jewish neighborhoods in Germany. The event became known as Kristallnacht, or night of the broken glass, referring to the glass that blanketed the streets. Lester's father fled to the U.S. in 1939. Lester's mother, Ursula Lowenbach Foster, spent much of the war with her parents in Amsterdam and eventually went into hiding for 18 months with a non-Jewish family. She later spent years speaking to thousands of American schoolchildren about her experiences during the Holocaust. After his mother's death in 2004, Lester read letters his mother received from students who expressed gratitude for hearing her story. The letters were so powerful, Lester said. They would talk about her courage and her bravery and how she impacted their lives and all these different things behind her message. I thought, 'Well she is gone. I'm here. I've got to continue her work.', For Lester, the logical way to do that would be through photographs. Survivors have been photographed so many different ways, he said. I said, 'How can I do something different?', Lester's first portrait in the series was of Nathan Langer, a family friend and founder of Langer Juice Company. Langer was taken to concentration camps with his family in 1939 and eventually escaped. He was the only member of his immediate family who survived. Lester photographed Langer outside his factory in Commerce. Speaking about the horrors he endured during the Holocaust, Langer became too distraught to continue and the photo session abruptly ended, Lester said. If there is one survivor whose anguish still shows in his eyes and clearly the depths of his soul, it would be Nathan, Lester said. Lester showed Langer's portrait to Dr. Marilyn Harran, director of the Rodgers Center for Holocaust Education at Chapman University. Harran appreciated the image and sent Lester on assignments to photograph more Holocaust survivors. He has since connected with survivor support groups and located survivors through a variety of other sources. Lester researches his subject before each shoot and spends hours talking with him or her during the shoot. I don't pose them at all, he said. All these portraits are done by conversation. Another portrait is of Tova Cohen, who was imprisoned in Auschwitz at age 12 and credits her survival to being on Schindler's list. During the shoot, Cohen spoke about her rebellious personality and once receiving 25 lashes by a Nazi guard without making a sound by chewing on her hands to keep from screaming. While in Poland, Lester photographed survivor Philip Bialowitz, a U.S. resident who traveled the world to share his story. Bialowitz was transported to the Sobibor death camp in Poland, where 250,000 Jews were sent. Only about 50 survived. The collection of survivors' portraits at Cypress College is believed to be the only exhibit of its kind in any community college in the state, said Paul de Dios, dean of counseling, student development and admissions and records at Cypress College. It's an opportunity to bring the community to our campus, from K-12 kids who are probably studying history to our own students on this campus and our own community, said de Dios, who helped spearhead the exhibit along with Lester. We like to promote diversity on this campus and we want our students to learn that diversity and to be inclusive along with the other core values that we have. In 2016, Lester organized the first Yom HaShoah Holocaust Day of Remembrance at Cypress College and invited several survivors to share their testimonies. Yom HaShoah has been observed annually around the world since 1951 and Cypress' third annual Yom HaShoah event will take place at 7 p.m. April 17. Survivor Jacob Eisenbach will share his memories at the event for the third time. I want people to know what the consequences can be to accepting ideas of hatred, discrimination and intolerance, Eisenbach said. Because this is what led to the Holocaust. For the first time in the event's history, U.S. World War II veterans involved in liberating the concentration and death camps in Germany will be recognized along with survivors. World War II veteran Henry Hahoum, 98, of Laguna Woods is one of the veterans who will be honored. In 1945, Hahoum was a member of the 109th Regiment of the 28th Infantry division. He approached a Nazi prison camp, prompting guards to run away. Lester recently photographed Hahoum and is adding a section to the Cypress exhibit to include portraits of military veterans. Adding veterans is a natural next step, said Lester, in part, because of the large number of veterans who take classes at Cypress along with the presence of a new veterans' center on campus. Lester is retiring from Cypress after the semester ends in May but said he will continue shooting portraits of Holocaust survivors and adding them to the exhibit. It's rewarding, Lester said. It's an honor to me, beyond belief, that they want to share their stories with me. The third annual Yom HaShoah event at Cypress College is at 7 p.m. April 17 at Cypress College, 9200 Valley View St. with the free event being staged inside the campus theater for the first time. Attendees are required to pre-register at https://bit.ly/2JzQekd. The ceremony also will be streamed live on the Cypress College Facebook page. Lou Ponsi is a contributor to Times Community News.]", "title": "Photographers portraits tell Holocaust survivors stories", "urlToImage": "http://www.latimes.com/resizer/K6TdmTcI03jTpK_Bii3R4AtnlH8=/1200x0/www.trbimg.com/img-5acec509/turbine/tn-wknd-et-holocaust-remembrance-20180412"}], "https://patch.com/massachusetts/barnstable-hyannis/police-officer-shot-barnstable-reports": [{"author": "Mike Carraggi", "description": "A Yarmouth, Massachusetts, police officer was reportedly shot and killed while serving a warrant in Barnstable.", "publishedAt": "2018-04-13T02:11:08Z", "source": "Patch.com", "text": "[BARNSTABLE, MA A Cape Cod K-9 officer was shot and killed Thursday in Barnstable while serving a warrant to a career criminal with more than 100 priors. State Police said Yarmouth officer Sean Gannon, 32, was pronounced dead at Cape Cod Hospital. The shooting happened in on Blueberry Lane in the village of Martsons Mills. Gannon's police dog was injured. Its condition is unknown. The suspect, 29-year-old Thomas Latanowich, of Somerville, was taken into custody after a standoff. Police said he will be charged with murder. Latanowich was the subject of the warrant being served. Yarmouth and Barnstable police frequently team up while serving warrants. Latanowich has more than 111 charges on his record. He was arrested in December after allegedly stabbing a man who had just been released from prison. At the time, Yarmouth Lt. Steven Xiarhos called him a notorious and violent criminal. Law enforcement agencies from Massachusetts and beyond expressed their condolences over social media. Rest easy brother, we have the watch from here, the Wareham Department of Natural Resources wrote over Facebook. Our hearts are heavy as our thoughts turn to our brothers and sisters of the Yarmouth Police Department during this most difficult time, Seekonk Police tweeted. Falmouth police tweeted, Our thoughts and prayers are with the fallen Yarmouth Police Officer's family and friends, as well as the members of the Yarmouth Police Dept. and Cape Cod Regional Law Enforcement Council SWAT Team. We ask that you also keep them in your prayers. This is a map of Blueberry Lane:, Patch welcomes contributions and comments from our users. We strive for civil, enlightened discussions on Patch stories and local issues. Please abide by our posting standards:, Users who violate our posting rules will have their comments blocked or deleted. Users who flagrantly violate our standards can be banned at the moderator's discretion. Swipe for more from Patch ]", "title": "Cape Cod Police Officer Gunned Down  Barnstable, MA Patch", "urlToImage": "https://cdn20.patchcdn.com/users/22874714/20180412/042351/styles/T800x600/public/processed_images/newsalert-2-1523564536-6469.jpg"}], "https://www.cnn.com/2018/04/12/politics/kevin-mccarthy-donald-trump-steve-scalise/index.html": [{"author": "Analysis by Chris Cillizza, CNN Editor-at-large", "description": "When then-House Speaker John Boehner abruptly announced his resignation in September 2015, the assumption among many people was that Kevin McCarthy would easily step into the vacuum.", "publishedAt": "2018-04-12T20:53:00Z", "source": "CNN", "text": "[Analysis by Chris Cillizza, CNN Editor-at-large, Updated 4:53 PM ET, Thu April 12, 2018 Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds. (CNN)When then-House Speaker John Boehner abruptly announced his resignation in September 2015, the assumption among many people was that Kevin McCarthy would easily step into the vacuum. ]", "title": "How red and pink Starburst might make Kevin McCarthy the next House speaker - CNNPolitics", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/121018011218-candy-starbursts-story-top.jpg"}], "https://www.cnn.com/2018/04/12/politics/mexican-cartel-leader-fugitive-wanted-reward-dea-agent/index.html": [{"author": "David Shortell, CNN", "description": "US law enforcement officials announced a $20 million reward Thursday for the newest member of the FBI's Top Ten Most Wanted Fugitive list, Mexican drug lord Rafael Caro Quintero.", "publishedAt": "2018-04-13T01:47:14Z", "source": "CNN", "text": "[By David Shortell, CNN, Updated 10:03 PM ET, Thu April 12, 2018 Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds. Washington (CNN)US law enforcement officials announced a $20 million reward Thursday for the newest member of the FBI's Top Ten Most Wanted Fugitive list, Mexican drug lord Rafael Caro Quintero. ]", "title": "Reward announced for fugitive cartel leader charged in murder of DEA agent - CNNPolitics", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/180412203642-rafael-caro-quintero-photo-super-tease.jpg"}], "https://www.npr.org/sections/thetwo-way/2018/04/12/602023664/arizona-governor-agrees-to-20-percent-raise-for-protesting-teachers": [{"author": "Vanessa Romo", "description": "Gov. Doug Ducey gave in to some of the educators' demands and promised to boost teacher salaries in increments three years.", "publishedAt": "2018-04-13T00:34:26Z", "source": "Npr.org", "text": "[ Vanessa Romo Arizona Gov. Doug Ducey on Thursday announced a 20 percent pay raise by the 2020 school year. Bob Christie/AP hide caption, Arizona Gov. Doug Ducey on Thursday announced a 20 percent pay raise by the 2020 school year. Updated at 10:20 p.m. ET, Arizona Gov. Doug Ducey has given in to demands for pay raises for teachers, who have been conducting a month of protests at the state Capitol and at schools. He has proposed to boost teacher salaries 20 percent by 2020. The Associated Press notes that the educators were also seeking increased pay for support professionals, a permanent raise structure, and a freeze on corporate tax cuts until per-pupil spending reaches the national average. Ducey's proposal didn't include more spending on those items. At least one teacher, as quoted by the Associated Press, wasn't satisfied:, 'What he gave us today was just a proposal, it wasn't legislation, and we don't know where the money's coming from and we don't know if he's talking about everybody involved in education or just classroom teachers,' Tucson teacher and Arizona Educators United organizer Derek Harris said. 'There so many more of us that need it than just classroom teachers.' The governor's action came as the teachers were threatening a walkout over low pay. On Wednesday, Arizona teachers staged a statewide walk-in, demanding an increase in pay and more funding for schools overall. And, organized by a recently formed advocacy group, Arizona Educators United, teachers had also discussed the possibility of staging a walkout if Republican lawmakers refused to reinstate about a $1 billion in cuts in state education funding over the last decade. The governor's proposal includes a 9 percent increase that would go into effect this fall, bringing the median teacher salary in Arizona to $52,725. Ducey also pledged to give teachers a 5 percent increase in the fiscal year 2020 budget, and another 5 percent in the year after that. Those increases, coupled with the 1 percent increase teachers were given last year, would add up to the 20 percent raises and make the average teacher salary $58,130, Ducey said. As Casey Kuhn, reporter for NPR member station KJZZ wrote, Arizona teachers are among the lowest paid in the country, according to federal data. Average salaries last year were actually $8,000-$9,000 less than 1990 salaries when adjusted for inflation. Meanwhile, Oklahoma teachers on strike now are rethinking their strategy after a nine-day walk out. The head of the state's largest teacher's union, Oklahoma Education Association President Alicia Priest is calling for the group to shift tactics and focus on electing pro-education candidates to the State Legislature. The Two-Way is the place to come for breaking news, analysis and for stories that are just too interesting or too entertaining to pass up. Get in touch with your questions, comments and leads. NPR thanks our sponsors, Become an NPR sponsor]", "title": "Arizona Governor Agrees To 20 Percent Raise For Protesting Teachers  The Two-Way  NPR", "urlToImage": "https://media.npr.org/assets/img/2018/04/12/ap_18103000837920_wide-2e9a1c49df47d23572a0a3ff1838d6e95d7827c9.jpg?s=1400"}], "https://www.nytimes.com/2018/04/12/us/oklahoma-teachers-strike.html": [{"author": "Dana Goldstein and Elizabeth Dias", "description": "For the second time in recent weeks, a teacher walkout has ended with educators extracting some concessions. Ultimately, Republican lawmakers stood firm against more.", "publishedAt": "2018-04-13T00:51:40Z", "source": "The New York Times", "text": "[Advertisement, By DANA GOLDSTEIN and ELIZABETH DIASAPRIL 12, 2018, Saying it had achieved all that it could with a walkout, Oklahomas largest teachers union on Thursday called for educators to return to the classroom and to shift their efforts to supporting candidates in the fall elections who favor increased education spending. At a news conference, Alicia Priest, president of the Oklahoma Education Association, characterized the nine-day walkout as a victory for teachers, even as it fell short of its goals. In a deep-red state that has pursued tax and service cuts for years, teachers won a raise of about $6,000, depending on experience, while members of schools support staff will see a raise of $1,250. But the biggest pieces of legislation passed before the walkout, not during it, and Ms. Priest acknowledged that many of the protesters demands for more schools funding would not be met, because, she said, Republicans in the State Senate would not consider additional revenue sources. Advertisement, We got here by electing the wrong people to office, Ms. Priest said. We have the opportunity to make our voices heard at the ballot box. Advertisement, Teachers had initially demanded the repeal of a capital-gains tax exemption, which applies to wealthy individuals. Instead, many of the new taxes will be paid by average Oklahomans. To fund the measures, as well as some limited new revenues for schools, the Republican-controlled Legislature and Gov. Mary Fallin instituted new or higher taxes on oil and gas production, tobacco, motor fuels, and online sales. The state will also allow ball and dice gambling, which will be taxed. The big win happened before the walkout started, said Brent Bushey, executive director of the Oklahoma Public School Resource Center, which provides administrative services for small school districts. It is a short-term win, but my focus is how do we turn this into a long-term focus on education. Gregg Garn, the dean of the college of education at the University of Oklahoma, said that who won or lost is yet to be determined. The teachers clearly were able to make some good strides, he said. In the long run, if candidates that support education get elected, thats what will determine who won or lost. Some teachers seemed ambivalent about ending the walkout. I dont want to say I agree 100 percent with us stopping this walkout, but I do understand, said Cory Williams, a teacher at George Washington Carver Middle School in Tulsa, who participated in days of protests at the Capitol. We are going to get to the point where it is an unstoppable force meets an unmovable object. It is hard to fight against that without changing your tactics. The recent wave of teacher protests, which has rocked several conservative states, began this year in West Virginia, where teachers won a $2,000 raise from lawmakers. The outcome of the struggle in Oklahoma was being watched carefully in Kentucky, where some school districts will be closed on Friday as teachers demonstrate in favor of education funding, as well as in Arizona, where a teacher movement calling itself #RedforEd is demanding raises and more money for schools. In Arizona, Gov. Doug Ducey, under pressure from teachers who have threatened a walkout, announced on Thursday a plan to provide teachers with a raise by 2020, which he said could be accomplished without raising taxes. Advertisement, In Oklahoma, some rank-and-file educators expressed displeasure on social media that the union was calling off the walkout, and were discussing whether teachers could continue the work stoppage on their own. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. View all New York Times newsletters. Nevertheless, the new taxes in Oklahoma represent a victory for teachers in a state that, over the last decade, has pursued some of the deepest tax and public-service cuts in the nation. The oil and gas industry, long favored in the state, was among the groups disappointed by the new taxes. Chad Warmington, president of the Oklahoma Oil &amp; Gas Association, said the industry supported an increase in education funding, but should not have been made to shoulder the burden. He said that because oil and gas prices are volatile, the new production tax was a raw deal for teachers and pointed to other areas where taxes could have been raised. Oklahoma has eliminated $1 billion in personal income tax, he said, referring to some estimates of lost state revenue from cuts in recent years. But he added, I dont think theres political will to do a personal income tax hike. Allies of the industry may try to introduce a ballot referendum to reverse the increase in production taxes. As in West Virginia, rank-and-file teachers started the walkout movement by organizing on Facebook, at first without much help from unions. The Oklahoma Education Association gave legislators until late April to provide new revenues or face a walkout, but teachers protested and pushed the union to adopt an April 1 deadline. In Oklahoma, union membership is optional for teachers. Still, the large rallies, marches and lobbying that developed around the walkout would not have been possible without the muscle of state and national labor organizations. Parents, too, participated in protests. Lanae DeArman of Sulphur, Okla. joined picketing teachers at the Capitol, lobbying her representatives to raise taxes to fund education. She had never been involved in politics before, she said, but the condition of her three childrens schools aging textbooks, broken furniture drove her to act. It has gone too far, she said of the states tax cuts. You want to be able to keep what you make, but wheres the line? I myself, personally, would be willing to pay a little more if it meant adequate funding for our schools. Advertisement, Ms. DeArman said she planned to vote this year and would be carefully considering candidates education platforms. Randi Weingarten, president of the American Federation of Teachers, which represents educators in Oklahoma City, said the movement could shake up national politics. A lot of people in these states, including some of our teachers, voted for Trump, she said. Now, she added, unions hope to spread the message that conservative policies lead to the school budget cuts that teachers and parents have been protesting. The not-so-sleeper issue in this next election is public education, Ms. Weingarten said. A version of this article appears in print on April 13, 2018, on Page A12 of the New York edition with the headline: Protest in Oklahoma Ends, but Without Adding to Modest Gains in Funding. Order Reprints| Today's Paper|Subscribe, Were interested in your feedback on this page. Tell us what you think. Go to Home Page ]", "title": "Oklahoma Teachers End Walkout After Winning Raises and Additional Funding - The New York Times", "urlToImage": "https://static01.nyt.com/images/2018/04/10/us/00oklahoma/00oklahoma-facebookJumbo.jpg"}], "https://www.nytimes.com/2018/04/12/us/politics/mike-pompeo-secretary-state.html": [{"author": "Gardiner Harris and Eileen Sullivan", "description": "At Mike Pompeo’s confirmation hearing, he set a tone of forceful diplomacy, saying he would take a tough line against Russia and push to improve the Iran nuclear deal.", "publishedAt": "2018-04-13T00:19:00Z", "source": "The New York Times", "text": "[Advertisement, By GARDINER HARRIS and EILEEN SULLIVANAPRIL 12, 2018, WASHINGTON President Trump has in his first year marginalized American diplomats, sought to slash the State Departments budget and reversed crucial pieces of his predecessors economic and diplomatic opening to Cuba. But Mike Pompeo promised on Thursday to reverse nearly all of that if he becomes the next secretary of state. In five hours of testimony before the Senate Foreign Relations Committee, Mr. Pompeo, now the C.I.A. director, said he was hoping for a diplomatic solution to the North Korean nuclear crisis, still believed that the Iran nuclear deal could be saved, disagreed with the presidents assertion that poor relations with Russia had been caused by the special counsels investigation and, perhaps most remarkably, promised to defend gay rights around the world. He was voluble, charming and gracious, which meant he was the opposite of how he had presented himself during the 2015 Benghazi hearings, the last time he had the nations attention. Then, he was the scowling, scathing attack dog hounding Hillary Clinton. On Thursday, he smiled throughout the hearing, occasionally even agreeing with Democrats. At the State Department, there are too many holes, too many vacancies, too many unfilled positions, Mr. Pompeo said in one of his many promises to restore the department to its former glory after his predecessor, Rex W. Tillerson, pushed out hundreds of diplomats. The vow was greeted with relief by nearly all on the panel. Advertisement, Under persistent questioning, Mr. Pompeo said he had spoken to Robert S. Mueller III, the special counsel investigating Russias meddling in the 2016 election. But Mr. Pompeo refused to describe what he had said, maintaining that he was at the hearing to discuss foreign policy. Advertisement, His testimony in both tone and substance was so different from his past statements and profile as a Tea Party congressman from Wichita, Kan. that Democrats on the committee were left puzzled and, almost despite themselves, delighted. Gone was any hint of the warmonger his critics have portrayed him as. At one point, Senator Benjamin L. Cardin, Democrat of Maryland, turned to Senator Bob Corker, the committees chairman and a Tennessee Republican, and said: Mr. Chairman, if I could, I would like to compliment the nominee for giving concise answers. Its refreshing to have a nominee who really answers our questions. Senator Robert Menendez, Democrat of New Jersey, summarized the Democrats dilemma. As we close here, Im trying to think about which of the Mike Pompeos that Im asked to vote on, he said. Is it the one that today said the solution to preventing Iran from obtaining nuclear weapons is through diplomacy, which I would agree, or is it the one that said the only way to do that in my judgment is a regime change in a speech of 2015. Mr. Corker promised to avidly support Mr. Pompeos confirmation. But with Senator Rand Paul, Republican of Kentucky, making clear during the hearing that he still opposed many of Mr. Pompeos views, the nomination will not pass the committee without the vote of at least one Democrat. He is still expected to pass the full Senate, however. And nothing he said on Thursday is likely to change that. In a week when Mr. Trump issued a fusillade of tweets about Syria, Russia and China that set a new standard for contradictory and inconsistent policy positions, the senators asked whether Mr. Pompeo would push back against the presidents worst instincts. While at times the president may act or speak impulsively, Mr. Corker said, we have also seen that good counsel has led the president to evolve, from my perspective, to a much better place on a number of important issues. Advertisement, If confirmed, Mr. Pompeo would be the Trump administrations second secretary of state in less than 15 months. In his opening statement, Mr. Pompeo signaled that he planned to harvest a forceful diplomacy. He said he would take a tough line against Russia. And as planning was underway at the White House and the Pentagon for a potential missile strike on Syria in retaliation for a suspected chemical weapons attack against civilians, Mr. Pompeo, a former Army captain, stressed that war is always the last resort. What you need to know to start your day, delivered to your inbox Monday through Friday. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. View all New York Times newsletters. I would prefer achieving the presidents foreign policy goals with unrelenting diplomacy rather than by sending young men and women to war, he said. Despite some surprising comity, the hearing produced tense moments. Senator Cory Booker, Democrat of New Jersey, asked a series of pointed questions about Mr. Pompeos previous denunciations of American Muslim leaders for what he called their silence in response to a terrorist attack. Mr. Pompeo replied that he believed Islamic religious leaders had a particular opportunity to denounce terrorism by Muslims, rather than a responsibility. Mr. Booker agreed that silence in the face of injustice lends strength to that injustice. However, he took issue with saying certain Americans I dont care if its Kareem Abdul-Jabbar or Muslims that serve on my staff if theyre in positions of leadership, they suddenly have a special obligation. The senator then pivoted to ask if Mr. Pompeo had denounced anti-Muslim news media personalities he had appeared with, or whether he stood by comments he had made as a congressman that gay sex and same-sex marriage were a perversion. Mr. Pompeo said that he still believed same-sex marriage was inappropriate, but that he supported gay couples in the government. My respect for every individual regardless of sexual orientation is the same, he said. Advertisement, Flagging morale at the State Department was also front and center. Senator Johnny Isakson, Republican of Georgia, noted that Mr. Tillerson had left the department in a blue funk. Mr. Pompeo vowed to raise the departments morale. He diverged from Mr. Tillersons vision for the nations diplomatic corps, telling Senator Todd Young, Republican of Indiana, that he did not foresee any slowing of its mission or reduction in personnel. In one prominent example, Mr. Pompeo suggested that he would return some of the American diplomats who were withdrawn from Cuba last year after they were sickened in what some suspect was a covert attack with Havanas knowledge. Mr. Trump has tightened restrictions on travel and trade with Cuba. Consistent with keeping folks safe, we will build out a team there, Mr. Pompeo told Senator Tom Udall, Democrat of New Mexico, also suggesting that he would push for increased agricultural sales in Cuba. Two sitting senators and former Senator Bob Dole, the longtime Republican leader from Kansas, introduced Mr. Pompeo to the committee and spoke highly of his credentials. Mr. Dole, 94, warmed up the panel. I can see all you people up there, he said. I cant see very well, so you look good. Senator Richard M. Burr of North Carolina, the chairman of the Senate Intelligence Committee, assured his peers that Mr. Pompeo was transparent and a natural fit for the job. I asked Mike to lead the C.I.A. in an ethical, moral and legal manner, Mr. Burr said. And Im here to tell you that he did exactly that. He asked those on the committee to examine Mr. Pompeos nomination on the merits alone. If theres ever one where you put politics aside, this is it, Mr. Burr said. Get politics and Washington news updates via Facebook, Twitter and the Morning Briefing newsletter. A version of this article appears in print on April 13, 2018, on Page A10 of the New York edition with the headline: Trading Snarl for Smile, Pompeo Makes Case to Lead State Dept. Order Reprints| Today's Paper|Subscribe, Were interested in your feedback on this page. Tell us what you think. See More Go to Home Page ]", "title": "Trading Snarl for Smile, Pompeo Makes Case to Lead State Dept. - The New York Times", "urlToImage": "https://static01.nyt.com/images/2018/04/13/us/politics/13dc-pompeo3/13dc-pompeo3-facebookJumbo.jpg"}], "https://www.nytimes.com/2018/04/12/us/politics/trump-pardon-scooter-libby.html": [{"author": "Peter Baker and Maggie Haberman", "description": "The president’s action would wipe out the perjury and obstruction convictions of Mr. Libby, who was Vice President Dick Cheney’s chief of staff.", "publishedAt": "2018-04-13T01:44:28Z", "source": "The New York Times", "text": "[Advertisement, By PETER BAKER and MAGGIE HABERMANAPRIL 12, 2018, WASHINGTON President Trump plans to pardon I. Lewis Libby Jr. who as chief of staff to Vice President Dick Cheney was convicted of perjury in connection with the leak of a C.I.A. officers identity, a person familiar with the decision said on Thursday. Mr. Libbys case has long been a cause for conservatives who maintained that he was a victim of a special prosecutor run amok, an argument that may have resonated with the president. Mr. Trump has repeatedly complained that the special counsel investigation into possible cooperation between his campaign and Russia in 2016 has gone too far and amounts to an unfair witch hunt. Mr. Libby, who goes by Scooter, was convicted of four felonies in 2007 for perjury before a grand jury, lying to F.B.I. investigators and obstruction of justice during an investigation into the disclosure of the work of Valerie Plame Wilson, a C.I.A. officer. President George W. Bush commuted Mr. Libbys 30-month prison sentence but refused to grant him a full pardon despite the strenuous requests of Mr. Cheney, a decision that soured the relationship between the two men. A pardon of Mr. Libby would paradoxically put Mr. Trump in the position of absolving one of the chief architects of the Iraq war, which Mr. Trump has denounced as a catastrophic miscalculation. It also would mean he was forgiving a former official who was convicted in a case involving leaks despite Mr. Trumps repeated inveighing against those who disclose information to reporters. Advertisement, Critics of Mr. Trump quickly interpreted the prospective pardon as a signal by the president that he would protect those who refuse to turn on their bosses, as Mr. Libby was presumed not to have betrayed Mr. Cheney. Mr. Trump has not ruled out pardons in the Russia investigation. Advertisement, Mr. Trump has shown no particular interest in Mr. Libbys case before. In 2015, during his campaign for the White House, Mr. Trump was asked if he would pardon Mr. Libby and declined to say, calling it an irrelevant issue. It was unclear when Mr. Trump would issue the pardon, which was first reported by ABC News. Mr. Libby was not charged with the leak itself and has long argued that his conviction rested on an innocent difference in memories between him and several witnesses, not an intent to deceive investigators. Although Mr. Bushs clemency order kept him from going to prison, Mr. Libbys conviction nonetheless remained intact and he was disbarred as a lawyer as a result. He was not reinstated to the bar until 2016. Among the friends from the Bush administration who have argued that he was unfairly treated is John R. Bolton, an ally of Mr. Cheneys who served as Mr. Bushs ambassador to the United Nations and started this week as Mr. Trumps national security adviser. Other allies of Mr. Libbys include Joseph diGenova and Victoria Toensing, a husband-and-wife team of lawyers who recently talked about going to work for Mr. Trump before deciding against it because of a client conflict. A pardon by Mr. Trump would amount to official forgiveness, not exoneration. A pardon does not signify innocence but does eliminate many consequences of a conviction, such as any effect on the right to vote, hold elective office or sit on a jury. As a practical matter, those seeking pardons hope it will erase or ease the stigma of a criminal conviction. Mr. Libbys prosecution became a symbol of the polarizing politics of the Iraq war during the Bush administration. Ms. Wilsons husband, Joseph C. Wilson IV, was a former diplomat who wrote an op-ed article in The New York Times in 2003 implying that Mr. Cheney ignored evidence that argued against the conclusion that Iraq was actively seeking to build nuclear weapons. To undercut Mr. Wilsons criticism, administration officials told reporters that he had been sent on a fact-finding mission to Niger because his wife worked for the C.I.A. not at the behest of Mr. Cheney. But federal law bars the disclosure of the identities of C.I.A. officials in certain circumstances and the leak prompted a special prosecutor investigation. Charged with lying to investigators about his interactions with journalists, Mr. Libby insisted he simply remembered events differently. But his version of events clashed with the testimony of eight other people, including fellow administration officials, and a jury convicted him. Mr. Bush decided that the prison sentence was excessive, but he said he would not substitute his judgment for that of the jury when it came to the question of Mr. Libbys guilt. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. View all New York Times newsletters. Mr. Libbys advocates argued that Patrick J. Fitzgerald went too far because he had already discovered that the first administration official to disclose Ms. Wilsons identity to a journalist was Richard Armitage, the deputy secretary of state in Mr. Bushs first term, who was not charged. They also argued that Ms. Wilson was not undercover at the time and her employment was well known. Ms. Wilson has denied that she recommended her husband for the mission to Niger and said her career as a C.I.A. official was over in an instant once her identity was leaked. Advertisement, The case tested the limits of journalistic independence. Judith Miller, then a reporter for The Times, went to prison for 85 days rather than disclose that Mr. Libby had discussed Ms. Wilson with her. She was freed after Mr. Libby released her from any promise of confidentiality. The issue became a major point of contention between Mr. Bush and Mr. Cheney in the last days of the administration in late 2008 and early 2009. Mr. Cheney repeatedly pressed Mr. Bush to go beyond his commutation and issue a full pardon, bringing it up so often that the president grew irritated by the matter. Mr. Bush assigned White House lawyers to examine the case, but they advised him the jury had ample reason to convict Mr. Libby and the president rebuffed Mr. Cheneys request. Mr. Bush told aides that he suspected that Mr. Libby had thought he was protecting Mr. Cheney, the real target of the investigation. Mr. Cheney snapped at Mr. Bush. You are leaving a good man wounded on the field of battle, he told him when informed of the decision. Mr. Bush was taken aback. It was probably the harshest thing Mr. Cheney ever said to him during their eight years in office together and was designed to attack Mr. Bushs sense of loyalty to his own troops in a time of war. The comment stung, Mr. Bush wrote in his memoir. In eight years, I had never seen Dick like this, or even close to it. I worried that the friendship we had built was about to be severely strained, at best. The case has its connections to Mr. Trump because the special prosecutor who convicted Mr. Libby, Mr. Fitzgerald, was friends with James B. Comey, who was then the deputy attorney general who assigned him the investigation after the attorney general recused himself. Mr. Cheney long suspected that Mr. Comey was taking revenge for a dispute between them over the legality of a surveillance program. Mr. Comey would go on to become the director of the F.B.I. who was fired by Mr. Trump last year in the midst of the Russia investigation. His dismissal led the deputy attorney general, Rod J. Rosenstein, who was in charge after the recusal of Attorney General Jeff Sessions, to appoint Robert S. Mueller III as special counsel to take over the inquiry. Mr. Trump has been notably conservative about using his clemency power. He has issued only two pardons and commuted only one sentence in nearly 15 months in office, according to the Justice Department. Most notably he pardoned Joe Arpaio, the former Arizona sheriff whose crackdown on illegal immigrants earned him a criminal contempt conviction. Advertisement, His record is roughly in keeping with the last three presidents, Barack Obama, Mr. Bush and Bill Clinton, all of whom issued no pardons or commutations in their first year and a half in office. Emily Cochrane contributed reporting. A version of this article appears in print on April 13, 2018, on Page A1 of the New York edition with the headline: Plan to Pardon Aide Convicted In C.I.A. Leak. Order Reprints| Today's Paper|Subscribe, Were interested in your feedback on this page. Tell us what you think. Go to Home Page ]", "title": "Trump Plans to Pardon Scooter Libby in C.I.A. Leak Case - The New York Times", "urlToImage": "https://static01.nyt.com/images/2018/04/13/us/13dc-Libby/13dc-Libby-facebookJumbo.jpg"}], "https://www.politico.com/story/2018/04/12/pruitt-epa-security-chief-spending-pasquale-perrotta-480825": [{"author": "EMILY HOLDEN", "description": "'He’ll do anything to satisfy his boss,' one former staffer says of Secret Service agent turned EPA official Pasquale Perrotta.", "publishedAt": "2018-04-13T00:23:32Z", "source": "Politico", "text": "[Energy &amp; Environment, 'Hell do anything to satisfy his boss,' one former staffer says of Secret Service agent turned EPA official Pasquale Perrotta. By EMILY HOLDEN and ALEX GUILLN, 04/12/2018 08:13 PM EDT, Scott Pruitts spending, relationships with industry lobbyists and reputation for excessive secrecy have generated calls for his firing from Democratic lawmakers, some Republicans and even White House staff. | Brendan Smialowski/AFP//Getty Images, Environmental Protection Agency Administrator Scott Pruitt has had a willing partner in pushing for his massive spending on bodyguards and first-class flights, current and former EPA officials say the Secret Service veteran who heads his security detail. Pasquale Nino Perrotta played a key role in the investigation into mobster John Junior Gotti in the 1990s, and hes boasted of his exploits with women, firearms and luxury watches in a self-published autobiography. Now hes running security for the nations top environmental regulator like a lavishly funded SWAT team, according to interviews with seven people who have worked with him under both the Trump and Obama administrations. Story Continued Below, The current and former staffers say that rather than acting as a restraint on Pruitt, who came into the agency a year ago demanding round-the-clock bodyguards, Perrotta has instead egged him on indulging his requests for a 19-person security detail, high-performance SUV, $43,000 soundproof booth and bug-sweep of his offices, as well as first-class flights to limit his exposure to potential threats from fellow passengers. Perrotta has even barred all but a select group of agency employees from entering rooms and corridors near Pruitts offices, according to Ron Slotkin, a career official who recently retired as director of the EPA's multimedia office. Perrotta has also accompanied Pruitt on flights and offered him advice on environmental policy and other agency matters, according to two of the sources. Slotkin said Perrotta and others around Pruitt strained repeatedly against any restrictions on their activity, including longstanding federal limits on spending and conduct. They would object to anything when we said, No, you cant do that or That would be wrong, Slotkin said. He added: Wed say, Its not a matter of legality, its ethics, its the way things look. But they went out of their way to do something different. The source for energy and environment news weekday mornings, in your inbox. By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time. Now Perrottas own ethics are drawing scrutiny from members of Congress looking into Pruitts actions. Five Democratic lawmakers alleged in a letter sent to President Donald Trump on Thursday that EPA issued at least one contract to an employee of Perrottas private security firm, and that other contracts may have gone to Perrottas friends or associates, based on allegations from former agency deputy chief of staff Kevin Chmielewski. Chmielewski, a former Trump campaign aide, has told lawmakers EPA fired him after he refused to retroactively approve first-class travel for one of Pruitts closest aides, former agency policy chief Samantha Dravis, according to the letter from Democrats including Sens. Tom Carper of Delaware and Sheldon Whitehouse of Rhode Island. He also told the lawmakers that Perrotta threatened to go to his home to seize his EPA parking pass adding that he didnt give a f--- who might be listening to their phone call. Perrotta did not respond to multiple requests for comment. Agency spokesman Jahan Wilcox defended EPA's decisions on Pruitt's security arrangements, calling them similar to security protocol across the federal government. He added that the agency had done similar security sweeps for former President Barack Obama's two EPA administrators, Lisa Jackson and Gina McCarthy. According to EPAs Assistant Inspector General, Scott Pruitt has faced an unprecedented amount of death threats against him and security decisions are made by EPAs Protective Service Detail, Wilcox said in a statement. Americans should all agree that members of the Presidents cabinet should be kept safe from these violent threats. Pruitts spending, relationships with industry lobbyists and reputation for excessive secrecy have generated calls for his firing from Democratic lawmakers, some Republicans and even White House staff. But he still has at least a public champion in Trump, who tweeted last weekend that Scott is doing a great job. To the contrary, the current and former agency employees say Pruitt has fostered an atmosphere of chaos, mistrust and disregard for optics and that Perrotta has been a crucial part of it. Several said Perrottas personality and Pruitts expectations are both probably driving EPAs security spending, adding that other key aides have signed off on the administrators expenses either willingly or begrudgingly. Hell do anything to satisfy his boss, said one departed career staffer. Perrotta was born to Italian immigrants in New York and has spent his life in law enforcement, including in the Secret Service, where he said he protected presidents and dignitaries and investigated financial and organized crimes, according to Dual Mission, the autobiography he self-published in 2016. In the book, he calls himself completely misunderstood by most, including family, friends and coworkers, in large part because of his high level of energy. Former and current colleagues have described Perrotta as rigidly loyal but also enthusiastic to push boundaries to get what he wants an impression his book supports. He recalls creatively finding ways to show probable cause to get warrants, providing financial incentives to police, and making sources of female friends, showering them with gifts that I was easily able to afford. Perrotta said he also let women hold his government-issued firearm in romantic situations. It was, in some ways, like a dangerous, forbidden sex toy to some, and I played right along, he recalled. By ANTHONY ADRAGNA, He said he liked the finer things, including a Rolex Submariner watch that he wore in his youth. When working for the Secret Service in Bulgaria, he wrote, he dressed more like a gangster than law enforcement, clad in square-toed, black biker boots and a black, Italian-made turtleneck sweater with a .380 Sig gun tucked underneath. He joined EPA in 2004. That eventually brought him into Pruitts orbit. Pruitt, a former Oklahoma attorney general, had built a reputation in conservative Republican circles for his frequent lawsuits against the EPAs Obama-era regulations, putting him at odds with much of the agencys workforce. And his penchant for lavish spending was documented even before he arrived in Washington: An audit in Oklahoma showed that expenses at the attorney general's office surged during his tenure compared with his predecessors, The Intercept reported Thursday. When Pruitt arrived at EPA after his confirmation in February 2017, his transition team had already made it clear that he expected around-the-clock security, a former agency employee who was there at the time said. A week after Pruitt's first day at the agency, top staffers had a meeting on 24/7 security, according to calendars obtained by the watchdog group American Oversight. Chief of staff Ryan Jackson met for half an hour with security officials including Henry Barnet, the director of the criminal enforcement office where Pruitts security detail is housed. Perrotta was soon promoted to replace a career staffer who had pushed back on the administrators desire to use sirens to navigate D.C. traffic. He quickly developed a close relationship with Pruitt. As head of Pruitts security detail, Perrotta has been instrumental in decisions for him to fly only first-class, upgrade to a souped-up SUV and have his office swept for bugs, a former Trump administration official said. Perrotta has also overseen Pruitts 19-person crew of bodyguards, which is three times the size of the team that protected McCarthy and offers 24/7 protection that exceeds what most Cabinet members receive. Mr. Pruitt thinks hes the president of the United States, said the first former career staffer. Hes big on image. The office sweep for listening devices which was conducted by a company linked to Perrotta rankled some career staffers and led to a scuffle between Perrotta and a member of the agencys homeland security office at a meeting last summer, The New York Times reported Thursday. Despite EPA's argument that Pruitt has received a record number of death threats, an internal report from the agencys Office of Homeland Security suggests that the threats mainly consist of letters and criticism on social media that dont warrant such blanket protection. (On Tuesday, the agency dismissed a staffer who had signed off on the memo and argued with Perrotta, for what it insists were issues dating back several years.), But several current and former EPA staffers say they also consider the security fears overblown. We never saw any threat, never heard any threat, said Slotkin, the former multimedia director. If anything, it came from Pruitt, we would hear him speak about it. But there was no evidence that anybody could even get near him. That included many EPA employees: Slotkin said Perrotta cordoned off Pruitts suite of offices inside EPAs headquarters at Federal Triangle, posting security guards to keep out anyone who wasnt on an approved list. One restricted area was a chandelier-decorated conference room named after environmentalist Rachel Carson where agency employees had previously been allowed to hold events, Slotkin said. By ALEX GUILLN, He didnt want anybody near him, Slotkin said. Soon Perrotta was flying with Pruitt and discussing matters that went beyond security, two former employees said. It wasnt uncommon that given travel and Ninos proximity, he would always weigh in on matters beyond his scope as security, leveraging his institutional knowledge, one said. He often would say what he recalled prior administrators doing. By the spring of last year, Perrotta was regularly attending travel planning meetings with top political staff, including a March 30 international scheduling discussion and an April 10 talk on international travel, according to EPA records. He and other security agents were closely involved in planning in May for a trip the following month to Italy, where Pruitt visited the Vatican and then attended G-7 environment meetings in Bologna. Perrotta had lived for two years in Rome on Secret Service assignment, where he made many connections, according to his book. Wilcox said the security arrangements on the Italy trip were not novel. EPAs Protective Service Detail tried to replicate the same security measures taken when EPA Administrator Gina McCarthy traveled to Italy in 2015, he wrote. Thursdays congressional letter offered a new detail about Perrotta: The Democratic senators said Chmielewski reported that Perrotta entered into a $30,000 contract with private Italian security personnel for that trip. Records have revealed that expense but did not disclose whether it was for a private detail. One of the former EPA staffers said Perrotta was friends with those guards. That source described Pruitts protection while in Italy as extensive, with security agents from EPA and the U.S. Embassy, in addition to a large group of local agents. News reports have revealed Pruitt also had a soundproof booth constructed for his office and considered having bulletproof desks installed. And the spending isnt over. EPA also appears to be planning to purchase bulletproof vests specially designed to blend in underneath regular clothing for his security detail, according to a solicitation issued on Friday. The solicitation calls for 16 white-colored vests of varying sizes manufactured by Velocity Systems, along with corresponding armor made of special threat enhanced steel and cummerbunds that provide enhanced protection. The armor requested is just over a quarter-inch thick and can protect against the type of bullets shot from AK-47 rifles and some AR-15 semi-automatics, according to Velocity Systems' website. EPA would not confirm to POLITICO whether the armor is for Pruitts protective detail or for other agents, saying only that all agents in EPA's criminal enforcement division, which includes Pruitts detail, are assigned bulletproof vests and that the effectiveness of the vests expires every five years. But a source familiar with EPAs security operations said the vests are likely for Pruitts bodyguards because of their unusual specifications and the number requested. Other enforcement agents wouldnt need their vests to be concealed, that source said. Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning in your inbox. By William Pesek, By Caitlin Emma, By Mieke Eoyang, By Renato Mariotti, 2018 POLITICO LLC]", "title": "Pruitts security chief goaded spending, employees say - POLITICO", "urlToImage": "https://static.politico.com/fd/f9/5d55189c47e4b28cd804edb0789c/180412scottpruittgettyimages-691611076.jpg"}], "https://www.politico.com/story/2018/04/12/trump-love-child-rumor-media-519213": [{"author": "MICHAEL CALDERONE", "description": "AP acknowledges spiking and then reviving a story of how The National Enquirer paid off a Trump tipster.", "publishedAt": "2018-04-12T21:42:37Z", "source": "Politico", "text": "[Media, AP acknowledges spiking and then reviving a story of how The National Enquirer paid off a Trump tipster. By MICHAEL CALDERONE, 04/12/2018 05:36 PM EDT, The odd spectacle of news organizations both acknowledging their restraint in reporting a story, but then competing to put it out seemed to illustrate the medias challenges in the Trump era. | Gregg Newton/AFP/Getty Images, The story of how The National Enquirers owner bought and spiked a story about an alleged Donald Trump love child is now roiling the media world, as The Associated Press acknowledged having decided not to publish it last August, before turning around and doing so on Thursday morning. Other outlets now admit they, too, had worked on the story before backing off. Meanwhile, The New Yorker rushed to publish its own version right after the AP. And Radar, a gossip site that shares an owner with the Enquirer, attempted to head off both outlets by publishing a piece casting doubt on the claims of a disaffected former Trump employee. Story Continued Below, The odd spectacle of news organizations both acknowledging their restraint in reporting a story, but then competing to put it out seemed to illustrate the medias challenges in the Trump era, in which salacious allegations are often bandied about, while the efforts of the president and his allies to control the media narrative are often news in themselves. Publishing a story on a payment made to hush a rumor that may be accurate, partly accurate or not accurate at all is not an easy call, and we were aware that other news orgs struggled with it before not publishing, said AP reporter Jeff Horwitz, who reported the story last summer. Were glad the storys out. That story took an odd path from the kill file to the news wire, complete with tension-filled decisions along the way. In August, AP Executive Editor Sally Buzbee informed colleagues on a conference call that their monthslong investigation into how the Enquirer-parent company American Media Inc. had bought and squashed the love-child story during the 2016 election would not be published. The decision frustrated many in the newsroom who believed the APs story, buttressed by extensive sources and documentation, was rock solid and clearly newsworthy. Horwitz even left the AP newsroom for several days after the decision before being persuaded by management to return, according to multiple sources familiar with the matter. Your guide to the media circus weekday mornings, in your inbox. By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time. Horwitzs story, co-written with colleague Jake Pearson, was finally published around 1 a.m. Thursday. They reported that American Media Inc. paid $30,000 to Dino Sajudin, a former doorman at a Trump building, for the rights to a rumor that Trump had fathered a child decades back with a former employee. Sajudin could be forced to pay $1 million if he broke the agreement, they reported. The New Yorkers Ronan Farrow followed up just a couple hours later with his own detailed story on the payment to Sajudin. Both the AP and The New Yorker reported that Michael Cohen, Trumps personal lawyer, had some involvement in the situation between the magazine and Sajudin. However, AMI denied Thursday that Trump or Cohen had anything to do with its decision not to pursue a story about a love child that it determined was not credible. Cohen is in the spotlight this week as FBI agents raided his home and office, reportedly in search of records of payments to two women who have alleged to have affairs with Trump: Stormy Daniels and Karen McDougal. Cohen has admitted to paying Daniels $130,000 shortly before the election for her silence; American Media Inc. paid McDougal $150,000 for her story during the 2016 race but did not publish it. The FBI has reportedly also sought Cohens correspondence with David Pecker, a Trump friend and CEO of AMI, and AMI chief content officer Dylan Howard. Farrow also reported that representatives from the AP met with AMIs legal team last summer as the news organization seemed poised to publish the story. A source with knowledge of the matter said the meeting took place on July 13, 2017 and included Buzbee, the APs general counsel and AMIs representatives and that it had been preceded by tense exchanges between the two sides. Buzbee eventually spiked the story nearly a month after that meeting, though maintains her decision wasnt motivated by any pushback. We frequently face intense pressure from outsiders attempting to influence our journalism and we do not back down, Buzbee said in a statement. No outside pressure drove this decision in any way. After robust internal discussion, AP news leaders determined that the story at the time did not meet AP's rigorous sourcing requirements, despite strong and persistent reporting by our journalists, she added. law and order, By RENATO MARIOTTI, Horowitz told POLITICO that the AP spent a long while reporting out the details of The National Enquirers deep-sixing of Trump stories, and the bigger picture of how it weighed into the 2016 election. Indeed, the AP and New Yorker each made clear in their stories there isnt evidence to support the love-child rumor and their focus was on Trumps relationship to AMI and the capture and kill practice of removing potentially damaging stories from circulation. Buzbee cited the recent news about the FBI raid and the McDougal payment as having bolstered the previous AP reporting. Now, she added, the story met our standards and we published it. Other news outlets, including The New York Times and The Wall Street Journal, had also chased the story. The Journal first reported on AMI buying McDougals story days before the 2016 election and broke the news in January that Cohen arranged for the payment to Daniels. The paper had investigated the love-child story as well, but didnt publish it. We investigated the paternity claim and what we found did not meet our high standards for fair and accurate reporting, a Journal spokesman told POLITICO. The spokesman noted that the Journal published the McDougal and Daniels stories in the face of substantial pushback. New York Times Executive Editor Dean Baquet declined to discuss the papers handling of the story. We have been very aggressive and competitive on this story, he said. But as a rule we don't talk about reporting that hasn't been published. (The Times did run a front-page story Thursday on how the Enquirer has been swept up in the federal probe of Cohen, though didnt mention the payment to the doorman.) As the AP and New Yorker neared publication, AMI-owned Radar published its story on the payment: Prez Love Child Shocker! Ex-Trump Worker Peddling Rumor Donald Has Illegitimate Child. By MATTHEW NUSSBAUM and LOUIS NELSON, Farrow wrote that the Radar story went online a half hour after he approached AMI for comment for his story. The Radar piece noted Farrow was calling inside the company. It also included documentation about the payment as well as results of Sajudins polygraph. His passing the test indicates he is being truthful about hearing the rumor, but doesnt substantiate it. In a Thursday statement, Sajudin said he was instructed not to criticize President Trump's former housekeeper due to a prior relationship she had with President Trump which produced a child. He did not say who had instructed him, or offer any further details of his agreement with AMI. Howard defended the Enquirers handling of the rumor on Thursday and took a shot at news organizations scrutinizing its actions. It is a disconcerting view of the level of hysteria and partisanship in American politics that not reporting a story that multiple media outlets have now also confirmed to be untrue has become headline news, he said. Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning in your inbox. By William Pesek, By Caitlin Emma, By Mieke Eoyang, By Renato Mariotti, 2018 POLITICO LLC]", "title": "How a Trump love child rumor roiled the media - POLITICO", "urlToImage": "https://static.politico.com/17/c4/9c545fdf4ae09e8e02524caa6a53/media-cameras-gty.jpg"}], "https://www.usatoday.com/story/sports/wnba/2018/04/12/aja-wilson-top-pick-of-wnba-draft-by-las-vegas-aces/33784893/": [{"author": null, "description": "South Carolina's A'ja Wilson was the top pick in the WNBA draft by the Las Vegas Aces. Ohio State's Kelsey Mitchell went second to the Indiana Fever.", "publishedAt": "2018-04-13T00:11:18Z", "source": "USA Today", "text": "[, Settings, Cancel, Set, Hi Already a subscriber. Subscribe to USA TODAY, Already a print edition subscriber, but don't have a login. Manage your account settings. Support, Log Out, Get the news, Let friends in your social network know what you are reading about, South Carolina's A'ja Wilson was the top pick in the WNBA draft by the Las Vegas Aces. Ohio State's Kelsey Mitchell went second to the Indiana Fever. A link has been sent to your friend's email address. A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQs, A'ja Wilson poses with WNBA president Lisa Borders after being selected as the No. 1 overall pick by the Las Vegas Aces.(Photo: Julie Jacobson, AP), NEW YORK (AP) A'ja Wilson is thrilled for the chance to head to Las Vegas. The South Carolina star was the No. 1 pick in the WNBA draft by the Aces on Thursday night. It's such a great feeling, just an amazing way to cap off my collegiate career, Wilson said. My heart was pounding before she announced the pick. The 6-foot-5 star admitted she has only been there once, but already knows the Nevada city slogan. What happens in Sin City stays in Sin City, Wilson said laughing. The Aces, who moved to Las Vegas from San Antonio this past winter, had the first pick for the second straight season. Ohio State's Kelsey Mitchell went second to the Indiana Fever. Indiana also took Victoria Vivians with the eighth pick, giving coach Pokey Chatman a strong young core to build around. The Chicago Sky took Diamond DeShields, who spent the season playing professionally in Turkey, and Gabby Williams of Connecticut with the next two picks. I'm excited to see what we can do, DeShields said. The #1 moment for the #1 overall pick, @_ajawilson22! pic.twitter.com/hnLICPbS6D, UCLA guard Jordin Canada was selected fifth by the Seattle Storm. She'll get a chance to learn from Sue Bird. I love Sue Bird, she's one of my role models, Canada said. Azura Stevens, who decided to forego her final year of eligibility at UConn, was taken sixth by Dallas. Washington drafted Ariel Atkins of Texas seventh. Lexie Brown was picked ninth by Connecticut. New York took Kia Nurse 10th, marking the third UConn player to be taken in the opening round. It's the second time in three seasons that three Huskies were drafted in the first round. UConn players went 1-2-3 in 2016. It's really cool that we were all here for each other, Williams said. Los Angeles drafted 19-year-old Russian star Maria Vadeeva with the 11th pick. She's the first foreign player who didn't play at an American college to be taken in the first round since 2012. Marie Gulich of Oregon State was drafted by Phoenix to close out the first round. UCLA's Monique Billings was the final player invited to the draft to be taken. She went with the 15th pick to Atlanta. The Dream had traded for that pick earlier in the day sending Bria Holmes to the Connecticut Sun. I wasn't nervous, I knew that I would be drafted, Billings said. The draft was held at Nike's New York headquarters. The athletic apparel company is a global partner and outfitter for the WNBA this season. They unveiled the new WNBA uniforms earlier Thursday. Training camps open up on April 29 and the 22nd season of the WNBA begins play on May 18. Other tidbits from the draft:, PRESIDENTIAL CONNECTIONS: Former President Barack Obama's niece, Leslie Robinson, was taken in the third round by the New York Liberty. Her dad is vice president of player development and G League operations for the Knicks. GREEK SISTERS: When Wilson was took a picture with WNBA President Lisa Borders on stage, the pair flashed the Alpha Kappa Alpha sign. The two were sorority sisters with Borders graduating from Duke and Wilson from South Carolina. Kappa Alpha Kappa was the first African American sorority starting at Howard in 1908. ALL IN THE FAMILY: DeShields joined her father (Delino) and brother (Delino Jr.) as first-round draft picks. Father and son were taken in the baseball draft. They are believed to be the first father-son-daughter combo to all be taken in the opening round of a draft. The elder DeShields was in attendance at the draft. Pam McGee, Imani McGee-Stafford and JaVale McGee were the first mother-daughter-son to be taken in the opening round when McGee-Stafford was drafted with the 10th pick in 2016. FOREIGN PLAYERS: Other foreign players joining Vadeeva in the draft were Ji-Su Park (South Korea); Raisa Mussina (Russia) Julia Reisingerova (Czech Republic). First Round, 1. Las Vegas, A'ja Wilson, C, South Carolina, 2. Indiana, Kelsey Mitchell, G, Ohio State, 3. Chicago (from Atlanta), Diamond DeShields, G, Tennessee/Turkey, 4. Chicago, Gabby Williams, F, UConn, 5. Seattle, Jordin Canada, G, UCLA, 6. Dallas, Azura Stevens, F, UConn, 7. Washington, Ariel Atkins, G, Texas, 8. Indiana (from Phoenix), Victoria Vivians, G, Mississippi State, 9. Connecticut, Lexie Brown, G, Duke, 10. New York, Kia Nurse, G, UConn, 11. Los Angeles, Maria Vadeeva, C, Russia, 12. Phoenix (from Minnesota), Marie Gulich, C, Oregon State, Second Round, 13. Las Vegas, Jamie Nared, G/F, Tennessee, 14. Indiana, Stephanie Mavunga, F, Ohio State, 15. Atlanta (from Connecticut), Monique Billings, F, UCLA, 16. Atlanta (from Chicago), Kristy Wallace, G, Baylor, 17. Minnesota (from Seattle), Ji-Su Park, C, South Korea, 18. Dallas, Loryn Goodwin, G, Oklahoma State, 19. Washington, Myisha Hines-Allen, F, Louisville, 20. Phoenix, Tyler Scaife, G, Rutgers, 21. Phoenix (from Connecticut), Raisa Musina, F, Russia, 22. New York, Mercedes Russell, C, Tennessee, 23. Los Angeles, Shakayla Thomas, F, Florida State, 24. Minnesota, Kahlia Lawrence, G, Mercer, Third Round, 25. Las Vegas, Raigyne Moncrief Louis, G, LSU, 26. Phoenix (from Indiana through Las Vegas), Imani Wright, G, Florida State, 27. Atlanta, Mackenzie Engram, F, Georgia, 28. Chicago, Amarah Coleman, G, DePaul, 29. Seattle, Teana Muldrow, F, West Virginia, 30. Dallas, Natalie Butler, C, George Mason, 31. Washington, Rebecca Greenwell, G, Duke, 32. Las Vegas (from Phoenix), Jill Barta, F, Gonzaga, 33. Connecticut, Milayla Cowling, F, California, 34. New York, Leslie Robinson F, Princeton, 35. Los Angeles, Julia Reisingerova, C, Czech Republic, 36. Minnesota, Carlie Wagner, G, Minnesota, Copyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.]", "title": "2018 WNBA draft Las Vegas Aces choose Aja Wilson at No. 1", "urlToImage": "https://www.gannett-cdn.com/-mm-/d5571908edab988b20840636b533a6da53193d40/c=0-29-897-536&r=x1683&c=3200x1680/local/-/media/2018/04/12/USATODAY/USATODAY/636591597633932966-AP-WNBA-DRAFT-BASKETBALL-99134271.JPG"}], "https://www.usatoday.com/story/tech/2018/04/11/after-facebooks-mark-zuckerberg-hearings-users-want-know-who-protecting-my-data/505791002/": [{"author": "Jessica Guynn", "description": "Users whose data was swiped by Cambridge Analytica aren't left with many options.", "publishedAt": "2018-04-12T19:20:35Z", "source": "USA Today", "text": "[, Settings, Cancel, Set, Hi Already a subscriber. Subscribe to USA TODAY, Already a print edition subscriber, but don't have a login. Manage your account settings. Support, Log Out, Get the news, Let friends in your social network know what you are reading about, Users whose data was swiped by Cambridge Analytica aren't left with many options. A link has been sent to your friend's email address. A link has been posted to your Facebook feed. To find out more about Facebook commenting please read the Conversation Guidelines and FAQs, During a Senate hearing with Facebook founder Mark Zuckerberg, a few of the questions asked by senators seemed to require an explanation of the basics. USA TODAY, Facebook CEO Mark Zuckerberg arrives to testify before the House Energy and Commerce Committee on April 11, 2018.(Photo: Jack Gruber, USA TODAY), SAN FRANCISCO Among the 87 million people whose personal informationwas improperly harvested byCambridge Analytica was FacebookfounderMark Zuckerberg. The disclosure that details from Zuckerberg'spersonal profile wereshared with the voter targeting firm that worked for the Donald Trump campaign illustratesthe extent of the Facebook data leak that brought its CEO to Capitol Hill this week. What consumers whose datawas breached can do about it is far less cleara point driven home by broad skepticism from lawmakers who, in the second of two marathon congressional hearings, pressedZuckerberg on whetherFacebook's 2.2 billion users really own and control their data and what, if anything, they can do to protect it. During Wednesday'shearing before the House Energy and Commerce Committee,Rep. Marsha Blackburn, a Republican from Tennessee,compared Facebook to The Truman Show where user information is made available to people they dont knowand then that data is crunched and used and they are fully unaware of this. Whos going to protect us from Facebook? asked Rep. Janice Schakowsky, an Illinois Democrat. Facebook CEO Mark Zuckerberg says he believes it is inevitable that there will be regulation of his industry. (April 11) AP, Carolina Milanesi says she found out Tuesday night that her personal information was leaked to Cambridge Analytica. A friend of hers was one of the 300,000 Facebook users who downloaded a personality quiz app, This Is Your Digital Life. The researcher behind the app collected data not just on those users but on their Facebook friends, too, and then passed that data on to Cambridge Analytica. Milanesi, a technology analyst from San Jose, says she's not sure what to do with the knowledge that details from her Facebook accountincluding her likes, birthday and city wereexposed. There was a data breach at a company where I worked once, and my Social Security number and payroll information was taken. I could have set up an identity watch and bank watch to see if any activity was flagged for being unusual, she said. What can you do here. Not much. Facebook could face major fines if the Federal Trade Commission finds that the Cambridge Analytica leak violates the terms of the privacy settlement it reached with the company in 2012. Lawsuits that consumers can join have been filed. And consumers can adjust their privacy settings to restrict how much of their information can be used for targeted marketing, says Jeffrey Chester, executive director of the privacy watchdog groupCenter for Digital Democracy. That wont totally stop the data mining and profiling that Facebook doesbut will make it more difficult for it to take advantage of you, Chestersaid. This week some lawmakers calledfora privacy bill of rights. On Tuesday, three senators introduced privacy legislation that would require user consent to collect and share data.Rep. Raul Ruiz, a Democrat from California, on Wednesday called for the creation of a digital consumer protection agency to oversee tech companies. Facebookwill soon be governed by stricterprivacy controls in Europe, andZuckerberg said he would extend those privacy protections, which takeeffect in May,to Facebook users in the U.S. Yet privacy advocates say some of Facebooks current practices appear to violate the new Europeanlaw, called the General Data Protection Regulation.And, with American privacy laws stuck in the digital dark ages, there's currently verylittle recourse for Facebook users whose privacy was breached by the Cambridge Analytica leak, saysMarc Rotenberg, president of theElectronic Privacy Information Center. The reason we need privacy laws is precisely because individuals lose control over their personal information when it is transferred to a business, Rotenberg said. Privacy laws help ensure personal data is used only for its intended purpose. Notifications began going out Tuesday to as many as 87 million users, most of them in the United States, whose personal information was obtained by Cambridge Analytica.The U.K. firm uses data it collects to create detailed personality profiles of voters to sway them with targeted messages. It's pretty sad andpathetic that a company of this size, that is supposed to be a 'connection'for the people, didn't keep their 'people's'data safe, Taylor Bradford, an entrepreneurfrom Fort Worth, said of Facebook. She didn't download the personality quiz app; one of her friends did. ButBradford says she's not losing any sleep over the data breach, having alreadytaken precautions to lock down her Facebook account. If my birthday was shared, not really sure what that's going to get you. And if you want to see what pages I like,again, not sure what that's going to get you, she said in an email. If someone really wants your information, it's not hard to get. Cambridge Analytica notifications appear at the top of users'news feeds. Facebook has alsoprovideda link to a help page for people to check if their information wasshared with Cambridge Analytica. Zuckerberg told a joint session of the Senate Judiciary and Commerce committees on Tuesday that Facebook is investigating all apps on the platform to make sure they are not using Facebook user information improperly. If any apps are found to be violating Facebook rules, Zuckerberg said Facebook would ban them from the social network. Sheila Arkee, 39, the publisher of a beauty blog called Painted Ladies, says she already removed a lot of her personal information from Facebook such as her birthday and location out of concern for her privacy. She rarely posts status updates anymore and says she never clicks on clickbait quizzes.But she found out Tuesday night that one of her friends did. I am highly concerned about who has access to my personal data. What information have I innocently shared has become used in a way Im absolutely uncomfortable with? Arkee said. How will any Facebook user know how or when our personal information may be used against us in a negative way in the future. Facebook doesn't tell users who among their friends downloaded the quiz app, exposingtheir data to Cambridge Analytica. Some people have demanded to know. But Milanesi says it doesn't matter to her. What would you do if you knew the friend, unfriend him or her? she said. For me it is really more about what is Facebook doing to avoid this in the future, and while I understand it will take time, I don't want that to be an excuse not to get as much as possible done as soon as possible. KitaBryant, 36, a photographer from Atlanta who runs the website It's Really Kita, says she feels like she dodged a bullet. Her information was not shared withCambridge Analytica. In the future, Bryantsays she will be more selectiveabout what she shares online. I am very relieved, she said. I wasn't as worried as everyone else, but I am glad that I didn't have to worry about my personal info getting out there. More: Facebook's Mark Zuckerberg has promised to protect user privacy before. Will this time be different. More: Six takeaways from Facebook CEO Mark Zuckerberg's Senate testimony on data breaches, More: Did Zuckerberg just suggest a paid, ad-free version of Facebook. More: Zuckerberg: Federal regulation of Facebook 'inevitable', A link has been posted to your Facebook feed. ]", "title": "After Facebook hearings, users want to know who is protecting my data", "urlToImage": "https://www.gannett-cdn.com/-mm-/cf6686245c2123254e1c7bb9c32f5aa833e6b41e/c=0-570-5561-3712&r=x1683&c=3200x1680/local/-/media/2018/04/11/USATODAY/USATODAY/636590410942548007-JG1-0753.JPG"}], "https://www.washingtonpost.com/business/economy/trump-weighs-rejoining-trans-pacific-partnership/2018/04/12/37d59500-3e71-11e8-8d53-eba0ed2371cc_story.html": [{"author": null, "description": "Urged by senators, Trump told top administration officials Thursday to examine reentering the TPP.", "publishedAt": "2018-04-13T03:33:45Z", "source": "The Washington Post", "text": "[President Trump ordered top administration officials Thursday to look at rejoining theTrans-Pacific Partnership, the sprawling trade pact he rejected three days after taking office. The move would mark a stunning reversal for Trump, who sharply criticized the pact as a disaster and made opposition to global trade deals a centerpiece of his economic agenda as a candidate. The Obama administration had signed the trade agreement, known as TPP, with 11 other countries, including Japan, Vietnam, Singapore and Australia, to lower tariffs and counter Chinas influence in the Pacific. An embrace of the TPP would give Trump more leverage in his escalating trade feud with Beijing. It also would give U.S. farms, retailers and other businesses better access to foreign markets if China makes good on its recent threats of new tariffs on U.S. goods. Thursdays order comes as Trump pushes forward on a chaotic revamp of the United States approach to global trade, seemingly veering from trade wars one day to multinational pacts the next. He has gone from assailing Canada and Mexico to saying hes within striking distance of renegotiating the North American Free Trade Agreement. He has both pilloried China and praised its leader, Xi Jinping. But no reversal has been more extreme than his new flirtation with the TPP. His comments were so unexpected that White House officials, lawmakers, business groups and others werent sure whether Trump had made a calculated overture or if it was another whimsical idea that he would cool on soon. Reentering the TPP would not be easy. The 11 other countries reached their own trade deal this year, and it is unclear what conditions they would set before they restarted the entire process with the United States. The deal would be much stronger with U.S. participation, since it is the worlds largest economy. But several countries in the deal have cast a wary eye toward Trumps swings on trade. Canada and Mexico are part of the TPP talks, for example, and Trump has blasted leaders from both countries for what he describes as ripping off U.S. workers. Japan is also part of the TPP, and Trump has so far refused to exempt Japan from new tariffs on steel and aluminum imports into the United States. Trump gave the new orders to U.S. Trade Representative Robert E. Lighthizer and National Economic Council Director Larry Kudlow during a White House meeting with lawmakers and governors, according to several GOP senators in attendance. Trump then told Lighthizer and Kudlow to take a look at getting us back into that agreement, on our terms, of course, said Sen. John Thune (R-S.D.). He was very, I would say, bullish about that. Sen. Ben Sasse (R-Neb.) also witnessed and applauded Trumps surprise move. We should be leading TPP, Sasse said. China is a bunch of cheaters and the best way to push back on their cheating would be to be leading all these other rule-of-law nations in the Pacific that would rather be aligned with the U.S. than with China. But some free-trade supporters viewed Trumps remarks with skepticism. If it holds until this afternoon, thats a good move, said Sen. Jeff Flake (R-Ariz.), a free-trade advocate and frequent Trump critic who was not at the White House meeting. A senior administration official, speaking on the condition of anonymity to describe the White Houses internal approach, said Trump has not set any goals or deadlines for Kudlow and Lighthizer for when a new agreement should be reached. Instead, the White House is approaching potential new talks as a way to signal that Trump is receptive to free-market proposals if he feels they can be reached in a way that advances U.S. interests, the official said. Trump walked back a little on his proposal in a Twitter message late Thursday. Would only join TPP if the deal were substantially better than the deal offered to Pres. Obama, he wrote. We already have BILATERAL deals with six of the eleven nations in TPP, and are working to make a deal with the biggest of those nations, Japan, who has hit us hard on trade for years. Trump and a number of Democrats and labor unions had railed against the trade deal during the presidential campaign, saying such pacts allow foreign companies to lure away U.S. jobs and erode the U.S. manufacturing base. In June 2016, Trump called the TPP another disaster done and pushed by special interests who want to rape our country. The presidents protectionist impulses since taking office have caused heartburn for many GOP lawmakers who continue to embrace the Republican Partys traditional support for free trade. If the president does move forward with rejoining the TPP, business groups and many Republican lawmakers would be sure to applaud the move, even though it would be a striking example of Trump reversing a campaign-trail promise. At least some labor groups were alarmed at Trumps willingness to restart the TPP process. TPP was killed because it failed Americas workers and it should remain dead, Richard Trumka, president of the AFL-CIO, tweeted Thursday. There is no conceivable way to revive it without totally betraying working people. Trump administration officials are also working to renegotiate NAFTA, and the president told senators Thursday his team was making progress. The president said it could be two weeks, it could be two months, it could be six months, said Sen. Deb Fischer (R-Neb.). Hes keeping his options open. Thats important. Engaging in talks to reenter the TPP would be part of a broader White House strategy to respond to an escalating trade flap between Trump and Beijing. But Trump has been having a hard time rallying other countries to backstop his push to impose new tariffs on Chinese goods. The president is also running into strong pushback from Republican lawmakers, particularly those representing agricultural regions where Chinas threatened retaliation against U.S. exports would hit hard. The president first raised the prospect of reentering the trade deal at the World Economic Forum in late January. He said then that he would rethink his opposition if the United States secured substantially better terms, without offering specifics. There has been no indication since then that the administration was making any genuine effort to rejoin the agreement. This is another encouraging signal from the administration, following what the president said at Davos, said Wendy Cutler, who was among the TPP negotiators. I always thought that with time the administration would value the TPP more and more. One question is which TPP Trump wants to rejoin: the original 12-nation deal that the Obama administration negotiated, or the 11-nation agreement that is moving toward implementation by the remaining countries. When the president last year announced he was quitting the deal, the other TPP countries suspended 20 provisions in the original accord and announced a new deal, the Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP). The provisions, including key intellectual property protections such as those involving biological drugs, were measures the United States had demanded in return for granting access to its market. U.S. negotiating partners might expect the United States to pay for restoring those provisions at this point, Cutler said. They do want us back in. But the question is: At what price? Cutler said. Trump was not the only one to oppose the TPP during the 2016 presidential campaign. His Democratic rival, Hillary Clinton, came out against the deal as she faced pressure during her primary campaign against Sen. Bernie Sanders (I-Vt.), who was outspoken against the TPP. Clinton had played a role in its formation during her time as President Barack Obamas secretary of state. Even before Trumps election, the Trans-Pacific Partnership began to founder and stall in Congress as it got caught up in political crosscurrents, losing support from some Republicans and progressive Democrats. In May 2016, as domestic political backing for the TPP was starting to erode, Obama wrote an op-ed in The Washington Post aiming to rally support. Increasing trade in this area of the world would be a boon to American businesses and American workers, and it would give us a leg up on our economic competitors, including one we hear a lot about on the campaign trail these days: China, he wrote. The TPP is becoming one of the White Houses few remaining options as Trump searches for ways to exert pressure on China to back down from its threat of new tariffs on U.S. exports. U.S. farm groups have said they fear getting caught in the middle of the trade spat that Trump and Beijing have recently escalated, and they want assurances that they will not lose access to foreign markets. The White House had been looking at using a Depression-era program known as the Commodity Credit Corp. that could be used to extend subsidies to farmers, but Republican lawmakers pushed back hard on that idea during Thursdays meeting. Farmers dont want a handout. They want access to markets, Sen. Steve Daines (R-Mont.) said. The president was surprised by that. Hes like, really? He said, Oh, really? Okay, so we wont do that. David J. Lynch contributed to this report. ]", "title": "Trump weighs rejoining Trans-Pacific Partnership amid trade dispute with China - The Washington Post", "urlToImage": "https://www.washingtonpost.com/resizer/EojqdEBJbQvBkWZQHr_FztABHp0=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/C7CAQMR6RII6RJ6R4TX6YY4J6A.jpg"}], "https://www.washingtonpost.com/news/energy-environment/wp/2018/04/12/interior-dramatically-reverses-proposal-to-raise-some-national-park-entry-fees-to-70/": [{"author": null, "description": "Americans widely condemned the first proposal to raise entry fees to $70 at some parks. The new $5 increase proposal tracks closer to inflation.", "publishedAt": "2018-04-12T20:32:39Z", "source": "The Washington Post", "text": "[Interior Department officials on Thursday completely backed off a proposal to increase entrance fees at some national parks, opting instead for an across-the-board $5 increase at all parks that charge visitors to enter. The proposal marks a significant turn from a plan in October to increase peak-season entrance fees at 17 popular parks from $25 to $70 the largestincreasesince World War II to help pay for the National Park Services nearly $12 billion infrastructure backlog. But a wave of angry public comments to the proposal convinced Interior that the fee hike might backfire and lead to a decline in visitation, causing revenue to crater. Two annual passes, including the popular America the Beautiful pass, would remain at $80.Under the updated increase, the Park Service stands to add about $60 million by years end. Interior Secretary Ryan Zinke announced the new proposal in a statement that included a nod to Americans who rebuked the earlier plan. I want to thank the American people who made their voices heard through the public comment process on the original fee proposal, the secretary said. Your input has helped us develop a balanced plan that focuses on modest increases at the 117 fee-charging parks as opposed to larger increases proposed for 17 highly-visited national parks. The fees would take effect starting June. Using Yosemite National Park as an example, the Park Service said its seven-day vehicle pass would increase from $30 to $35. At least one park, Crater Lake National Park, would see a $10 increase to its specific $40 annual pass on June 1 and a $5 increase to its $20-per-vehicle entry fee. It would increase by another $5 in June 2020. Interior signaled in the first week in April that its earlier proposal was in trouble when adepartment official said: Were working to respond to those thoughtful and well-put comments that railed against the plan. Our ultimate goal when it comes to entrance fees is to make sure the parks get 80 percent of that revenue but we also dont want to put a burden on our visitors. The officials statement followed Zinkes backpedaling on the plan duringcongressional hearings in March. In response to questions from concerned committee members, he said the agency was undecided about the rates and looking at alternatives. At a House hearing that same week, he said the aim was to not hurt families. An analysis by the National Parks Conservation Association showed that 98 percent of 110,000 public comments opposed the dramatic increase. Fees do have a role to play in our parks, and the administrations move to abandon its original proposal in favor of more measured fee increases will put additional funds into enhancing park experiences without threatening visitation or local economies, saidTheresa Pierno, the associations president and chief executive. NPCA was among the first groups to denounce it in October. This is a prime example that activism works, said Rep. Raul Grijalva (Ariz.), thetop Democrat of the House Natural Resources Committee and a frequent critic of Zinke. The American people raised their concerns, participated in the public comment period and made sure that the Trump White House knew that the proposal was unpopular. If it wasnt for the power of the people, Secretary Zinke would have gone ahead with his ridiculous proposal. Read More, Trump could make visiting some national parks more expensive than Six Flags, House spending bill would increase funds for national parks and wildfire suppression, The National Park Service showed that its bottled water ban worked then scrapped it]", "title": "Public outrage forces Interior to scrap massive increase in park entry fees - The Washington Post", "urlToImage": "https://www.washingtonpost.com/resizer/KXtKJV2_1VXmWj1K8WQjYxACePg=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/3DPNSAABMU745ABJM42W3XRILE.jpg"}], "https://www.washingtonpost.com/politics/james-comeys-memoir-trump-fixates-on-proving-lewd-dossier-allegations-false/2018/04/12/64493866-3ce2-11e8-974f-aacd97698cef_story.html": [{"author": "https://www.facebook.com/PhilipRuckerWP", "description": "In new book, the fired FBI director details his ‘disturbing’ talks with Trump and concludes that this presidency is ‘a forest fire’ that must be contained.", "publishedAt": "2018-04-12T21:42:08Z", "source": "The Washington Post", "text": "[, The nations intelligence chiefs had just finished briefing Donald Trump on Russias interference in the 2016 election when FBI Director James B. Comey stayed behind to discuss some especially sensitive material: a widely circulated intelligence dossier containing unconfirmed allegations that Russians had filmed Trump interacting with prostitutes in Moscow in 2013. The president-elect quickly interrupted the FBI director. According to Comeys account in a new memoir, Trump strongly denied the allegations, asking rhetorically, I assumed whether he seemed like a guy who needed the service of prostitutes. He then began discussing cases where women had accused him of sexual assault, a subject I had not raised. He mentioned a number of women, and seemed to have memorized their allegations. The January 2017 conversation at Trump Tower in Manhattan teetered toward disaster until I pulled the tool from my bag: We are not investigating you, sir. That seemed to quiet him, Comey writes. Trump did not stay quiet for long. Comey describes Trump as having been obsessed with the portion dealing with prostitutes in the infamous dossier compiled by British former intelligence officer Christopher Steele, raising it at least four times with the FBI director. The document claimed that Trump had watched the prostitutes urinate on themselves in the same Moscow suite that President Barack Obama and first lady Michelle Obama had stayed in as a way of soiling the bed, Comey writes. Comey writes that Trump asked him to have the FBI investigate the allegations to prove they were not true, and offered varying explanations to convince him why. Im a germaphobe, Trump told him in a follow-up call on Jan. 11, 2017, according to Comeys account. Theres no way I would let people pee on each other around me. No way. Later, the president asked what could be done to lift the cloud because it was so painful for first lady Melania Trump. Then, on May 9, 2017, Trump fired Comey, leading to the Justice Department special counsels Russia investigation. The discussions about the Steele dossier which Comey recounts for the first time in his book are among a number of explosive revelations in A Higher Loyalty: Truth, Lies, and Leadership, a 304-page tell-all in which the former FBI director details his private interactions with Trump as well as his handling of the Hillary Clinton email investigation. The Washington Post obtained a copy of the book before its scheduled release on Tuesday. In his memoir, Comey paints a devastating portrait of a president who built a cocoon of alternative reality that he was busily wrapping around all of us. Comey describes Trump as a congenital liar and unethical leader, devoid of human emotion and driven by personal ego. Comey narrates in vivid detail, based on his contemporaneous notes, instances in which Trump violated the norms protecting the FBIs independence in attempts to coerce Comey into being loyal to him such as during a one-on-one dinner in the White House residence. Interacting with Trump, Comey writes, gave him flashbacks to my earlier career as a prosecutor against the Mob. The silent circle of assent. The boss in complete control. The loyalty oaths. The us-versus-them worldview. The lying about all things, large and small, in service to some code of loyalty that put the organization above morality and above the truth. The result, in Comeys telling, is the forest fire that is the Trump presidency. What is happening now is not normal, he writes. It is not fake news. It is not okay. Comey describes a Feb. 14, 2017, meeting in the Oval Office where Trump asked Attorney General Jeff Sessions to clear the room so he could bring up the FBI investigation of former national security adviser Michael Flynn directly with Comey a key event in special counsel Robert S. Mueller IIIs investigation of whether Trump sought to obstruct justice. I hope you can see your way clear to letting this go, to letting Flynn go, Trump said, according to Comeys account of the meeting, some of which he first shared in Senate testimony last year. He is a good guy. I hope you can let this go. Comey writes that he regrets not interrupting Trump to explain that his plea was wrong. He recalls later confronting Sessions, whom he describes as both overwhelmed and overmatched by the job. You cant be kicked out of the room so he can talk to me alone, Comey told Sessions, according to the book. You have to be between me and the president. Comey also recounts new observations: Sessions just cast his eyes down at the table, and they darted quickly back and forth, side to side. He said nothing. I read in his posture and face a message that he would not be able to help me. A lifelong Republican until recently, Comey delivers an indirect but unmistakable rebuke of the GOPs congressional leaders as well: It is also wrong to stand idly by, or worse, to stay silent when you know better, while a president brazenly seeks to undermine public confidence in law enforcement institutions that were established to keep our leaders in check. Comey stops short of outlining a legal case against the president, explaining that because he does not know all the evidence he cannot determine whether Trump intended to obstruct justice by firing him and by asking him to back off the FBIs investigation of Flynn. I have one perspective on the behavior I saw, which while disturbing and violating basic norms of ethical leadership, may fall short of being illegal, he writes. Still, the book is an indictment of Trumps presidency as well as of his character. Each chapter can be interpreted as an elaborate trolling of Trump, starting with the title, A Higher Loyalty, a subtle reference to the loyalty pledge that Trump sought and did not receive from Comey. Comey describes being bullied as a child growing up in Allendale, N.J. taunted, body slammed into lockers and given wedgies. Bullies, he writes, threaten the weak to feed some insecurity that rages inside them. ... Surviving a bully requires constant learning and adaptation. Which is why bullies are so powerful, because its so much easier to be a follower, to go with the crowd, to just blend in. Comey also ruminates on the psychology of liars in an apparent nod to the current occupant of the Oval Office. They lose the ability to distinguish between whats true and whats not, Comey writes. They surround themselves with other liars. ... Perks and access are given to those willing to lie and tolerate lies. This creates a culture, which becomes an entire way of life. Comey defends his handling of the Clinton email investigation, and for the first time details a private assurance he received from Obama following Clintons defeat. Many Democrats blame Comey for announcing less than two weeks before the election that the FBI was examining a new trove of Clinton emails for possible classified material. Comey writes that Obama sat alone with him in the Oval Office in late November and told him, I picked you to be FBI director because of your integrity and your ability. I want you to know that nothing nothing has happened in the last year to change my view. On the verge of tears, Comey told Obama, Boy, were those words I needed to hear. ... Im just trying to do the right thing. I know, Obama said. I know. Comey also writes that in a post-election briefing for senators, then-Sen. Al Franken (D-Minn.) confronted him about what you did to Hillary Clinton. Comey responded, I did my best with the facts before me. A teary-eyed Senate Minority Leader Charles E. Schumer (D-N.Y.) grabbed him by the hand afterward and said, I know you. You were in an impossible position, Comey writes. Clinton wrote in her campaign memoir, What Happened, that she felt shivved by Comey. Two days before the election, Comey announced that the FBI had reviewed the new emails and found nothing to change its view that Clinton should not be prosecuted. But in Clintons assessment, the damage already had been done. Comey, who says his wife and daughters voted for Clinton, includes a message in his book to the would-be first female president: I have read she has felt anger toward me personally, and Im sorry for that. Im sorry that I couldnt do a better job explaining to her and her supporters why I made the decisions I made. Comey is critical of then-Attorney General Loretta E. Lynch, saying she had a tortured half-out, half-in approach to the Clinton investigation and that he considered calling for the appointment of a special prosecutor. One day shortly before the election, Lynch and Comey met privately. Comey writes that the attorney general wrapped her arms around him and implied that she thought he had done the right thing. But as their meeting ended, Comey writes, She said, with just the slightest hint of a smile, Try to look beat up. She had told somebody she was going to chew me out for what I had done. What a world. The first time Comey met Trump was at the pre-inauguration intelligence briefing. Comey, who is 6 feet 8 inches tall, writes that the 6-foot-3 president-elect looked shorter than he did on television. His face appeared slightly orange, Comey writes, with bright white half-moons under his eyes where I assumed he placed small tanning goggles, and impressively coifed, bright blond hair, which upon close inspection looked to be all his. As he extended his hand, Comey adds, I made a mental note to check its size. It was smaller than mine, but did not seem unusually so. Trump was accompanied at the Trump Tower session by his national security team, as well as by political aides Reince Priebus and Sean Spicer, who were slated to become White House chief of staff and press secretary, respectively. Trump asked only one question, Comey writes: You found there was no impact on the result, right. James R. Clapper Jr. then the director of national intelligence, replied that the intelligence community did no such analysis. Comey recalls being struck that neither Trump nor his advisers asked about the future Russian threat, nor how the United States might prepare to meet it. Rather, he writes, they focused on how they could spin what wed just told them. With Clapper and then-CIA Director John O. Brennan both Obama appointees still in the room, Priebus and other Trump aides strategized for political advantage, Comey writes. The Trump team decided they would emphasize that Russian interference had no impact on the vote which, Clapper reminded them, the intelligence community had not determined. When the meeting ended, Comey stayed behind with Trump to discuss the salacious dossier. The day before, as Clapper and Comey briefed Obama about Russian interference, the president asked who planned to tell Trump about the Moscow prostitute allegations. Clapper replied that Comey would. Obama turned his head to his left and looked directly at me, Comey recalls. He raised and lowered both of his eyebrows with emphasis, and then looked away. ... To my mind his Groucho Marx eyebrow raise was both subtle humor and an expression of concern. It was almost as if he were saying, Good luck with that. A week after the Trump Tower meeting, on Jan. 11, Comey writes that Trump called him and said he was concerned about the dossier being made public and was fixated on the prostitutes allegation. The president-elect argued that it could not be true because he had not stayed overnight in Moscow but had only used the hotel room to change his clothes. And after Trump explained that he would never allow people to urinate near him, Comey recalls laughing. I decided not to tell him that the activity alleged did not seem to require either an overnight stay or even being in proximity to the participants, Comey writes. In fact, though I didnt know for sure, I imagined the presidential suite of the Ritz-Carlton in Moscow was large enough for a germaphobe to be at a safe distance from the activity. After one week as president, Trump invited Comey to dinner. Comey describes the scene on Jan. 27: The table in the Green Room was set for two. The president marveled at the fancy handwriting on the four-course menu placards and seemed unaware of the term calligrapher. White House stewards served salad, shrimp scampi, chicken Parmesan with pasta, and vanilla ice cream. Comey writes that he believed Trump was trying to establish a patronage relationship, and that he said: I need loyalty. I expect loyalty. I was determined not to give the president any hint of assent to this demand, so I gave silence instead, Comey writes. I stared at the soft white pouches under his expressionless blue eyes. I remember thinking in that moment that the president doesnt understand the FBIs role in American life. Trump broke the standoff by turning to other topics, Comey writes, speaking in torrents, like an oral jigsaw puzzle, about the size of his inauguration crowd, his free media coverage and the viciousness of the campaign. He talked about the Clinton email investigation as in three phases, as if it were a television series: Comey One, Comey Two and Comey Three. Trump also tried to convince Comey that he had not mocked disabled New York Times reporter Serge Kovaleski at a campaign rally, and then turned to the detailed allegations of sexual assault against him. There was no way he groped that lady sitting next to him on the airplane, he insisted, Comey writes. And the idea that he grabbed a porn star and offered her money to come to his room was preposterous. And then Trump brought up the golden showers thing, Comey writes. The president told him that it bothered him if there was even a one percent chance his wife, Melania, thought it was true. Comey writes that Trump told him to consider having the FBI investigate the prostitutes allegation to prove it was a lie. As the dinner concluded, Trump returned to the issue of loyalty. I need loyalty, Trump tells Comey, according to the book. You will always get honesty from me, Comey replies. Thats what I want, honest loyalty, Trump said, reaching what Comey writes was some sort of deal in which we were both winners. The two men were back together at the White House a couple weeks later. Comey had dropped by the chief of staffs office to explain to Priebus whom he describes as both confused and irritated the appropriate way for the White House to interact with the FBI. When they finished, Priebus asked if Comey wanted to say hello to Trump an ironic gesture, Comey recalls, considering he was just explaining the importance of the bureaus independence. Comey demurred, but Priebus insisted and brought him to the Oval Office, where Trump was stationed behind the Resolute Desk. The president, Comey recalls, launched into one of his rapid-fire, stream-of-consciousness monologues this time about a recent Super Bowl interview with then-Fox News Channel personality Bill OReilly in which Trump complimented Russian President Vladimir Putin. But hes a killer, OReilly told Trump. The presidents reply: There are a ton of killers. Weve got a lot of killers. What do you think? Our countrys so innocent. Trump fumed to Comey about the media criticism he received. I gave a good answer, Trump said, according to Comey. Really, it was a great answer. I gave a really great answer. Trump sought validation: You think it was a great answer, right. Comey replied, We arent the kind of killers that Putin is. Trump apparently did not take the correction well. Comey writes that the presidents eyes changed and his jaw tightened, and Priebus escorted him out. The next month, Trump called Comey to complain about the Russia investigation as a cloud that was impairing his presidency and, again, brought up the Moscow prostitutes allegation. For about the fourth time, he argued that the golden showers thing wasnt true, asking yet again, Can you imagine me, hookers? Comey writes of their March 30, 2017, call. In an apparent play for my sympathy, he added that he has a beautiful wife and the whole thing has been very painful for her. He asked what we could do to lift the cloud. Comey recalls telling the president the FBI was investigating it as quickly as possible, and that he had told Congress that Trump was not personally under investigation, to which the president repeatedly told him, We need to get that fact out. Two weeks later, on April 11, Trump called Comey again to check on his request to get out that he is not under investigation, Comey writes. He seemed irritated with me, Comey recalls. I have been very loyal to you, very loyal. We had that thing, you know, Trump told him, according to the book, apparently referring to the loyalty dinner. That was the last time the two men spoke. On May 9, as Comey was talking with FBI employees in the Los Angeles field office, he peered at a television screen and saw a news alert: COMEY FIRED. Comey describes soon receiving an emotional call from John F. Kelly, then the Homeland Security secretary. He said he was sick about my firing and that he intended to quit in protest, Comey writes. He said he didnt want to work for dishonorable people who would treat someone like me in such a manner. I urged Kelly not to do that, arguing that the country needed principled people around this president. Especially this president. Kelly did not resign. Two and a half months later, he was named White House chief of staff.]", "title": "James Comeys memoir Trump fixates on proving lewd dossier allegations false - The Washington Post", "urlToImage": "https://www.washingtonpost.com/rf/image_1484w/2010-2019/WashingtonPost/2017/05/09/Local/Images/Comey023.JPG?t=20170517"}], "https://www.washingtonpost.com/politics/more-prominent-republicans-urge-missouri-governor-after-reporting-alleging-unwanted-sexual-contact/2018/04/12/26eb23b8-3e58-11e8-974f-aacd97698cef_story.html": [{"author": null, "description": "His top donor and other key Republicans in the state spoke out against Eric Greitens on Thursday.", "publishedAt": "2018-04-12T21:56:46Z", "source": "The Washington Post", "text": "[ JEFFERSON CITY, Mo. The pressure on Missouri Gov. Eric Greitens to resign escalated dramatically Thursday, with two state Republican leaders and a top donor joining the call for him to step down a day after the release of an explosive report alleging he initiated unwanted sexual contact with a woman who worked as his hairdresser. A onetime rising national star, Greitens is now in his lowest standing among Republican officials and donors since taking office in early 2017, facing intense criticism and even talk of impeachment. But Greitens has stood defiant, showing no sign that he is preparing to leave office. The governor said Wednesday, when the report was released, that he is the target of a witch hunt, echoing language President Trump has used to describe the special counsel probe into Russian interference in the 2016 election. Greitens has said that a separate criminal trial, scheduled for next month, will exonerate him. David Humphreys, a top Greitens donor, was part of a chorus of powerful Republicans who urged him to step down Thursday. State Senate Majority Leader Mike Kehoe and U.S. Rep. Ann Wagner also said he should go. A bipartisan state House panel released a report Wednesday that included detailed testimony from a woman they deemed a credible witness. The woman, Greitenss former hairdresser, said that in 2015, he groped her and slapped her. She also said in testimony that he blindfolded her and taped her hands to exercise equipment and that she felt coerced, maybe, to perform oral sex on him. Greitens has acknowledged having an extramarital affair but has denied engaging in any illegal conduct. He declined to testify before the state House committee. The lawmakers initiated their probe after allegations surfaced that Greitens had photographed the woman naked without her consent, and a St. Louis prosecutor brought a felony invasion-of-privacy charge against him. But the testimony revealed in the state legislative report has spurred leading Republicans not to wait until the outcome of that trial to urge Greitens to step down. These new revelations describe behavior that makes it impossible to retain confidence in his ability to govern wisely and well, Humphreys said in a written statement. Kehoe said he had come to the conclusion that [Greitenss] ability to lead is not going to be there. He criticized Greitens for his witch hunt comment, saying it was not the right position to be in at this time. Wagner wrote on Twitter that she was disgusted, disheartened and believes Greitens is unfit to lead our state. On Thursday, Greitens was quiet on the subject. His office did not comment on the allegations or the calls for his resignation. The comments from Humphreys, Kehoe and Wagner came a day after state Attorney General Josh Hawley called on Greitens to step down. Hawley is a top recruit running in the Republican primary to challenge Sen. Claire McCaskill (D) in a marquee contest in the larger national battle for the majority in the U.S. Senate. McCaskill also called for Greitens to step down. He is not in the position that he can lead the state of Missouri at a critical time in our states history, she said Thursday, repeating her call from a day earlier for Greitens to leave office. Hawleys office has been investigating allegations that resources at Greitenss former veterans charity were improperly used for his campaign. The special state House committee has also been looking into this issue, according to a transcript of its discussions released this week. The committee said it plans to issue a separate report on the matter. State House Speaker Todd Richardson, a Republican, called the testimony in the report released Wednesday beyond disturbing. He said the committee voted to expand their mission to issue a recommendation of any disciplinary action the governor should face. Richardson said this would happen in a special session after the regular one concludes next month. Responding to Greitens, Richardson said: This is not a witch hunt. State House Minority Leader Gail McCann Beatty (D) said Greitens must resign and, if he fails to do so, I believe, we should begin impeachment proceedings. Asked Thursday whether Greitens should step down, Republican Governors Association spokesman Jon Thompson said the organization had nothing to add to a February statement that indicated Greitens had stepped down from the RGAs executive committee. Sullivan reported from Washington. Sullivan reported from Washington.]", "title": "Pressure on Missouri governor to resign mounts after report alleging unwanted sexual contact - The Washington Post", "urlToImage": "https://www.washingtonpost.com/rf/image_1484w/2010-2019/WashingtonPost/2018/04/12/National-Politics/Images/Missouri_Governor_Indicted_09337.jpg-61aa7-4192.jpg?t=20170517"}], "https://www.wsj.com/articles/backpage-com-ceo-plead-guilty-to-charges-1523579443": [{"author": null, "description": null, "publishedAt": "2018-04-13T02:10:00Z", "source": "The Wall Street Journal", "text": "[]", "title": "Backpage.com, CEO Plead Guilty to Charges - WSJ", "urlToImage": null}]}