{"http://thehill.com/policy/international/381907-texas-gop-lawmaker-visits-venezuela-to-meet-with-maduro": [{"author": "John Bowden", "description": null, "publishedAt": "2018-04-06T00:23:35Z", "source": "The Hill", "text": "[A Texas Republican lawmaker privately traveled to Venezuela this week at the invitation of President Nicolas Maduro as part of a peacemaking mission, The Associated Press reports. Rep. Pete SessionsPeter Anderson SessionsHouse majority rules spark minority fights DCCC adds first black candidates to list of top candidates Spending deal talks down to toughest issues, lawmakers say MORE (R-Texas) met with Maduro during a two-day trip to the South American country, his spokeswoman confirmed to the AP. She said the trip related to his work over the past year to resolve issues in Venezuela. The spokeswoman noted that Sessions chairs the powerfulHouse Rules Committee, which pushes to ensure nations adhere to the rule of law and international standards. An unnamed U.S. official familiar with the trip arrangements told the newsoutlet that Sessions's trip was not taxpayer-funded and that the GOP lawmaker had received a letterof invitation from the Venezuelan government. The official said that State Department officials were not invited to sit in on the GOP lawmaker's meetings as had been the case with meetings forSen. Dick DurbinRichard (Dick) Joseph DurbinOvernight Finance: Markets freak then rally after dueling China, US tariffs | Private sector adds 241k jobs in March | Tech rivalries spill into Washington Sinclair producer resigns in protest Durbin demands answers from Sinclair chief about mandated content for local news anchors MORE (D-Ill.), who also visited the country this week and met with Maduro and other officials. Durbinvisitedthe country to negotiate the release ofJoshua Holt, a Utah man jailed in Venezuela for two years on what the U.S. considers to be falsified weapons charges. The Trump administration is considering sanctions on Maduro's government for human rights and civil liberties violations, a move which the Maduro government is anxiously trying to stop. Such sanctions would likely target the country's oil industry, its major export. Maduro's government recently ordered the country's elections to be moved uplater this month, a move the U.S. and other countries have labeled undemocratic. In March, the State Department issued a statement in support of opposition political parties that have rejected calls for an April election. A free and fair election should include the full participation of all political parties and political leaders, the immediate and unconditional release of all political prisoners, proper electoral calendar, credible international observation, and an independent electoral authority, spokeswoman Heather Nauert saidin the statement last month. View the discussion thread. The Hill 1625 K Street, NW Suite 900 Washington DC 20006 | 202-628-8500 tel | 202-628-8503 fax, The contents of this site are 2018 Capitol Hill Publishing Corp. a subsidiary of News Communications, Inc.]", "title": "Texas GOP lawmaker visits Venezuela to meet with Maduro  TheHill", "urlToImage": "http://thehill.com/sites/default/files/venezuela_maduro.jpg"}], "http://www.bbc.com/news/world-us-canada-43663447": [{"author": "https://www.facebook.com/bbcnews", "description": "Saudi Arabia’s Crown Prince Mohammed bin Salman was given a king’s welcome in Hollywood this week.", "publishedAt": "2018-04-05T22:18:00Z", "source": "Bbc.com", "text": "[, Share this with, Email, Facebook, Messenger, Messenger, Twitter, Pinterest, WhatsApp, LinkedIn, Copy this link, These are external links and will open in a new window, Saudi Arabia's Crown Prince Mohammed bin Salman was given a king's welcome in Hollywood this week. The conservative kingdom's plan to open up cinemas and Western entertainment after a 35-year ban had Hollywood's top executives jockeying to make deals with the billionaire crown prince. Mohammed bin Salman, or MBS as he's also known, dined at media mogul Rupert Murdoch's house along with studio heads and actor Dwayne The Rock Johnson. In a Facebook post about the dinner, The Rock said he was humbled to discover he has so many young fans in Saudi Arabia. I look forward to my first visit soon to Saudi Arabia, Johnson wrote. I'll be sure to bring my finest tequila to share with the his Royal Highness and family. Tequila and The Rock in Saudi Arabia? Alcohol is banned in Saudi Arabia and punishable by lashes. But the times they are a-changing. That's how it looked at the Four Seasons in Beverly Hills. The prince's vast entourage took over the entire hotel where everything from the music to the menus had a Saudi flare this week. They also hosted a summit there on the future of entertainment in Saudi Arabia. It was packed with hundreds of Hollywood insiders. While a handful of activists demonstrated throughout the prince's trip to protest the Saudi-led bombing of Yemen and the way women are treated in Saudi Arabia, Hollywood was shown a slick, modern version of the country ready for change under the direction of the 32-year-old crown prince. As a result, Saudis can expect to see some Hollywood blockbusters at a cinema near them soon. AMC, the biggest movie chain in the US, plans to open 30 cinemas in the kingdom - the first one later this month. Saudis can also expect to see Disney on Ice and Cirque du Soleil coming soon. Rick Licht, the CEO of Hero Ventures, attended the summit carrying Thor's hammer from the Avengers movie. His company is bringing the travelling theme park, The Marvel Experience, to Saudi Arabia before the end of the year. Our hosts today have been absolutely spectacular and I hope we're going to be able to do this for many years to come over there, Mr Licht said. In a slick promotional video, The General Entertainment Authority of Saudi Arabia used change as a theme - and highlighted the fact that nearly 70% of Saudi Arabia's 32 million people are under the age of 30. And they're hungry for entertainment. But not everyone was impressed with the royal treatment given to the Saudi delegation. Feminist peace activists from Code Pink demonstrated outside many of the prince's meetings to tell people about the Saudi-led bombing of Yemen, which has killed 10,000 people and displaced about two million other people. Outside the Rand Corporation, one protester carried a sign saying bin Salman is no Prince Charming. Many activists noted that Hollywood is already battling its own problems with sexism and it shouldn't be making deals with a country so restrictive to women. Oscar-nominated actress Shohreh Aghdashloo says she's hopeful the young prince could end the war in Yemen and help mend ties between Saudi Arabia and its most bitter enemy - her native Iran. Saudi Arabia and Iran are engaged in a rivalry for power and influence in the Middle East - and Yemen is home to the most destructive of their proxy wars. Hollywood loves princes and princesses. Hollywood creates princes and princesses, says Ms Aghdashloo. But I wish the prince would have started with Yemen and not Hollywood, she adds. Most probably Hollywood is probably overwhelmed with his presence because they know they can do a lot together with his power, with his money, with his ambition, she said over coffee at Jerry's Deli in Los Angeles. If he says that he is going to open theatres in Saudi Arabia and if he does so then we are halfway through. Bringing awareness to people will make them become more aware of their situation and be more willing to make their place a better world to live in. Art can save lives. Young Saudis in Los Angeles were also optimistic about the crown prince's modernisation. The ban on women driving in the kingdom is being lifted and some can now leave their home without a male chaperone. The country is also opening up to tourist visas - although women under 25 who want to travel to Saudi Arabia will require a male chaperone. At a technology event hosted by the prince's foundation, young Saudi women in LA said his reforms have already greatly changed their future. One student, who did not want to be identified, said no when asked if she wanted to see more rights for women in Saudi Arabia. It's already happened. Most of the things we want are already in place, she said. It's a great step for women. Driving, all the new regulations for women. It's a great opportunity for us. First Saudi cinemas in decades to reopen, Who is Saudi Crown Prince Mohammed. It is an escalation of a tense trade stand-off that has unsettled global markets in recent weeks. ]", "title": "Saudi Prince Charming Mohammed bin Salman comes to Hollywood - BBC News", "urlToImage": "https://ichef-1.bbci.co.uk/news/1024/branded_news/34DC/production/_100723531_img_0611.jpg"}], "http://www.foxnews.com/politics/2018/04/06/voter-registration-cards-revamped-to-be-less-confusing-california-officials-say.html": [{"author": "Bradford Betz", "description": "California’s voter registration card is undergoing an extensive makeover as part of a statewide effort to reduce confusion over party affiliation, state officials said.", "publishedAt": "2018-04-06T04:11:43Z", "source": "Fox News", "text": "[This material may not be published, broadcast, rewritten, or redistributed. 2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes. California Secretary of State Alex Padilla, right, points out details on the state's updated voter registration form. (Associated Press) Californias voter registration card is undergoing an extensive makeover as part of a statewide effort to reduce confusion over party affiliation, state officials said. The changes were prompted by a Los Angeles Times report that revealed a number of Californians had mistakenly registered for the American Independent Party, instead of their intended no party preference. The American Independent Party was founded in 1967 to support the presidential candidacy of former Alabama Gov. George Wallace an avowed segregationist. According to the Times report, the confusion prevented some voters from casting a ballot in Californias 2016 presidential primaries. But the issue has been lingering for years, and a combination of issues prompted us to see is there was a better way, California Secretary of State Alex Padilla said. California's new voter registration cards will provide the option to check No Party/None for those who wish to not register with a political party. (Associated Press), The new registration cards are intended to be easier to read and understand, the Sacramento Bee reported. Political parties will now be listed on voter registration cards in a larger font and voters will also will have the option to select No Party/None. I think that it will result in more completed forms coming in, and should reduce the confusion, said Dean Logan, registrar of voters for Los Angeles County. This positions us to be in a better place in 2020. Markham Robinson, chairman of the American Independent Partys executive committee, however, expressed skepticism over the purported confusion and described a voters political party as an incidental aspect of registration. Officials say the new voter registration cards will be distributed within the week. Bradford Betz is an editor for Fox News. Follow him on Twitter @bradford_betz. This material may not be published, broadcast, rewritten, or redistributed. 2018 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes.]", "title": "Voter registration cards revamped to be less confusing, California officials say  Fox News", "urlToImage": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/politics/2018/04/06/voter-registration-cards-revamped-to-be-less-confusing-california-officials-say/_jcr_content/par/featured_image/media-0.img.jpg/0/0/1522987681872.jpg?ve=1"}], "https://sports.yahoo.com/sergio-garcia-tin-cup-moment-kept-hitting-good-shots-220531431.html": [{"author": null, "description": "The crowd was gasping in shock and then horror and then regaling each other with stories of having done the same thing that one time at some muni back home.", "publishedAt": "2018-04-05T22:19:36Z", "source": "Yahoo.com", "text": "[AUGUSTA, Ga. Sergio Garcia had gone from defending Masters champion to someone about to post a score that would cause shame for the lowliest of Sunday duffer. He was knocking shot after shot onto the green of the 15th hole here in the Masters only to see them spin back, sometimes swiftly, sometimes slowly, and roll back toward and into the front pond. One went in. Then another. Then another. Then another. Then another still. Five shots. Five in a row. Five Callaway Chrome Soft Xs finding a watery grave. Five in the drink by a major champion at a major championship. Four of Sergio Garcias five shots into the water. pic.twitter.com/NzAubcBZ7c, Nick Bromberg (@NickBromberg) April 5, 2018, I dont know, Garcia said after the round, where a 13 on No. 15 doomed him to a 9-over-par 81 and a lot of work to do to avoid missing the cut on Friday. I dont know what to tell you. Its one of those things. I felt like I hit a lot of good shots and unfortunately the ball just didnt want to stop. The crowd was gasping in shock and then horror and then regaling each other with stories of having done the same thing that one time at some muni back home. Garcia was going through golfing hell, but there was a kinship among the masses. Hes Tin Cupping it, one fan said, referencing the immortal Roy Tin Cup McAvoy of the 1995 movie (played by Kevin Costner) who, with a chance to win the U.S. Open, kept finding water and rather than smartly laying up kept shooting the same shot. He posted an unapologetic 12 to lose the tournament. It wasnt quite like that. Garcia wasnt being headstrong or using the wrong club. If anything, the shots were pretty good, each one finding the green with a pin up front only to roll off down the hill and into the water. Oh man, I just wanted one of those to stay up for him, said amateur Doc Redman, who was playing with him. That was pretty much everyones sentiment. That included the guys halfway back up the fairway, where the group behind Garcias was backed up, waiting and watching. Actually, only Bubba Watson was really watching. Jason Day was so focused on his game he wasnt paying attention, but as the delay went on, Watson approached Day. Bubba came up and told me [Garcia] was going for his 10th shot or something like that, Day said. Day looked like he didnt believe it but when the next shot hit the water and the crowd reacted as youd suspect it might, he started watching the train wreck. They didnt know how many had gone in. They didnt know the score. They didnt know if he was setting any records he would tie the highest score ever recorded on a hole at the Masters but fell short of John Dalys epic seven at the 2011 Australian Open. In the moment, no one knew much of anything. There was concern whether Garcia would run out of golf balls and what exactly that might mean. A DQ? Even the players werent sure. Actually, USGA rules state a player can borrow balls if needed, or the rules official will get you the type and brand you need. Still, that would have been embarrassing. It isnt known exactly how many balls Garcia had, but other golfers and caddies that were asked said its standard to bring 6-12 for a round, not just for water but in case they wear out. [I bring] anywhere from six to nine, Day said. He was probably getting close there. A pro golfers bag doesnt contain one of those golf ball retrievers, so fishing one back out would have been a challenge. There also isnt a collection of water balls at the bottom of the bag, waiting years to come out. Well, not normally. I bring a ton, Watson said. I had 13 balls in my bag today just in case something like that happens. Ill take the ones that hit off the cart path, well, they dont have cart paths here, but Ill take those and put them in the bag. Bubba Watson brings scuffed-up water balls with him. You always gotta have a water ball, Watson said. For Sergio, it didnt get to that. Although anything felt possible as the balls kept getting wet. The first shot was a 6-iron from 206 out that almost stuck. I thought it was perfect, Garcia said. Straight at the flag. I dont know, if it carries probably 2 more feet its probably good. And it probably carries a foot less, it probably doesnt go off the green and probably stays on the fringe. But unfortunately I flew it on the perfect spot for it to come back. From there, his penalty shots couldnt stay on the green. I kept hitting good shots with the sand wedge, Garcia said. The ball just wouldnt stop. The problem was the front pin, which rested atop a false front that drains into the pond. There was no good place to hit the ball. That false edge is pretty significant, Tiger Woods said. Its a very difficult pin. Tell it to Sergio, who came here looking to repeat as Masters champion and found himself the star of a golfing horror show. It may perfectly reflect his roller-coaster career champion one round, punch line the next. His 13 was even a conundrum for the people who run the hand-operated scoreboards here. They didnt have a 13 to post, so they made a new one by handwriting 13. Sergio just shrugged like Sergio does. He was sticking with his story that he played well and it just didnt work out. Its the first time in my career where I made a 13 without missing a shot, Garcia said. Tin Cup McAvoy couldnt have said it any better. More from Yahoo Sports: Player breaks up no-hitter by breaking unwritten rule Freakishly strong athlete has NFL teams attention Jeff Passan: Rockies stars deal shows how much MLB has changed ESPN cuts to commercial at worst possible time ]", "title": "Garcia struggles to explain five straight shots in water at Masters", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/Df6KZdWOEYF1TcElDuIPBg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTM5NjQ7aD0yNzM3O3NtPTE7aWw9cGxhbmU-/http://media.zenfs.com/en/homerun/feed_manager_auto_publish_494/d3fc1c1235a42af6d6673bc9ce74390e.cf.jpg"}], "https://weather.com/news/news/2018-04-05-earthquake-southern-california": [{"author": "", "description": "The earthquake struck 17 miles southwest of Channel Islands Beach around 12:30 p.m. local time.", "publishedAt": "2018-04-05T21:41:21Z", "source": "Weather.com", "text": "[Next Article, Susan Combs, Longtime Opponent of Endangered Species Act, to Oversee Wildlife Policy at Interior Department, 00:49Earthquake Strikes Off Southern California CoastMeteorologist Kait Parker reports that a 5.3 magnitude earthquake was felt off the coast of Southern California Thursday afternoon. A magnitude 5.3 earthquake was reported Thursday afternoon off the coast of California near Los Angeles. According to the U.S. Geological Survey, the earthquake struck approximately 35 miles southwest of Channel Islands Beach at about 12:30 p.m. local time. No injuries were reported in the immediate aftermath of the tremor, but residents said theyfelt the shaking. It was the largest earthquake to strike the Channel Islands region since a 6.0 temblor in 1981,Caltech seismologist Egill Hauksson told the Los Angeles Times. No significant damage has been reported after a magnitude 5.3 earthquake in the Channel Islands region off the Southern California coast, but some bricks fell from a chimney at a historic ranch on one of the islands, according to the Associated Press. Channel Islands National Park spokeswoman Yvonne Menard told AP that the bricks fell Thursday at a ranch building on Santa Cruz Island that dates to the 1860s. Menard says the quake was felt by visitors and staff on the island. The quake's epicenter was 17 miles from Santa Cruz Island, which is largely unpopulated but does have some staff and is visited by campers. Authorities in Los Angeles and Ventura counties did not report any immediate damage. The National Tsunami Warning Center said there is no tsunami threat to the California coast. Copyright TWC Product and Technology LLC 2014, 2018]", "title": "Earthquake Shakes Southern California; No Injuries Reported, But Historic Ranch Damaged in 5.3 Magnitude Tremor  The Weather Channel", "urlToImage": "https://s.w-x.co/screen_shot_2018-04-05_at_3.42.53_pm.png"}], "https://wtop.com/education/2018/04/ex-tennessee-teacher-who-fled-with-teen-to-plead-guilty/": [{"author": "The Associated Press", "description": "NASHVILLE, Tenn. (AP) — A Tennessee teacher who set off a nationwide manhunt last year after he fled with a 15-year-old student broke down in court Thursday after pleading guilty to crossing state lines to…", "publishedAt": "2018-04-05T23:26:15Z", "source": "Wtop.com", "text": "[NASHVILLE, Tenn. (AP) A Tennessee teacher who set off a nationwide manhunt last year after he fled with a 15-year-old student broke down in court Thursday after pleading guilty to crossing state lines to have sex with a minor. Former forensics teacher Tad Cummins, 51, also pleaded guilty Thursday to obstruction of justice before U.S. District Judge Aleta Trauger in federal court in Nashville. I cannot be the man I need to be and not tell the truth, he said before losing his composure and starting to weep. Cummins faces a mandatory minimum of 10 years in prison for crossing state lines for sex with a minor. He also faces up to 20 years for obstruction of justice for destroying his and his former students cellphone when he fled with her. He will be sentenced later this year. The victim was in court, but did not speak afterward, but a spokesman for U.S. Attorney Donald Cochran said that prosecutors were relieved on her behalf. This decision today to plead guilty pleases us in the fact that at this point the victim will no longer have to face a lengthy trial and can go about her life, spokesman David Boling said afterwards. A federal prosecutor told the court that Cummins engaged in sexual activity with the girl several times in a classroom closet at school and in a car. They first had intercourse after he took her out of state, according to authorities. Cummins was married at the time and is a father and grandfather. Since he was jailed, he has called his wife who filed for divorce after he disappeared to ask for forgiveness, Assistant U.S. Attorney Sara Beth Myers told the court. Cummins disappeared with the girl last March. They were found in April at a remote forest cabin near Cecilville, California, following a tip to police. Cummins had planned to take the girl to Mexico and took a kayak from San Diego on a test run, the prosecutor said. He switched license plates twice, disabled his vehicles GPS system, used aliases, altered his appearance, paid only in cash and used back roads during his nearly six weeks on the run, according to court documents. Authorities credit the caretaker of the remote northern California property for helping police find the girl and arrest her alleged abductor. The girl was found safe. Cummins taught at Culleoka Unit School in Culleoka, south of Nashville. He was fired a day after the Tennessee Bureau of Investigation issued an Amber Alert about the teen. The Tennessee Board of Education revoked Cummins teaching license in July. ___, This story has been corrected to show spelling of last name is Cummins. Copyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, written or redistributed. Need a break? Play a quick game of solitaire or Sudoku. Or take one of our fun quizzes!]", "title": "Ex-Tennessee teacher who took teen across US pleads guilty  WTOP", "urlToImage": "https://wtop.com/wp-content/uploads/2018/03/Missing_Student_Tennessee_91294.jpg"}], "https://www.cbsnews.com/news/youtube-shooting-nasim-aghdam-legal-firearm-san-bruno-california/": [{"author": "CBS/AP", "description": "Nasim Aghdam bought the 9mm Smith and Wesson in January and used it in Tuesday's attack that left three people wounded", "publishedAt": "2018-04-06T01:47:00Z", "source": "CBS News", "text": "[Details are emerging about the woman behind the YouTube headquarters shooting Tuesday that injured three people in San Bruno, California. Police said Thursday that Nasim Aghdam legally purchased the firearm in San Diego on January 16, 2018 from a gun dealer in her name. It was a 9mm Smith and Wesson that had a capacity of 10 rounds. San Bruno police confirm that one of the magazines was empty and that Aghdam loaded a second to fire more shots at YouTube employees before she turned the firearm on herself. However, authorities have not been able to confirm how many total shots were fired and that there is a possibility that the first magazine may have not been fully loaded. Authorities have promised a deeper investigation into the shooter's past and her anger with the policies of the world's largest online video website, identified as her motive for attacking it. This will be a long and very methodical investigation, said Geoff Caldwell, a police commander in San Bruno, a city just south of San Francisco where YouTube is located. Investigators will likely scrutinize Aghdam's movements during the nearly nine-hour drive from her family's home near San Diego to the YouTube campus, examine the bizarre videos she posted online and look for any messages she may have sent to company officials. Aghdam, an Iranian native in her late 30s, walked through a parking garage into a courtyard at the campus Tuesday and opened fire, police said. She wounded three people before killing herself. YouTube said Wednesday it will increase security at its headquarters and offices around the world. Police have previously said Aghdam went to a gun range before arriving at YouTube. Caldwell declined to identify the range but said employees contacted police after the shooting to report she had practiced there. Officers spent nearly two hours Wednesday at the Jackson Arms Shooting Range in South San Francisco, a few miles from YouTube headquarters. The most seriously wounded victim, a 36-year-old man initially classified as critically injured, was upgraded to fair condition Thursday. Two women who were wounded have been released from hospitals. Aghdam was prolific at producing videos and posting them online. She exercised, promoted animal rights and explained the vegan diet, often in bizarre productions with elaborate costumes or carrying a rabbit. She posted the videos under the online name Nasime Sabz, and a website in that name decried YouTube's policies, saying the company was trying to suppress content creators. Youtube filtered my channels to keep them from getting views! one of the messages said. YouTube had no comment about any actions related to Aghdam's videos. Female suspect died from self-inflicted gunshot wound and several others were wounded April 3, 2018, in San Bruno, Calif. Her father, Ismail Aghdam, told the Bay Area News Group that he warned police the day before the attack that his daughter was upset with how YouTube handled her videos and might be planning to go to its offices. San Diego sheriff's Lt. Karen Stubkjaer said Thursday that the father never told deputies that she was a danger to herself or others when he reported her missing. Police in the San Francisco Bay Area city of Mountain View said they spoke to Ismail Aghdam twice after contacting the family to report finding his daughter sleeping in her car early Tuesday. Police say he also never told them she could become violent or pose a threat to YouTube employees. Federal and state investigators have searched two homes associated with the family, collecting evidence. Aghdam also ran a Farsi-language public channel on the messaging app Telegram, which had 6,000 followers. One video was a tutorial about how to massage buttocks, and another featured a song praising Bahaism, a religion that originated in Iran but is heavily suppressed by the Islamic Republic. People in Iran expressed pity and shock that Aghdam would shoot others in a country that allows more social media freedom. State TV briefly reported the shooting based on international reports. Hossein Naderi, a 23-year-old art student in Tehran, questioned why Aghdam chose to live in America, adding, I wish I was there to use YouTube freely. Kimia Shobeiri, 18, suggested the shooting was a ploy to get attention. She was insane and just wanted to make herself famous, she said. With this act she damaged the reputation of Iranians. The adult-film star and director is being threatened with financial ruin, but she wants to set the record straight about her alleged affair with Donald Trump, Anderson Cooper on his 60 Minutes interview with the porn star: I think there's more to come on this story, Student-led protests in the nation's capital and nationwide call for stronger gun laws in response to school shootings in Parkland, Fla. and elsewhere, Copyright 2018 CBS Interactive Inc.All rights reserved.]", "title": "YouTube shooter legally purchased firearm in San Diego earlier this year - CBS News", "urlToImage": "https://cbsnews1.cbsistatic.com/hub/i/r/2018/04/05/086b5249-d700-48bb-8d5a-b3d436694ca3/thumbnail/1200x630/a734f220d65ccca2e3ae657581fe2596/0405-ctm-youtubeshooter-blackstone-1538895-640x360.jpg"}], "https://www.cnn.com/2018/04/05/health/surgeon-general-naloxone/index.html": [{"author": "Susan Scutti and Robert Jimison, CNN", "description": "Issuing the first Surgeon General's Advisory in 13 years, Dr. Jerome Adams encouraged Americans to carry naloxone, an opioid overdose-reversing drug.", "publishedAt": "2018-04-05T19:55:00Z", "source": "CNN", "text": "[Set edition preference:, Set edition preference:, Set edition preference:, By Susan Scutti and Robert Jimison, CNN, Updated 3:55 PM ET, Thu April 5, 2018 Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds. (CNN)The US surgeon general issued an advisory Thursday recommending that more Americans carry the opioid overdose-reversing drug, naloxone. See the latest news and share your comments with CNN Health on Facebook and Twitter. ]", "title": "Americans urged to carry opioid overdose antidote naloxone - CNN", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/171027084558-opioides-super-tease.jpg"}], "https://www.cnn.com/2018/04/05/politics/caravan-trump-mexico/index.html": [{"author": "Chris Cillizza, CNN Editor-at-large", "description": "On Thursday morning, President Donald Trump tweeted this: \"The Caravan is largely broken up thanks to the strong immigration laws of Mexico and their willingness to use them so as not to cause a giant scene at our Border. Because of the Trump Administrations …", "publishedAt": "2018-04-05T17:46:49Z", "source": "CNN", "text": "[By Chris Cillizza, CNN Editor-at-large, Updated 2:49 PM ET, Thu April 5, 2018 Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds. (CNN)On Thursday morning, President Donald Trump tweeted this: The Caravan is largely broken up thanks to the strong immigration laws of Mexico and their willingness to use them so as not to cause a giant scene at our Border. Because of the Trump Administrations actions, Border crossings are at a still UNACCEPTABLE 46 year low. Stop drugs. ]", "title": "The single biggest thing Donald Trump doesnt get about the caravan - CNNPolitics", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/180402002659-mexico-migrant-caravan-super-tease.jpg"}], "https://www.npr.org/sections/thetwo-way/2018/04/05/599711119/nyc-police-fatally-shoot-unarmed-black-man-believing-he-had-a-gun": [{"author": "James Doubek", "description": "Officers shot and killed Saheed Vassell, 34, after mistaking a pipe in his hand for a gun. On Thursday, after a wave of protest, police released materials showing the moments before the confrontation.", "publishedAt": "2018-04-05T23:17:24Z", "source": "Npr.org", "text": "[ James Doubek Colin Dwyer A resident pins the Jamaican national flag at a makeshift community memorial for Saheed Vassell on Thursday. Bebeto Matthews/AP hide caption, A resident pins the Jamaican national flag at a makeshift community memorial for Saheed Vassell on Thursday. Updated at 7:15 p.m. ET, Roughly one day after New York City police officers shot and killed a mentally ill black man the department has released video clips and transcripts of the 911 calls received in the moments leading up to the confrontation. The four officers had opened fire Wednesday afternoon on Saheed Vassell, 34, after mistaking a metal pipe in his hand for a firearm. In the video, pulled from security camera footage in Brooklyn's Crown Heights neighborhood, Vassell appears to pull the pipe on several passersby, pointing it at them in gestures reminiscent of aiming a handgun. The transcripts displayed show several callers referring to a possible gun in his hand. There's a guy walking around the street, reads one transcript, he looks like he's crazy but he's pointing something at people that looks like a gun and he's popping it as if like if he's pulling the trigger. Five officers responded to the calls around 4:40 p.m. NYPD Chief of Department Terence Monahan told reporters. Monahan said four of the officers opened fire after Vassell took a two-handed shooting stance and pointed an object at the approaching officers. Monahan said they fired 10 times, while Vassell was struck a total of nine times, according to New York City's chief medical examiner Thursday. It was only after Vassell hit the ground that police say they discovered he had been holding a metal pipe with a showerhead, not a weapon. In the hours after the shooting, anger and sadness swept through Crown Heights, the neighborhood where he spent most of his life and where residents say he was a well-known and well-liked figure. Man, that's our boy, David Bailey told NPR's Joel Rose. We know this man for like, ever since. He comes to hang out in the barbershop, you know what I mean. Bailey and others said Vassell's struggles with mental illness were also well-known, even among local police: It's visible. You could see it, Bailey added. Listen, Ray Charles could see that man was crazy. A makeshift memorial for Saheed Vassell, 34, stands Thursday in the lobby of the apartment building that neighbors identified as his father's residence. Joel Rose/NPR hide caption, A makeshift memorial for Saheed Vassell, 34, stands Thursday in the lobby of the apartment building that neighbors identified as his father's residence. Vassell's father, Eric, told The New York Times that his son had been hospitalized multiple times in recent years with bipolar disorder. In comments to the New York Daily News, he said his son had refused treatment and had not taken medication for the condition in years. We were always worried for him, he told the Daily News. We would say, 'Should anything happen to him, we just have to do what we can do.' Monahan, however, disputed the notion that officers could have known about Vassell's mental illness. This was not an emotionally disturbed call, he told reporters. That was a call of a man pointing what 911 callers and people felt was a gun at people on the street. When we encounter him, he turns with what appears to be a gun at the officers. An image of the pipe found at the scene of the police shooting, provided by the New York Police Department. New York Police Department hide caption, An image of the pipe found at the scene of the police shooting, provided by the New York Police Department. But some of Vassell's neighbors questioned why police fired so quickly and so many bullets. Witnesses told the Times that the officers appeared to fire almost immediately after they got to the scene, and that they did not hear the officers say anything to the man before firing, while another witness said she heard the officers and the man exchange some words. As many as 200 onlookers gathered at the scene immediately after the shooting, resident Shaya Tenenbaum told The Associated Press, and several of them shouted at police. Protesters carrying Black Lives Matter signs arrived later in the evening, the Times reports. Members of the crowd wept at how the shooting fell on the 50th anniversary of the Rev. Martin Luther King Jr.'s assassination. Vassell's death comes as the police shooting of Stephon Clark, an unarmed black man, has ignited protests in Sacramento, Calif. that have lasted weeks. They need to get it together, a longtime neighbor of Vassell's, named Angie Lewis, told Joel. Stop acting, responding before you find out more. I could see you shot him in his hand, his foot. Ten bullets for what. Residents told news outlets that the younger Vassell was well-known in the neighborhood as mentally ill but generally harmless. All he did was just walk around the neighborhood, 38-year-old Andre Wilson, who said he knew Vassell for 20 years, told the Daily News. He speaks to himself, usually he has an orange Bible or a rosary in his hand. He never had a problem with anyone. Scores of people gathered for a vigil and protest Thursday in Crown Heights, where local media report the rally rippled with chants of no justice, no peace. New York Attorney General Eric Schneiderman has announced his office is opening an investigation into the incident, noting that we're committed to conducting an independent, comprehensive, and fair investigation. Mayor Bill de Blasio called the shooting a tragedy in comments to the media. This is someone who had a profound mental health problem was not on medication, hadn't been on medication, de Blasio said. A man like this, if he had gotten the help we needed, hopefully would never have been in a situation where such a horrible painful, tragedy would have occurred. The Two-Way is the place to come for breaking news, analysis and for stories that are just too interesting or too entertaining to pass up. Get in touch with your questions, comments and leads. NPR thanks our sponsors, Become an NPR sponsor]", "title": "NYC Police Release Video, 911 Transcripts After Fatal Shooting Of Black Man  The Two-Way  NPR", "urlToImage": "https://media.npr.org/assets/img/2018/04/05/ap_18095707234746_wide-78ec6d3c8dda6d7dae810c8dd658d396b480ef7d.jpg?s=1400"}], "https://www.npr.org/sections/thetwo-way/2018/04/05/599846489/cdc-epidemiologist-found-dead-weeks-after-going-missing-drowning-suspected": [{"author": "Amy Held", "description": "The body of Timothy Cunningham was found near his Atlanta home in a rugged area that was difficult to access. While there were no signs of foul play, police say questions remain unanswered.", "publishedAt": "2018-04-05T22:13:39Z", "source": "Npr.org", "text": "[ Amy Held Police said the body of CDC epidemiologist Timothy Cunningham was found along the banks of an Atlanta river seven weeks after he vanished. Foul play is not suspected, but questions remain unanswered. Centers for Disease Control and Prevention hide caption, Timothy Cunningham, a 35-year-old epidemiologist at the Centers For Disease Control and Prevention, vanished after leaving work Feb. 12, complaining he felt unwell; some seven weeks later, his decomposed body was spotted by fishermen in a rugged area along the banks of the Atlanta area's Chattahoochee River, according to officials. We have no indication of foul play, Maj. Michael O'Connor with the Atlanta Police Department said at a press conference Thursday. Fulton County Medical Examiner Jan Gorniak said the cause of death is probably drowning. But tests, including a toxicology screening, are still pending. Gorniak added that the condition of Cunningham's body is consistent with having been in the water since the day he went missing and that there were no signs of trauma or underlying medical conditions. Officials said Cunningham's body was recovered Tuesday evening. Since his disappearance, Cunningham's friends, family and CDC co-workers had been questioned and a $10,000 reward offered. And yet many questions remain unanswered. Police do not know, for example, how Cunningham's body got onto the banks of the river. The area not far from Cunningham's home was inaccessible by walking, police said, noting they struggled to find a place to launch a boat to reach his remains. We do know that he was a jogger and he was wearing his favorite jogging shoes at the time that he was found, O'Connor said. I can't tell you that he was jogging, but those two things together seem to indicate that that's a possibility. O'Connor said three crystals were in his pocket for unknown reasons, although Cunningham was an avid rock collector. In the days after he went missing, Cunningham's case drew intense media scrutiny and speculation about what had happened in what police called unusual circumstances. On the morning he went missing, his supervisor at the CDC talked to him about why he had been passed over for a promotion, police said. When he left work later in the day, it was the last time he was known to have been seen alive. All of his belongings including wallet, keys and passport were found inside his Atlanta home. According to The New York Times, his family said that their last phone conversations with Cunningham had left them worried and that he sounded not like himself. By outward appearances, Cunningham seemed to have a successful career. He received his master's and doctoral degrees from Harvard's school of public health. The Times reports that Cunningham was promoted in July to commander in the uniformed United States Public Health Service. His CDC biography says he was a team lead with the Division of Population Health and had deployed for several public health emergencies including Superstorm Sandy, Ebola, and Zika. Last year, Cunningham was quoted in an NPR report about the death rate declining among black Americans. The major drivers of this are decreases in many of the leading causes of death, such as heart disease, cancer and stroke, Cunningham told NPR's Rob Stein. Cunningham stressed, however, that as a group, black Americans still have an overall life expectancy that is four years shorter than white Americans. Many younger African-Americans in their 20s, 30s and 40s are living and dying with chronic conditions that we more typically see in the older population, Cunningham told Stein. There's still work to do. On Thursday, O'Connor said the circumstances around Cunningham's own death may never be understood. Barring new information coming forward, we may never be able to tell you how he got into the river. The Two-Way is the place to come for breaking news, analysis and for stories that are just too interesting or too entertaining to pass up. Get in touch with your questions, comments and leads. NPR thanks our sponsors, Become an NPR sponsor]", "title": "CDC Epidemiologist Found Dead Weeks After Going Missing, Drowning Suspected  The Two-Way  NPR", "urlToImage": "https://media.npr.org/assets/img/2018/04/05/cunningham-225px_wide-0e7d9eb98293b803c72d2df7a0ab2d7371cca6dc.jpg?s=1400"}], "https://www.nytimes.com/2018/04/05/business/trump-trade-war-china.html": [{"author": "Ana Swanson and Keith Bradsher", "description": "President Trump said he would consider imposing tariffs on an additional $100 billion worth of Chinese goods in retaliation for China’s plan to impose its own tariffs on American products.", "publishedAt": "2018-04-06T00:15:59Z", "source": "The New York Times", "text": "[Advertisement, By ANA SWANSON and KEITH BRADSHERAPRIL 5, 2018, WASHINGTON President Trump said Thursday that the United States would consider slapping an additional $100 billion in tariffs on the Chinese, escalating a potentially damaging trade dispute with Beijing. Mr. Trump said in a statement that he was responding to unfair retaliation by China, which published a list on Wednesday of $50 billion in American products that would be hit by tariffs, including soybeans and pork. That move was a direct reaction to the $50 billion in tariffs on Chinese goods that the White House detailed on Tuesday. Rather than remedy its misconduct, China has chosen to harm our farmers and manufacturers, Mr. Trump said, adding that he has instructed the United States trade representative to determine if another $100 billion in tariffs were warranted and, if so, to identify the products upon which to impose such tariffs. The announcement came one day after some of Mr. Trumps advisers tried to calm markets and tamp down fears of a trade war between the worlds two largest economies, saying that the tariff threats were the first step in a negotiation process. Mr. Trump said in his statement that the potential for new tariffs would not preclude discussions with the Chinese to protect the technology and intellectual property of American companies and American people, but any new tariffs are unlikely to make that already tough task easier. Advertisement, The move is a high-stakes gamble aimed at cowing China into backing down and forcing it to make the kinds of changes that the United States is seeking namely reducing the coercive tactics American officials say Beijing uses to try to dominate leading-edge industries like artificial intelligence, robotics and autonomous vehicles. But the move could ultimately bring about the kind of retaliation from Beijing that has spooked stock markets. Advertisement, It also means that the United States would be somewhat more likely to place levies on Chinese products that American households routinely purchase, like furniture, clothing or shoes an outcome the Trump administration said it sought to avoid with its initial round of tariffs. The presidents announcement was immediately criticized by manufacturers, retailers and politicians from states whose economies depend on agriculture. Senator Ben Sasse, Republican of Nebraska, said Mr. Trump was threatening to light American agriculture on fire. Hopefully the president is just blowing off steam again, but if hes even half-serious, this is nuts, Mr. Sasse said. Lets absolutely take on Chinese bad behavior, but with a plan that punishes them instead of us. This is the dumbest possible way to do this. A trade war could derail the current global economic expansion and cripple American businesses that depend on business with China. It could also further complicate geopolitical priorities given the Trump administration has enlisted the help of the Chinese in scheduling historic talks with North Korea next month. In a statement, Robert Lighthizer, the trade adviser who is carrying out an investigation into Chinese practices, described the presidents threat as an appropriate response, saying China should have responded to the initial tariffs levied by the United States by changing its behavior. In the first hint of the Chinese governments response to Mr. Trumps latest action, the Weibo miniblog of the official Xinhua news service said that this move severely violates world trade regulations. Advertisement, Zhu Guangyao, Chinas vice minister of finance, made clear at a news conference on Wednesday afternoon that his country would not back down easily. If anyone wants to fight, well be there with them. If he wants to negotiate, the door is open, Mr. Zhu said. Mr. Trumps effort to raise the stakes on Thursday seemed poised to send financial markets spinning, with futures on the Standard &amp; Poors 500-index down and the yen climbing against the dollar. American companies want a level playing field with their Chinese counterparts. China wants to build its industries into sophisticated global competitors. This week, both countries demonstrated a willingness to escalate trade tensions to defend their positions. Companies potentially caught in the middle of a trade war called on the Trump administration to back down and try to work with the Chinese. The announcement that the administration may issue $100 billion in additional tariffs on Chinese products is irresponsible and destabilizing, said Dean C. Garfield, the chief executive of the Information Technology Industry Council, which represents companies such as Amazon, Apple and IBM. We call on both sides to halt unproductive and escalatory rhetoric, recognizing that these words and actions have global consequences. China experts have questioned whether Mr. Trumps aggressive negotiating style will leave Chinese leaders with enough political room to make concessions to the Americans. Bowing to the presidents demands could be seen internally as weakness, and the changes that the administration wants reducing Chinas dominance in cutting-edge manufacturing and technology is not something Beijing is likely to agree to. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. View all New York Times newsletters. Wang Shouwen, Chinas vice minister of commerce, has repeatedly refused to discuss curbing the Made in China 2025 industrial plan. The Trump administration contends that the program violates international trade rules that prohibit countries from using subsidies to help exporters and discourage imports. Mr. Wang and other officials deny that the program is in violation, but have provided few details on how it might comply. Including this most recent action, the United States would be placing tariffs on a total of $153 billion of Chinese products. The threat of $100 billion in tariffs came on top of the tariffs on $3 billion in Chinese steel and aluminum that he imposed last month and the tariffs on a further $50 billion in Chinese goods that he has threatened to impose in recent days. The total is now so large that China would have trouble finding enough American goods to penalize if it sought to impose a proportional retaliation. China bought only $130.4 billion worth of American goods last year, while the United States bought $505.6 billion worth of Chinese goods. The National Retail Federation blasted the move as a dangerous game of chicken that would put the United States on the losing end of a trading relationship that has benefited American companies and consumers. Advertisement, This is what a trade war looks like, and what we have warned against from the start. We are on a dangerous downward spiral, and American families will be on the losing end, Matthew R. Shay, the president and chief executive of the retail group, said in a statement. We urge the administration to change course and stop playing a game of chicken with the nations economy. The Chinese have tools other than tariffs at their disposal, including limiting the operations of American banks and other service providers in China. The government could also urge the Chinese public not to buy American-brand cars like Chevrolets and Fords, even though those are built almost entirely from Chinese-made parts and assembled in factories in China. The biggest question would be whether China would start retaliating not commercially but through geopolitical actions. While Trump administration trade officials appear to have been operating with considerable autonomy from those responsible for issues like North Korea and Taiwan, policymaking is much more unified in China. That means China could try to raise the temperature in the dispute by installing more military equipment on the artificial islands that it has recently built across the South China Sea, almost to the shores of Indonesia, Malaysia and the Philippines. China could also step up pressure on Taiwan. Beijing leaders are already deeply upset about recent congressional approval of the Taiwan Travel Act, which urged Mr. Trump to send administration officials to the self-governing island. Beijing regards Taiwan as a breakaway province, and has threatened to use force to reunite it. Chinese experts have made clear that they perceive the ever-larger rounds of American tariffs as part of a broad American challenge that goes beyond dollars and cents. It is more than just a trade issue: It involves geopolitical reasons, Wu Xinbo, the chief of the Center for American Studies at Fudan University in Shanghai, said in an interview this week. Trump has mentioned before, if China doesnt agree on economy and trade, the U.S. will reconsider China issues that includes the South China Sea and Taiwan. President Xi Jinping of China is scheduled to give a major speech on Tuesday at the Boao Forum on Chinas Hainan island, which may give more clues to Chinas response. The speech has been billed by other Chinese officials as a moment when Mr. Xi would lay out a blueprint for Chinas economic overhaul and liberalization, a potential peace offering to the Trump administration, said Scott Kennedy, a China expert at the Center for Strategic and International Studies. President Trumps move may throw a small monkey wrench into Xis plans, Mr. Kennedy said. He may now need to couple such a proposal with the warning that China will continue to defend itself against foreign pressure. Ana Swanson reported from Washington, and Keith Bradsher from Shanghai. A version of this article appears in print on April 6, 2018, on Page A1 of the New York edition with the headline: Trump Escalates Fight With China In Tariff Threat. Order Reprints| Today's Paper|Subscribe, Were interested in your feedback on this page. Tell us what you think. Go to Home Page ]", "title": "Trump Doubles Down on Potential Trade War With China - The New York Times", "urlToImage": "https://static01.nyt.com/images/2018/04/06/us/politics/06dc-tariffs-TRUMP/merlin_136439370_4d6d9393-6437-42f3-939a-9689d035d2b6-facebookJumbo.jpg"}], "https://www.nytimes.com/2018/04/05/climate/epa-chief-scott-pruitt-pressure.html": [{"author": "https://www.nytimes.com/by/coral-davenport, https://www.nytimes.com/by/lisa-friedman", "description": "A star in President Trump's campaign to roll back regulations, he now faces a swirl of ethics questions and may be losing the confidence of the White House.", "publishedAt": "2018-04-05T23:17:30Z", "source": "The New York Times", "text": "[Advertisement, Supported by, By Coral Davenport and Lisa Friedman, WASHINGTON A spreading crisis has threatened to engulf Scott Pruitt, the chief of the Environmental Protection Agency, who until recently ranked among the stars of the Trump administration. Now, he is mired in a series of ethical questions about his housing arrangements, staffing decisions and costly travel at taxpayer expense. Senior White House officials say that Mr. Pruitts fate has become uncertain. On Thursday, one of the central questions facing the E.P.A. chief his decision in 2017 to rent a room in Washington from the wife of a top energy lobbyist was exacerbated when an E.P.A. ethics official walked back his earlier assessment that Mr. Pruitt had done nothing wrong. In a new memo made public Thursday, the official said that he did not have all the facts when he made his initial finding. On Wednesday one of Mr. Pruitts top advisers, Samantha Dravis, resigned and Mr. Pruitts chief of staff, Ryan Jackson, has grown frustrated enough that he has also considered resigning, according to three people in whom Mr. Jackson has confided. Most ominously for Mr. Pruitt, however, senior White House officials signaled Thursday that the E.P.A. chiefs standing was shaky. I cant speak to the future of Scott Pruitt, said Hogan Gidley, a White House spokesman, on Fox News on Thursday morning. It added up to a major crisis for a cabinet member who, despite months of criticism over costly first-class travel and other practices, had aggressively helped the otherwise tumultuous Trump administration achieve one of its central goals the rapid rollback of regulations covering climate change, clean water and the use of chemical pesticides. In recent days, even as controversy swirled, Mr. Pruitt launched a rollback of the Obama administrations stringent regulations on planet-warming vehicle tailpipe pollution. In a powerful signal of the depth of concern among conservatives that they may be losing one of their standard-bearers, allies of Mr. Pruitt including the Heritage Foundation, Tea Party Patriots, and Americans for Prosperity, the advocacy group funded by the billionaire brothers Charles and David Koch, launched a coordinated social media campaign to save his job. As head of the @EPA, @EPAScottPruitt has been a leader in rolling back former President Obamas job killing regulations, the Tea Party Patriots wrote on Twitter, urging the groups 190,000 followers to retweet the message If you support Scott Pruitts conservative leadership at E.P.A.. Ultimately, of course, Mr. Pruitts fate will rest in the hands of Mr. Trump. Asked on Thursday by reporters aboard Air Force One if he was bothered by the latest reports on Mr. Pruitt, Mr. Trump replied, I have to look at them, and added, But hes a good man, hes done a terrific job. Last week Senator Thomas Carper, a Democrat from Delaware, wrote a letter to the E.P.A. inspector general requesting an investigation into allegations that Ms. Dravis did not attend work or perform her duties for most of November, December and January while continuing to draw a salary. The March 28 letter, obtained by The New York Times, said the information raises questions about whether the agency is adhering to internal rules regarding employee time and attendance. A spokesman for the E.P.A. inspector general, Jeffrey Lagda, confirmed that his office has received the request and said he could not comment on whether the agency has taken up the investigation. Jahan Wilcox, a spokesman for the E.P.A. disputed the allegation. It is completely baseless and absurd to assert that someone with her responsibilities and office would have been away from her duties and responsibilities for months at a time as alleged, Mr. Wilcox said in a statement. Last week, when questions arose about Mr. Pruitts 2017 lease in which he rented a room for $50 a night from the wife of J. Steven Hart, an energy industry lobbyist the E.P.A. made public a finding by the agencys ethics counsel stating that the price Mr. Pruitt paid for the use of the apartment was reasonable market value. However, in the follow-up memo, obtained Thursday by the Campaign Legal Center, a watchdog group, the same in-house lawyer said he did not have all the facts when making his initial assessment of the lease. In a second memo he also released a copy of the lease, which shows Mr. Harts name crossed out and the name of his wife, Vicki, inserted. Walter J. Shaub, a senior ethics official under President Barack Obama, said the original ethics opinion had been predicated on the understanding that Mr. Pruitt was leasing only one room in the apartment. But since then, there have been reports that Mr. Pruitts daughter stayed there while she was a White House intern. If it turns out Pruitts daughter was allowed to stay in the other room, he had both rooms in the residence. Theres a big difference in what youd pay to stay in a flop house with strangers and what youd pay to have a place to yourself, Mr. Shaub said. At the White House on Thursday, officials said they had deep concerns about Mr. Pruitts conduct and worried that more allegations of misconduct could surface, further angering Mr. Trump, who has been displeased with the torrent of negative headlines about this E.P.A. chief. The president was particularly put off by Mr. Pruitts performance in an interview on Fox News, aides said. Asked about it on Air Force One on Thursday, Mr. Trump would only say: Its an interesting interview. But officials also noted that Mr. Pruitt was among the presidents favorites and a darling of his conservative base, making it possible for him to survive. In the interview Wednesday with Fox News, Mr. Pruitt pushed back on suggestions he had committed an ethical violation by renting the apartment. Asked if renting from the wife of a Washington lobbyist violated Mr. Trumps mantra of draining the swamp, Mr. Pruitt responded, I dont think thats even remotely fair to ask that question. In the same interview, he also denied responsibility for giving generous pay raises to two of his staff members that have also come under fire. The two aides, Sarah Greenwalt and Millan Hupp, had both worked for Mr. Pruitt in Oklahoma, where he served as attorney general before coming to the E.P.A. Ms. Greenwalts salary was raised to $164,200 from $107,435, while Ms. Hupps was raised to $114,590 from $86,460. My staff did and I found out about that yesterday, and I changed it, Mr. Pruitt said. The officials that were involved in that process should not have done what they did. At the E.P.A. headquarters in the William Jefferson Clinton building a few blocks from the White House, several senior staffers separately used the word toxic to describe the atmosphere at the agency, with its political appointees adopting a bunker mentality amid the questions about Mr. Pruitts behavior. Some career civil servants at the agency, many of whom have worked there through several presidential administrations and are dismayed over Mr. Pruitts policies, appeared hopeful at the prospect of the administrators downfall. One longtime agency official said some employees are now openly taking bets on how long the administrator will hold on to his job. The allegations of ethical missteps by Mr. Pruitt are now causing dismay among some of the Republicans he brought into the agency as well. One of those is Mr. Jackson, Mr. Pruitts chief of staff, a seasoned Washington insider who previously worked for years for Senator James Inhofe of Oklahoma, who is known as Congress most vocal denier of the established science of human-caused climate change. Mr. Jacksons frustration with his boss underscores how even the anti-regulation conservatives who once hailed the arrival of Mr. Pruitt have become disillusioned. Last year, Mr. Pruitt gained attention after requesting special privileges and protections including a full-time security detail and the installation of a $25,000 secure telephone booth in his office. At least five agency officials were demoted, reassigned or requested new assignments after raising objections to Mr. Pruitts spending and security decisions, The New York Times reported on Thursday. Mr. Pruitts friends say they believe the ethics questions are the result of a campaign by environmentalists. Robert E. Murray, the chief executive of Murray Energy and a major supporter of Mr. Pruitts, called him the star of the Trump administration. Things are coming in such a wave, its obvious that its a coordinated campaign, said David Rivkin, an attorney who represents industry opponents of E.P.A. rules and who has worked closely with Mr. Pruitt for years. Mr. Rivkin said that he expected Mr. Pruitt to survive the storm. Its happening because hes the most effective cabinet member, he said. Julie Hirschfeld Davis contributed reporting. Coral Davenport covers energy and environmental policy, with a focus on climate change, from the Washington bureau. She joined The Times in 2013 and previously worked at Congressional Quarterly, Politico and National Journal. @CoralMDavenportFacebook, Lisa Friedman reports on climate and environmental policy in Washington. A former editor at Climatewire, she has covered eight international climate talks. @LFFriedman, Advertisement, Collapse, SEE MY OPTIONS]", "title": "Growing Crisis Threatens Scott Pruitt, E.P.A. Chief, as Top Aides Eye the Exits - The New York Times", "urlToImage": "https://static01.nyt.com/images/2018/04/06/climate/06CLI-PRUITT/06CLI-PRUITT-facebookJumbo.jpg"}], "https://www.nytimes.com/2018/04/05/us/politics/trump-stormy-daniels-hush-money.html": [{"author": "Julie Hirschfeld Davis", "description": "In his first public remarks on the matter, President Trump told reporters that he knew nothing about the $130,000 paid to Stormy Daniels, remarks that could complicate his legal battle against her.", "publishedAt": "2018-04-06T01:09:45Z", "source": "The New York Times", "text": "[Advertisement, By JULIE HIRSCHFELD DAVISAPRIL 5, 2018, President Trump denied knowledge of a $130,000 payment to Stephanie Clifford, a pornographic film actress known as Stormy Daniels. It was the first time he commented publicly on the scandal. WASHINGTON President Trump denied on Thursday knowing of a $130,000 payment his lawyer made to a pornographic film actress who claims to have had a sexual encounter with him, an assertion that threatened to complicate his legal battle against her. Mr. Trump made his first public remarks about the matter aboard Air Force One as he returned to Washington from White Sulphur Springs, W.Va. where he had held a round table on tax cuts. Asked by a reporter if he knew about the payment to the actress, Stormy Daniels, whose given name is Stephanie Clifford, he said, No. Asked why Michael D. Cohen, his personal lawyer, had made the payment, Mr. Trump said: Youll have to ask Michael Cohen. Michael is my attorney, and youll have to ask Michael Cohen. The president said he did not know where the money had come from, and ignored a question about whether he ever set up a fund Mr. Cohen could draw from. Advertisement, Ms. Clifford has said that she was paid $130,000 before the 2016 election to buy her silence. She is now suing Mr. Trump to abrogate a nondisclosure agreement that was supposed to prevent her from discussing the relationship. She claims the agreement is null and void because Mr. Trump never signed it. Advertisement, The presidents comments on Thursday could create a predicament for him and his legal team. Ms. Cliffords case is based on the notion that the confidentiality agreement is invalid because Mr. Trump was not a party to it. By saying he was not aware of the agreement, Mr. Trump appeared to confirm that argument, which would mean neither party is legally bound by it, thus potentially paving the way for Ms. Clifford to break her silence without consequences. Ms. Cliffords pugnacious lawyer, Michael J. Avenatti, quickly issued a statement to respond to Mr. Trumps claim. He said that the presidents professed ignorance of the payment would improve his clients case, suggesting that he would use legal discovery to expose the back and forth around the payment. Our case just got that much better, Mr. Avenatti said in the statement. We very much look forward to testing the truthfulness of Mr. Trumps feigned lack of knowledge concerning the $130,000 as he stated on Air Force One. As history teaches us, it is one thing to deceive the press and quite another to do so under oath, he added. Later, Mr. Avenatti appeared to exult on Twitter about what he suggested were undisciplined comments by Mr. Trump that would give Ms. Clifford the upper hand in the legal dispute. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. View all New York Times newsletters. Good (actually GREAT) things come to those who wait!!! Mr. Avenatti wrote. The strength of our case just went up exponentially. You cant have an agreement when one party claims to know nothing about it. #nodiscipline. Mr. Cohen did not respond on Thursday to requests for comment. Charles Harder, a lawyer representing Mr. Trump in his legal wrangling with Ms. Clifford, also did not respond to requests for comment on the presidents remarks and how they could affect his case. Mr. Trump and a company affiliated with him filed papers in court on Monday seeking to force Ms. Clifford to raise her disputes through private arbitration, not lawsuits. Advertisement, Arbitration would shield the case from public view, sparing Mr. Trump the public spectacle that would attend a lawsuit with a discovery process and a trial. Mr. Avenatti said at the time that he would vigorously oppose the effort to resolve the case privately. In fact, on Thursday night, he said that Mr. Trumps remarks had made him more determined than ever to try to depose the president. If the president didnt know anything about the payment, then he obviously didnt know anything about the agreement, in which case you cant have an agreement, Mr. Avenatti said in an interview on MSNBC. And then there is no such thing as an NDA, he added, referring to a nondisclosure agreement. Now if, on the other hand, what he said on Air Force One is not accurate and I, for one, have serious questions as to its veracity or accuracy theyve got a whole host of problems, Mr. Avenatti said. The president and his lawyers have been working to prevent Ms. Clifford, who sat for a lengthy interview that aired on 60 Minutes last month, from making further public statements. In February, she said that she believed that Mr. Cohen had violated the agreement and that she, as a result, was no longer bound by it. Mr. Cohen secretly obtained a restraining order late that month to prevent her from speaking. Then last month, Mr. Trumps legal team filed a motion asking to move the case from state court to federal court, which may have been an effort to increase the likelihood that it would be resolved in arbitration. Jim Rutenberg contributed reporting from Los Angeles. A version of this article appears in print on April 6, 2018, on Page A15 of the New York edition with the headline: Trump Denies Knowledge Of Payment To Porn Star. Order Reprints| Today's Paper|Subscribe, Were interested in your feedback on this page. Tell us what you think. See More Go to Home Page ]", "title": "Trump Denies Knowing of Any Hush Money Paid to Porn Actress - The New York Times", "urlToImage": "https://static01.nyt.com/images/2018/04/06/us/politics/06dc-stormy/06dc-stormy-facebookJumbo.jpg"}], "https://www.nytimes.com/2018/04/06/world/asia/malaysia-elections-called-najib-razak.html": [{"author": "Hannah Beech", "description": "“It’s like a civil war in Malaysia right now,” one opposition figure said as Prime Minister Najib Razak muzzles the press and dissent ahead of the vote.", "publishedAt": "2018-04-06T04:45:19Z", "source": "The New York Times", "text": "[Advertisement, By HANNAH BEECHAPRIL 6, 2018, KUALA LUMPUR, Malaysia Malaysias leader has said he will dissolve Parliament on Saturday, paving the way for the most contentious general elections in the country since it gained independence more than six decades ago. The election will be a referendum on Prime Minister Najib Razak, who is running for a third term amid a lingering scandal involving billions of dollars that were diverted from a Malaysian state investment fund. The elections will pit Mr. Najib, who has vowed to make Malaysia great, against his erstwhile mentor Mahathir Mohamad, a former prime minister whose 22-year rule was as transformative as it was divisive. After years of hounding Malaysias political opposition, Dr. Mahathir, 92, defected from the governing coalition to partner with his former enemies. Its like a civil war in Malaysia right now, said Fahmi Fadzil, the communications director for the opposition Peoples Justice Party. Ive never seen this country so divided. Advertisement, Malaysias electoral commission will announce the date of the nationwide election next week, but it is expected to occur by mid-May. In the last general elections in 2013, campaigning was limited to just 15 days. Despite the brief run-up to the voting that year, however, the National Front coalition, which has run Malaysia since independence, lost the popular vote for the first time in history. Advertisement, Discontent with Mr. Najib has simmered for years, especially among members of Malaysias ethnic Chinese minority. But Mr. Najib, who is the scion of an ethnic Malay political dynasty, has been able to count on rural Malay constituents whose influence has been amplified by race-based policies that benefit them. The governing National Front alliance is dominated by Mr. Najibs United Malays National Organization, which has safeguarded preferential treatment for the Malay majority in areas ranging from government jobs to university places. In the run-up to the campaign season, the governing alliance appears to have focused on creating ideal conditions to assure Mr. Najibs re-election. On Thursday, a government body temporarily deregistered Dr. Mahathirs new political party because it had filed incomplete paperwork. Until the documentation is complete, Dr. Mahathirs political bloc will not be allowed to campaign or display its logo. There is no rule of law in this country, Dr. Mahathir said at a news conference late Thursday night. Najib is cheating to win the election by paralyzing his opponents. Even before the order to dissolve Parliament was announced on Friday, flags for the National Front began appearing at overpasses and major intersections in Kuala Lumpur, the nations capital. Banners for opposition parties, which are expected to band together under the Peoples Justice Party in order to contest the elections, were not on display. Two controversial bills were passed in the waning days of Parliament. One rejiggered voting districts so drastically that the opposition derided it as gerrymandering. Another piece of legislation made creating or circulating fake news punishable by up to six years in prison. The definition of fake news has not been made clear. Earlier this week, Mr. Najib promised to give raises to Malaysias 1.6 million civil servants, most of whom are Malay. The prime minister also vowed to lavish hundreds of millions of dollars on police officers and certain companies run by bumiputra, or sons of the soil, as Malays and indigenous peoples are known. Advertisement, Dr. Mahathir was the architect of the affirmative action program for Malays, who were discriminated against during British rule. Encouraging mass immigration by Chinese and Indians, the British also gave some prime jobs in the colonial administration and business sphere to non-Malays, fostering resentment that festers to this day. Pakatan Harapan, Malaysias opposition coalition, is an unwieldy collection of disparate forces that includes Chinese liberals, Islamists and nationalist Malays. Meaning alliance of hope in Malay, it is led by Dr. Mahathir, even though some of the coalitions most prominent members are veteran opposition leaders who were jailed or harassed during the former prime ministers long tenure. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. View all New York Times newsletters. Chief among them is Anwar Ibrahim, a former deputy prime minister to Dr. Mahathir who fell out of favor and was jailed on sodomy and graft charges that were widely seen as politically motivated. Mr. Anwar famously appeared in court in 1998 with a black eye that Dr. Mahathirs allies insisted was self-inflicted. Mr. Anwar is now back in prison after a second sodomy conviction. He is scheduled to be released in June. How the opposition will deal with two suns in its political solar system Dr. Mahathir and Mr. Anwar remains to be seen. The electoral choice is so uninspiring for some younger Malaysian voters that they have started a movement to cast spoiled ballots to protest the state of national politics. The National Front, however, says that it has delivered on 99 percent of its campaign pledges from 2013. The country of 30 million people is among Southeast Asias most prosperous, even though a study released last year by the United Nations and the Malaysian Health Ministry found high rates of child malnutrition. Our target is nothing short of being one of the top nations in the world, Mr. Najib said on Wednesday. Yet Malaysias international reputation has been damaged by a scandal surrounding the mishandling of at least $3.5 billion connected to the One Malaysia Development Berhad fund, known as 1MDB. An investigation by the United States Department of Justice, which is building a case to seize around $1.7 billion in assets connected to the fund, found that $731 million that was deposited into bank accounts controlled by Mr. Najib had come from 1MDB. Mr. Najib contends that the bulk of that money was given to him by a Saudi patron. Advertisement, For the prime minister, its either be re-elected or go to jail, said Mukhriz Mahathir, an opposition politician who is also Dr. Mahathirs son. The stakes could not be higher for him. Multiple Malaysian investigations into 1MDB have found no impropriety connected to Mr. Najib or his associates. Officials with 1MDB have said no money went missing from the fund. Mr. Najib has hinted that investigations by foreign countries into 1MDB are Western witch hunts. Both Mr. Najib and Dr. Mahathir have a record of blaming outsiders for stirring up dissent against them. Dr. Mahathir suggested that Jews were behind the Asian financial crisis in 1997. Mr. Najib has advised white people to stop interfering in Malaysian affairs. Malay populism is expected to be stirred up during the campaign, and some Malaysian minorities have characterized this election as an existential moment for a country that depends on a delicate balance of races for stability. Although numbers are hard to come by, an ethnic Chinese brain drain appears to be robbing Malaysia of qualified white-collar workers. If the opposition loses again, there will be no hope left, said Liew Chin Tong, an ethnic Chinese strategist for the opposition Democratic Action Party. I worry that some people will end up leaving Malaysia. Sharon Tan contributed reporting. Were interested in your feedback on this page. Tell us what you think. Go to Home Page ]", "title": "Malaysian Leader Jump-Starts Elections, and Stacks the Odds - The New York Times", "urlToImage": "https://static01.nyt.com/images/2018/04/07/world/07malaysia-2/07malaysia-2-facebookJumbo.jpg"}], "https://www.politico.com/story/2018/04/05/manafort-mueller-moves-to-seize-bank-accounts-505307": [{"author": "JOSH GERSTEIN", "description": "Special counsel also obtained search warrant for info on 5 phones in ongoing investigation just last month", "publishedAt": "2018-04-06T03:31:02Z", "source": "Politico", "text": "[ Special counsel Robert Mueller's office obtained a search warrant for information related to five telephone numbers controlled by AT&amp;T. | AP Photo, Special counsel also obtained search warrant for info on 5 phones in ongoing investigation just last month, By JOSH GERSTEIN, 04/05/2018 11:23 PM EDT, Special Counsel Robert Mueller's office moved to seize bank accounts at three different financial institutions last year just one day before former Trump campaign chairman Paul Manafort was indicted, prosecutors disclosed in a court filing Thursday. The previously unknown move against the bank accounts was revealed in a list of search and seizure warrants prosecutors submitted to a federal court in Washington after Manafort's defense team complained that the government was withholding too many details about how the warrants were obtained. Story Continued Below, The new filing also indicated that Mueller's investigators have been pressing on with their work in recent weeks despite the pair of indictments pending against Manafort and a detailed indictment in February of the Russia-based Internet Research Agency and a dozen Russian nationals for alleged interference in the 2016 U.S. presidential election. On March 9, the special counsel's office obtained a search warrant for information related to five telephone numbers controlled by AT&amp;T, the prosecution said. It did not reveal who the numbers belonged to, although it said some information about the search was given to Manafort's defense on Wednesday, so presumably there is some connection to the veteran political consultant who held a top role in the Trump campaign for several months in 2016. Prosecutors said some information about the various searches was withheld from Manafort because it relates to the identity of informants or to ongoing investigations that are not the subject of either of the current prosecutions involving Manafort. POLITICO reported in January that an errant court filing by the defense indicated that at least one employee of a Manafort consulting firm was surreptitiously cooperating with the FBI and journalists. Sign up for POLITICO Playbook and get the latest news, every morning in your inbox. By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time. Manafort is currently facing two separate indictments. One, in Washington, focuses on money laundering and foreign lobbying. Another, in Alexandria, Virginia, involves tax fraud, bank fraud and failure to report overseas bank accounts. The 69-year-old Manafort could potentially spend the rest of his life in prison if convicted in either case. Neither case appears to directly relate to the allegations of collusion between the Trump campaign and Russia that are at the heart of Mueller's mandate, but it was revealed this week that Deputy Attorney General Rod Rosenstein specifically authorized the special counsel's team to pursue the financial and foreign lobbying allegations against Manafort. The new filing by Mueller's team also confirms accounts that investigators obtained a warrant to search a storage locker belonging to Manafort, apparently somewhere in northern Virginia. All the warrants listed by prosecutors Thursday remain under seal and off limits to the public, but new details in the latest filing indicate that the storage unit search took place in late May or early June, about two months before the FBI conducted an early morning raid on Manafort's Alexandria, Va. condo. Manafort's lawyers have suggested some mystery surrounding the search of the storage locker. They say an FBI agent appears to have gotten into the locker before the search the a federal magistrate in Virginia ordered. Some press accounts have said investigators obtained a Foreign Intelligence Surveillance Act warrant to conduct a search of a storage locker belonging to Manafort at some point last year. It's possible they used that authority to enter the locker and then decided to obtain a criminal warrant to delve into whatever Manafort had inside.. Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning in your inbox. By Mark L. Rosenberg, By Jeff Greenfield, By Rich Lowry, By Jack Shafer, 2018 POLITICO LLC]", "title": "Mueller moved to seize bank accounts in Manafort probe - POLITICO", "urlToImage": "https://static.politico.com/e7/4d/00494d5b47f8a54673d16c54e3d1/robert-mueller-special-ap.jpg"}], "https://www.washingtonpost.com/news/capital-weather-gang/wp/2018/04/05/another-busy-atlantic-hurricane-expected-but-not-as-brutal-as-the-last-one/": [{"author": null, "description": "The forecast is for a total of 14 named storms, 7 hurricanes and 3 major hurricanes.", "publishedAt": "2018-04-05T14:26:45Z", "source": "The Washington Post", "text": "[Last years hurricane season was more than twice as active as a typical season, and an onslaught of storms left deep wounds across the Caribbean and southern United States that have not yet healed. But, ready or not, the 2018 Atlantic hurricane season begins on June 1. [2017 review: The Atlantic hurricane season from hell is finally over] As it has done every year since 1984, Colorado State University has releasedits initial predictions for the upcoming season. Its forecast is for a total of 14 named storms,seven hurricanes andthree major hurricanes, which is slightly above the long-term average of 12 named storms,six hurricanes and two major hurricanes. Last year, we saw 17 named storms, 10 hurricanes andsix major hurricanes. These 2018 predictions will be updated on May 31, July 2 andAug. 2. Two primary factors critical for determining how active the upcoming Atlantic hurricane season will be whether El Nio develops and the configuration of North Atlantic sea surface temperatures. WhenEl Nio conditions are present and ocean temperatures in the tropical Pacific are warm, the Atlantic hurricane season tends tobe less active. The reverse is true when La Nia,the opposite phase, prevails and the tropical Pacific waters are cool. Right now, the verdict is still out about which conditions, if any, will take control by the time hurricane season is underway. Similar to what occurred last winter, the tropical eastern and central Pacific cooled to weak La Nia conditions this past winter. These weak La Nia conditions have continued to persist, although there has been rising of sea surface temperatures in the eastern and central tropical Pacific in recent weeks. During the Northern Hemisphere spring, the future state of the El Nio andLa Nia is notoriously difficult to predict a phenomenon known as the springtime predictability barrier. The low-level windsthat force ocean circulation changes that drive El Nio and La Nia events are usually at their weakest during this time, and consequently, small changes in the atmosphere can have significant effects on whether El Nio develops. As a result, computer model forecasts are typically least reliable during the Northern Hemisphere spring. This lack of skill was clearly demonstrated last year, as most of the forecast models called for El Nio to develop by the peak of the Atlantic hurricane season. Instead, we ended up with neutral to weak La Nia conditions, which supported the very active season. The latest suite ofcomputer model guidance indicates a chance for El Nio development by the peak of the Atlantic hurricane season, but the majority of the model guidance calls for neutral conditions, that is, neitherEl Nio or La Nia andsea surface temperatures near their long-term average. At this point, CSU is anticipating that neutral conditions in the tropical Pacific are the most likely scenario for the summer/fall of 2018. In summary, the Pacific Ocean may not give us many predictive clues about the Atlantic hurricane season. Should the forecast forneitherEl Nio or La Niahold true in the Pacific, the configuration of Atlanticsea surface temperaturesbecomes very important for predictinghow active the hurricane season will be. Generally, the presence of warm water in the North Atlantic would tend to portend a busy season. The western North Atlantic Ocean is currently somewhat warmer than normal, while the far North Atlantic and eastern tropical Atlantic are slightly cooler than normal. Overall,sea surface temperatures dropped much faster than normal during this past winter, in large part because of a strong subtropical high pressure that dominated the North Atlantic during January and February, driving stronger winds that caused more mixing and churning up of the sea surface and, thereby, promoting cooling. Consequently,high sea surface temperatures, compared to normal, that dominated the North Atlantic last fall were replaced by cooler watersby late winter/early spring. The currentsea surface temperature pattern is fairly similar to the pattern that prevailed in early April of last season. However, during last spring/summer, the waters warmed much faster than normal across most of the Atlantic, and by the peak of the Atlantic hurricane season, the sea surface temperatures were much warmer than normal across most of the tropical Atlantic, providing increased fuel for the hurricanes that formed last year (most notably, Irma, Jose, and Maria). Several climate models including recent predictions from the National Weather Service Climate Forecast System model indicate that the tropical Atlantic will become warmer than normal by August-October. If this holds true, at least a somewhat active hurricane season would be likely. The skill of Colorado Statesseasonal forecasts improves as the season approaches. Looking at past predictions, the early April forecast has modest skill, while the skill increases considerably by June and especially by August. The modest skill in early April is to be expected, given that much can change in the atmosphere/ocean system between early April and the peak of the Atlantic hurricane season. This was demonstrated clearly last season, where early seasonal forecasts issued by CSU and other agencies predicted a near- or even slightly below-normal season, given the anticipated El Nio conditions. However, by early August, most groups correctly predicted a well above-average Atlantic hurricane season, as El Nio chances diminished and the tropical Atlantic anomalously warmed. As is typically the case with early seasonal outlooks, the primary area of uncertainty lies in whether El Nio develops. Should a significant El Nio develop, Atlantic seasonal hurricane forecasts would likely be reduced. Alternatively, should the tropical Pacific have neutral conditions and the Atlantic were tomarkedly warm, seasonal forecasts would likely increase. Many groups will issue seasonal hurricane forecasts over the next few weeks, and they will be displayed on a seasonal hurricane forecast compilation website jointly developed by the Barcelona Supercomputing Center, XL Catlin and CSU. A more detailed discussion of the 2018 outlook from CSU as well as archives of past outlooks are available here. The 2018 list of storm names will be the same as 2012s, with the exception of Sandy, which was retired and replaced with Sara.]", "title": "Another busy Atlantic hurricane season expected, but unlikely as brutal as the last one - The Washington Post", "urlToImage": "https://www.washingtonpost.com/pbox.php?url=http://www.washingtonpost.com/blogs/capital-weather-gang/files/2018/04/sep8_katia_irma_jose.jpg&w=1484&op=resize&opt=1&filter=antialias&t=20170517"}], "https://www.washingtonpost.com/news/early-lead/wp/2018/04/05/brock-lesnar-and-conor-mcgregor-will-fight-again-in-ufc-dana-white-says/": [{"author": "http://www.facebook.com/des.bieler", "description": "\"I don’t think anybody is going to be huge Conor McGregor fans after this,” Dana White said.", "publishedAt": "2018-04-06T03:11:15Z", "source": "The Washington Post", "text": "[Conor McGregor responded to UFC President Dana Whites decision to strip him of his lightweight belt in typically understated fashion: by tweeting an unprintable insult, crashing a pre-fight press event, chucking a barricade andprompting a scene of general mayhem that left at least one fighter injured and organizers stunned. For his trouble, McGregor appears to be in some. Citing law enforcement sources, News 4 in New York reports McGregor was arrested and is expected to be charged with assault after his role in Thursdays fracas that left UFC fighter Michael Chiesa in the hospital with a facial laceration. Champion UFC fighter Conor McGregor is in custody and is at the NYPD's 78th precinct where he is expected to be charged with assault following an incident in Brooklyn, New York, according to two senior New York City law enforcement officials. pic.twitter.com/w1fpmZQ4oz, White told multipleoutlets after the episode Thursday afternoon in Brooklyn that awarrant is out for McGregors arrest, but both ABC News and MMAFightings Marc Raimondi reported that there was no warrant, citing the New York Police Department. That seems to have changed. Per TMZ, McGregor turned himself in. Whitealso said that Chiesa, who was scheduled to fight in Saturdays card, had been cut in the face and was in the hospital, and that Artem Lobov, a McGregor ally who was apparently part of the incident, would be pulled from the card. [ Conor McGregor says hes done prizefighting, wants to legitimize UFC title ], In truth, it was unclear whether Thursdays incident was prompted by White stripping McGregor of his belt, or by previous bad feelings between McGregors camp andKhabib Nurmagomedov, scheduled to fight for McGregors belt in Saturdays main event. Nurmagomedov was filmed in a confrontation with Lobov, the McGregor ally, earlier this week. On Thursday, McGregor and his entourage approacheda large vehicle full of fighters that was leaving Barclays Center in Brooklyn after the press event, according to MMA Fightings Ariel Helwaniand videos posted of the incident. Chairs were thrown through the van window and one passenger on the van was injured, Helwani reported, in an apparent reference toChiesa. Videos posted to social media show a chaotic scene, with at least one guardrail being flung and general disorder. (A fuller video of the bus incident is here; it contains explicit language.), Wild video from Felice Herrig's Instagram of Conor McGregor and company wrecking things behind the scenes. pic.twitter.com/tFqZ16JBqy, Conor went bananas and put a beating on the van that we were in, Chiesas coach Rick Little told MMAjunkie. A million security guards had to restrain him. Mikes cut up now. Hes got marks on him, for sure. I dont think too serious. Everything happened so fast, it was just like we got jumped. Little told the site that his fighter had been cut by shattered glass. And some media members at the arena reportedthat the target of McGrergors ire was apparently Nurmagomedov, who seemed to believe that was the case. I am laughing inside, the Russian told Helwani. You broke window? Why? Come inside. If you real gangster why dont you come inside? This is big history gangster place. Brooklyn. You want to talk to me? Send me location. I am going to come. No problem. White, meanwhile, called the incident the most despicable thing in UFC history, according to ESPNs Okamoto. You want to grab 30 [expletive] friends and come down here and do what you did today? White said in a video posted by Okamoto. Its disgusting. And I dont think anybody is going to be huge Conor McGregor fans after this. I dont know if hes on drugs or what his deal is, but to come and do this and act like this. Later Thursday night, the UFC issued a statement regarding the incident:, Thursday afternoon, following the UFC 223 media day at Barclays Center in Brooklyn, an incident in the facility injured two athletes on Saturdays card, forcing them to be pulled from the event. Lightweight Michael Chiesa, who received several facial cuts, was deemed unfit to fight by the New York State Athletic Commission and the UFC medical team, and he was removed from his bout against Anthony Pettis. Flyweight Ray Borg, who was scheduled to face Brandon Moreno, was deemed unfit to fight as well due to multiple cornea abrasions. Also removed from the card was the featherweight bout between Artem Lobov and Alex Caceres due to Lobovs involvement in the incident. UFC 223 will proceed as scheduled with 10 bouts. Whites anger toward longtime UFC moneymaker McGregor seemed genuine, but others quickly pointed out that a McGregor-Nurmagomedov fightmight be more lucrative after Thursdays drama. Daniel Cormier, one of the sports stars, tweeted that McGregor should be taken into custody and escorted to the arena Saturday to make him fight Khabib Thats true punishment. White had announced earlier this week there would be no interim champ following Saturdays scheduled lightweight main event between Max Holloway and Nurmagomedov. When this fight is over, champion, White saidat a news conference, gesturing to Nurmagomedov and Holloway. One of these guys will be the champion. This news was not taken well by McGregor, the previous permanent holder of that title. Yousll strip me of nothing, he tweeted very early Thursday morning,beforecalling UFC officialsan unprintable word. McGregor won the lightweight title by defeating Eddie Alvarez at UFC 205 in a November 2016 bout but stepped away from the octagon to train for last years lucrative boxing match against Floyd Mayweather. Ferguson stepped in to win an interim lightweight belt in McGregors absence, but White said Saturdays bout between Nurmagomedov and Holloway will decide a new official champion. Tony Ferguson isnt being stripped. The only person here who is losing a belt is Conor. Conors losing the belt, these two are fighting for the belt, White said at the news conference. The interim belt that he had, those two [Nurmagomedov and Ferguson] were supposed to fight doesnt happen. One of these guys will be the champion. Tony is still the number one contender. White insisted that McGregor is coming back this year, 100 percent, adding, Well see how this thing plays out [with the lightweight title], and well go from there. White later reiterated that stance on Fox Sports UFC Tonight, saying: Conor does want to fight. Conor and I have been talking a lot. Conor does want to come back, he does want to fight, so he will fight this year. White wasnt done with his somewhat surprising announcements Wednesday, asserting on UFC Tonight that former UFC heavyweight champion Brock Lesnar also will return to the octagon despite his past issues with failed drug tests. BrockLesnars coming back, White said. I dont know when, but yes, he is. Lesnar has not fought for Whites company since the infamous UFC 200 in July 2016, when he defeated Mark Hunt but later failed a pair of drug tests, leading to a lawsuit from Hunt. McGregor was supposed to have headlined that card, in a rematch with Nate Diaz, but White pulled the fight after the Irishman refused to break training for some promotional appearances. A former UFC heavyweight champion and a major box-office draw, Lesnar had retired from MMA in 2011 and has been a pro-wrestling star with the WWE. Having retired again from MMA in February 2017, just weeks after receiving one-year bans from both theU.S. Anti-Doping Agency and theNevada State Athletic Commission, Lesnar presumably would have to serve the remainder of his suspensions before being cleared to compete again for the UFC. The contract between the 40-year-old Lesnar and the WWE is set to expire shortly after Sundays WrestleMania 34, at which he will take on Roman Reigns, and his recent flirtations with White have been viewed by some as simply attempts to gain leverage with the pro wrestling company. According to noted MMA reporter Helwani, though, a deal is in place with the UFC and both sides just need to finalize it. With the departure of Ronda Rousey, the inability of Jones to stay clean and McGregors lengthyabsence, the UFC has lacked major star power over the past year and a half or so, although Georges St-Pierres long-awaited comeback has helped. The possible returns of McGregor especially if he can be matched up with St-Pierre and Lesnar could be just what the doctor ordered for White and Co. but MMA fans will be forgiven for preferring to believe it when they see it. Read more from The Post:, MMA fighters front flip off KOd opponents body leads to suspension, apology, Ronda Rousey put through a table by Stephanie McMahon ahead of WrestleMania, Fired over an Instagram post and a rumor, Saints cheerleader could force NFL to address double standard, An ace at Augusta had Jack Nicklaus in tears. Another dislocated Tony Finaus ankle.]", "title": "Conor McGregor reportedly arrested, expected to be charged with assault after ravaging UFC event - The Washington Post", "urlToImage": "https://www.washingtonpost.com/resizer/HA6UE9Wd-g6MdChrAxfigD0F3Dk=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/ZXEBIXSHOQ6XLDID53YCASKT6Y.jpg"}], "https://www.washingtonpost.com/news/worldviews/wp/2018/04/06/how-victor-orban-became-the-real-threat-to-the-west/": [{"author": "https://www.facebook.com/ishaantharoor", "description": "Orban's potential reelection this weekend in Hungary may mark a new moment of reckoning for Europe.", "publishedAt": "2018-04-06T05:04:08Z", "source": "The Washington Post", "text": "[ Analysis Interpretation of the news based on evidence, including data, as well as anticipating how events might unfold based on past events Want smart analysis of the most important news in your inbox every weekday along with other global reads, interesting ideas and opinions to know? Sign up for the Today's WorldView newsletter. Hungary's Prime Minister Viktor Orban seeks to win reelection fora third consecutive term thisSunday. His ruling Fidesz party is widely expected to secure enough seats to give Orban a fresh mandate, although a fragmented votecould deprive him of a decisive majority. In power since 2010, Orban is Europe's second-longest-rulingleader after Germany's Angela Merkel and he's become just as influential. A liberal who drifted right in the decades after the fall of the Soviet Union,Orban, 54, now styles himself an illiberal democrat, a majoritarian populist who stands up for his nation's interests, traditions and culture. Since 2015,no European leader has been more vehement in opposition to migrants and refugees than Orban, whose scaremongering over Islam and the threats to Europe's Christian identity found loud echoes among the continent's far right and prefigured the arrival of a divisive demagogue in the White House. Austria's new prime minister, Sebastian Kurz, who came to power in alliance with the far right, praised Orban's tough stance on immigration. President Trump seemed to take a page from Orban's book when he delivered a thundering blood-and-soil speechlast year in Poland. On a trip to Europethis year, Stephen K. Bannon, far-right ideologue and formerTrump adviser, hailed Orban as a real hero and the most significant guy in the European scene. Orbans defiance presents the E.U. with a far different threat than the one it faced in 2016, when Britain voted to exit and speculation swirled over who might go next, my colleagues Griff Witte and Michael Birnbaumwrote.It may be more serious than that a challenge that endangers the character of the union. Orban'scritics see him as a soft autocrat.Hungary under his rule is far from a jackbooted dictatorship, but its democracy is diverging markedly from that of many of its partners in the European Union. Opponents point to a new class of crony capitalists establishing fiefdoms with the prime minister's blessing. Orban's government exercises subtle yet domineering control over the judiciary and the media. It has reworked the country's electoral system to its benefit partly through gerrymandering and giving citizenship to ethnic Hungarians abroad, the vast majority of whom opt for Fidesz. And it is squeezing the space for civil society,stepping up efforts to target NGOs and other institutions whose politics or work do not align with the ruling party's interest. Politico's Lili Bayerlikened Orban'stenureto an earlier era of Communist apparatchiks.When it comes to the practicalities of governing and securing support, both Orban and his Polish counterparts have deployed an approach that in its paternalism, heavy-handedness, obsession with external enemies and even class-based rhetoric is reminiscent of their despised predecessors, she wrote. But at least for now, it seems to be a winning strategy. Orban beats the drumof a far-right populist, albeit one who has a seat at the table in Brussels and powerful allies across Europe. His signature tactic is a weaponized culture war, anchored in an emotional narrative of Hungarian victimhood and redemption. He wants to make the nation great again after centuries of subjugation and humiliation at the hands of the Ottomans, the victors of World War I, the Soviet Union and now menacing globalists to the west. We sent homethe sultan with his army, the Habsburg kaiser with his raiders and the Soviets with their comrades, Orbansaid at rally to more than 100,000 people in central Budapest last month. Now we will send home Uncle George. That was a reference to Jewish American financier George Soros, who Orban cast as a central villain in the country's politics, the shadowy hand pulling the stringsin the background, funding enemies who are somehoweager to flood the nation with migrants and otherwise betray the people. Our opponents are fighting, kicking, biting,Orban said, darkly warning of a purge to come. But, of course, after the elections we will take revenge moral, political and legal revenge. It's particularly galling to some observers inBrussels that Orban can conduct such a campaign while drinking deeply from the economic well of the European Union.Generous E.U. aid and subsidies in 2016, Hungary received $5.5 billionin E.U. funds, while contributing only around $1.2 billion have helped the leaderbankroll giant public works programs and bring down unemployment. Orban is waging his freedom fight against the E.U. with huge amounts of E.U. money, Peter Kreko, executive director of the Budapest-based policy research firm Political Capital, told my colleagues. Lenin said 'Capitalists will sell the rope to us with which well hang them.' Well, the E.U. is not selling. Its giving it to Orban for free. Meanwhile, Fidesz's place inside the European People's Party, a powerful center-right alliance in the European Parliament, gives it a degree of political cover. Orban can call on the support of prominent Western European politicians, including leading figures in Merkel'sBavarian sister party, who share Orban's antipathy toward migrants. This institutional backing, critics say, has prevented the European Union from taking a tougher line with Hungary. Orbans success over the years does not demonstrate that right-wing populism is an unstoppable force, Princeton political scientist Jan-Werner Muller wrote in an essay for the New York Review of Books. Rather, his victories have been enabled by the cynicism of center-right politicians in Europe who refuse to distance themselves from what is in fact a white nationalist government. Orban's detractors warn that the siren song of his populism is sending his country on a perilous course. It seems that Orbans model is Miklos Horthys antediluvian regime in interwar Hungary, a soft dictatorship that defied the countrys real and imagined foreign enemies and initially appealed to Hungarian pride, wrote Charles Gati, a professor at the Johns Hopkins School of Advanced International Studies. But it left humiliation and destruction in its wake at the end of World War II. Muller, in a separate op-ed for the New York Times, feared that Sunday's ballot marked a moment of reckoning for Europe. This election is probably the last before Hungary shifts from what is already a deeply damaged democracy to what political scientists would call a full-blown electoral autocracy, he wrote. Elections would still be held in the future, but a real turnover of power would be impossible. Thus the weekends ballot is also a test as to whether there can be an autocracy inside the European Union, a self-declared club of democracies. Want smart analysis of the most important news in your inbox every weekday along with other global reads, interesting ideas and opinions to know? Sign up for the Today's WorldView newsletter.]", "title": "How Viktor Orban became the real threat to the West - The Washington Post", "urlToImage": "https://www.washingtonpost.com/resizer/cifgQlm6sF4uhDbwh9gsBXlC0-Q=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/7IN3BJXALA5AZC72LYVRYHLBH4.jpg"}], "https://www.washingtonpost.com/world/asia_pacific/koreas-begin-preparatory-talks-to-set-up-kim-moon-summit/2018/04/04/d8ab168e-3878-11e8-af3c-2123715f78df_story.html": [{"author": null, "description": "The rival Koreas held preparatory talks Thursday for a summit later this month between North Korean leader Kim Jong Un and South Korean President Moon Jae-in amid a global diplomatic push to resolve tensions over the North’s nuclear program.", "publishedAt": "2018-04-05T09:11:15Z", "source": "The Washington Post", "text": "[SEOUL, South Korea The rival Koreas held preparatory talks Thursday for a summit later this month between North Korean leader Kim Jong Un and South Korean President Moon Jae-in amid a global diplomatic push to resolve tensions over the Norths nuclear program. The meeting of working-level officials at the border village of Panmunjom was to discuss security, protocol and media coverage issues for the planned April 27 summit. South Koreas presidential Blue House said the two sides agreed not to disclose the contents of the discussions until a final agreement is reached. The Koreas agreed on the date for the summit after a high-level meeting last week. South Korean officials have said the summit will focus on North Koreas nuclear disarmament, although the North hasnt confirmed this through its state-run media. A separate summit between Kim and U.S. President Donald Trump is anticipated by the end of May. The two Koreas agreed Thursday to hold another preparatory meeting to work out the details of the April 27 summit, which is to take place in the South Korea-controlled side of the border village, Panmunjom. The Koreas will need to agree on how Kim will arrive at the venue, and there has been media speculation that he would cross the military demarcation line that bisects the Koreas by foot in a symbolic gesture. The Koreas also need to determine how many times he and Moon would meet that day and whether parts of the meetings would be broadcast on live television. The Koreas have held only two summits since the 1950-53 Korean War. Kim made a surprise visit to Beijing last month and met President Xi Jinping, which appeared to be aimed at improving both countries positions ahead of Kims planned summits with Moon and Trump. In setting up separate talks with Beijing, Seoul, Washington, and potentially Moscow and Tokyo, North Korea may be moving to disrupt any united front among its negotiating counterparts. By reintroducing China, which is North Koreas only major ally, as a major player, the North also gains leverage against South Korea and the United States, analysts say. The Norths diplomatic outreach comes after an unusually provocative year in which it conducted its most powerful nuclear test to date and test-launched three intercontinental ballistic missiles designed to target the U.S. mainland. Its widely seen as an effort by the North, squeezed by heavy sanctions, to break out of isolation and improve its economy. South Korea says Kim has expressed a willingness to negotiate nuclear disarmament in his talks with Moon and Trump. Some analysts say getting the North to commit to denuclearization and agree to a robust verification regime could be a difficult process and take many years. North Korea has been repeatedly accused over the past two decades of using disarmament talks to ease outside pressure and win badly needed aid, while secretly pushing ahead with weapons development. Copyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.]", "title": "Koreas holds preparatory talks to set up Kim-Moon summit - The Washington Post", "urlToImage": "https://www.washingtonpost.com/rf/image_1484w/2010-2019/Wires/Images/2018-04-05/AP/Koreas_Tensions_24271.jpg-b8aeb.jpg?t=20170517"}]}